
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AIModule
/// dependency: AkAudio
/// dependency: AnimGraphRuntime
/// dependency: ApexDestruction
/// dependency: AudioSynesthesia
/// dependency: CinematicCamera
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: Foliage
/// dependency: GameplayAbilities
/// dependency: GameplayTags
/// dependency: GameplayTasks
/// dependency: InputCore
/// dependency: KawaiiPhysics
/// dependency: KuroAnim
/// dependency: KuroAudio
/// dependency: KuroComponent
/// dependency: KuroCurve
/// dependency: KuroGameplay
/// dependency: KuroGAS
/// dependency: KuroInput
/// dependency: KuroRenderingRuntimeBPPlugin
/// dependency: KuroSplines
/// dependency: KuroUtility
/// dependency: LevelSequence
/// dependency: LGUI
/// dependency: MediaAssets
/// dependency: NavigationSystem
/// dependency: Niagara
/// dependency: PhysicsCore
/// dependency: PrefabSystem
/// dependency: ProceduralMeshComponent
/// dependency: SMSystem
/// dependency: UMG

/// Enum /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/E_Cloud_Presents.E_Cloud_Presents
/// Size: 0x01 (1 bytes)
enum class E_Cloud_Presents : uint8_t
{
	E_Cloud_Presents__NewEnumerator0                                                 = 0,
	E_Cloud_Presents__NewEnumerator1                                                 = 1,
	E_Cloud_Presents__NewEnumerator2                                                 = 2,
	E_Cloud_Presents__NewEnumerator3                                                 = 3,
	E_Cloud_Presents__NewEnumerator26                                                = 4,
	E_Cloud_Presents__NewEnumerator5                                                 = 5,
	E_Cloud_Presents__NewEnumerator6                                                 = 6,
	E_Cloud_Presents__NewEnumerator7                                                 = 7,
	E_Cloud_Presents__NewEnumerator8                                                 = 8,
	E_Cloud_Presents__NewEnumerator9                                                 = 9,
	E_Cloud_Presents__NewEnumerator10                                                = 10,
	E_Cloud_Presents__NewEnumerator11                                                = 11,
	E_Cloud_Presents__NewEnumerator12                                                = 12,
	E_Cloud_Presents__NewEnumerator13                                                = 13,
	E_Cloud_Presents__NewEnumerator14                                                = 14,
	E_Cloud_Presents__NewEnumerator16                                                = 15,
	E_Cloud_Presents__NewEnumerator17                                                = 16,
	E_Cloud_Presents__NewEnumerator18                                                = 17,
	E_Cloud_Presents__NewEnumerator19                                                = 18,
	E_Cloud_Presents__NewEnumerator20                                                = 19,
	E_Cloud_Presents__NewEnumerator4                                                 = 20,
	E_Cloud_Presents__NewEnumerator21                                                = 21,
	E_Cloud_Presents__NewEnumerator22                                                = 22,
	E_Cloud_Presents__NewEnumerator23                                                = 23,
	E_Cloud_Presents__NewEnumerator27                                                = 24,
	E_Cloud_Presents__NewEnumerator25                                                = 25,
	E_Cloud_Presents__NewEnumerator29                                                = 26,
	E_Cloud_Presents__NewEnumerator28                                                = 27,
	E_Cloud_Presents__NewEnumerator30                                                = 28,
	E_Cloud_Presents__NewEnumerator15                                                = 29
};

/// Enum /Game/Aki/Render/RuntimeBP/GI/Data/TOD/PresetSelection.PresetSelection
/// Size: 0x01 (1 bytes)
enum class PresetSelection : uint8_t
{
	PresetSelection__NewEnumerator0                                                  = 0,
	PresetSelection__NewEnumerator3                                                  = 1,
	PresetSelection__NewEnumerator1                                                  = 2,
	PresetSelection__NewEnumerator2                                                  = 3,
	PresetSelection__NewEnumerator5                                                  = 4
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/Manager/ECharacterRenderingType.ECharacterRenderingType
/// Size: 0x01 (1 bytes)
enum class ECharacterRenderingType : uint8_t
{
	ECharacterRenderingType__NewEnumerator1                                          = 0,
	ECharacterRenderingType__NewEnumerator6                                          = 1,
	ECharacterRenderingType__NewEnumerator2                                          = 2,
	ECharacterRenderingType__NewEnumerator3                                          = 3,
	ECharacterRenderingType__NewEnumerator5                                          = 4,
	ECharacterRenderingType__NewEnumerator8                                          = 5,
	ECharacterRenderingType__NewEnumerator9                                          = 6,
	ECharacterRenderingType__NewEnumerator10                                         = 7,
	ECharacterRenderingType__NewEnumerator4                                          = 8
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraType.EFightCameraType
/// Size: 0x01 (1 bytes)
enum class EFightCameraType : uint8_t
{
	EFightCameraType__NewEnumerator0                                                 = 0,
	EFightCameraType__NewEnumerator1                                                 = 1,
	EFightCameraType__NewEnumerator2                                                 = 2,
	EFightCameraType__NewEnumerator3                                                 = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EBaseCurveType.EBaseCurveType
/// Size: 0x01 (1 bytes)
enum class EBaseCurveType : uint8_t
{
	EBaseCurveType__NewEnumerator0                                                   = 0,
	EBaseCurveType__NewEnumerator4                                                   = 1,
	EBaseCurveType__NewEnumerator5                                                   = 2,
	EBaseCurveType__NewEnumerator3                                                   = 3,
	EBaseCurveType__NewEnumerator6                                                   = 4,
	EBaseCurveType__NewEnumerator1                                                   = 5,
	EBaseCurveType__NewEnumerator2                                                   = 6,
	EBaseCurveType__NewEnumerator7                                                   = 7,
	EBaseCurveType__NewEnumerator8                                                   = 8,
	EBaseCurveType__NewEnumerator9                                                   = 9,
	EBaseCurveType__NewEnumerator10                                                  = 10,
	EBaseCurveType__NewEnumerator11                                                  = 11
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/Manager/ECharacterDitherType.ECharacterDitherType
/// Size: 0x01 (1 bytes)
enum class ECharacterDitherType : uint8_t
{
	ECharacterDitherType__NewEnumerator0                                             = 0,
	ECharacterDitherType__NewEnumerator1                                             = 1,
	ECharacterDitherType__NewEnumerator2                                             = 2,
	ECharacterDitherType__NewEnumerator3                                             = 3
};

/// Enum /Game/Aki/Character/Input/Enum/ECommandType.ECommandType
/// Size: 0x01 (1 bytes)
enum class ECommandType : uint8_t
{
	ECommandType__NewEnumerator0                                                     = 0,
	ECommandType__NewEnumerator1                                                     = 1,
	ECommandType__NewEnumerator2                                                     = 2,
	ECommandType__NewEnumerator3                                                     = 3,
	ECommandType__NewEnumerator4                                                     = 4,
	ECommandType__NewEnumerator5                                                     = 5,
	ECommandType__NewEnumerator6                                                     = 6,
	ECommandType__NewEnumerator7                                                     = 7,
	ECommandType__NewEnumerator9                                                     = 8,
	ECommandType__NewEnumerator8                                                     = 9
};

/// Enum /Game/Aki/Data/LevelGamePlay/StrikeResponse/Stuct/SrikeElement.SrikeElement
/// Size: 0x01 (1 bytes)
enum class SrikeElement : uint8_t
{
	SrikeElement__NewEnumerator0                                                     = 0,
	SrikeElement__NewEnumerator1                                                     = 1,
	SrikeElement__NewEnumerator2                                                     = 2,
	SrikeElement__NewEnumerator3                                                     = 3,
	SrikeElement__NewEnumerator4                                                     = 4,
	SrikeElement__NewEnumerator5                                                     = 5,
	SrikeElement__NewEnumerator6                                                     = 6,
	SrikeElement__NewEnumerator7                                                     = 7,
	SrikeElement__NewEnumerator8                                                     = 8
};

/// Enum /Game/Aki/Data/Entity/Enum/EHeadStateViewType.EHeadStateViewType
/// Size: 0x01 (1 bytes)
enum class EHeadStateViewType : uint8_t
{
	EHeadStateViewType__NewEnumerator0                                               = 0,
	EHeadStateViewType__NewEnumerator1                                               = 1,
	EHeadStateViewType__NewEnumerator2                                               = 2,
	EHeadStateViewType__NewEnumerator3                                               = 3,
	EHeadStateViewType__NewEnumerator4                                               = 4,
	EHeadStateViewType__NewEnumerator5                                               = 5,
	EHeadStateViewType__NewEnumerator6                                               = 6,
	EHeadStateViewType__NewEnumerator7                                               = 7,
	EHeadStateViewType__NewEnumerator8                                               = 8
};

/// Enum /Game/Aki/Data/Entity/Enum/EBossStateViewType.EBossStateViewType
/// Size: 0x01 (1 bytes)
enum class EBossStateViewType : uint8_t
{
	EBossStateViewType__NewEnumerator0                                               = 0,
	EBossStateViewType__NewEnumerator1                                               = 1
};

/// Enum /Game/Aki/Render/RuntimeBP/Battle/EWuYinQuState.EWuYinQuState
/// Size: 0x01 (1 bytes)
enum class EWuYinQuState : uint8_t
{
	EWuYinQuState__NewEnumerator0                                                    = 0,
	EWuYinQuState__NewEnumerator1                                                    = 1,
	EWuYinQuState__NewEnumerator2                                                    = 2,
	EWuYinQuState__NewEnumerator3                                                    = 3,
	EWuYinQuState__NewEnumerator4                                                    = 4
};

/// Enum /Game/Aki/Data/Interaction/Enum/EinteractionIconType.EInteractionIconType
/// Size: 0x01 (1 bytes)
enum class EInteractionIconType : uint8_t
{
	EInteractionIconType__NewEnumerator0                                             = 0,
	EInteractionIconType__NewEnumerator1                                             = 1,
	EInteractionIconType__NewEnumerator2                                             = 2
};

/// Enum /Game/Aki/Data/Interaction/Enum/EInteractionType.EInteractionType
/// Size: 0x01 (1 bytes)
enum class EInteractionType : uint8_t
{
	EInteractionType__NewEnumerator0                                                 = 0,
	EInteractionType__NewEnumerator1                                                 = 1
};

/// Enum /Game/Aki/Data/Entity/Enum/EBodyType.EBodyType
/// Size: 0x01 (1 bytes)
enum class EBodyType : uint8_t
{
	EBodyType__NewEnumerator0                                                        = 0,
	EBodyType__NewEnumerator1                                                        = 1,
	EBodyType__NewEnumerator2                                                        = 2,
	EBodyType__NewEnumerator3                                                        = 3,
	EBodyType__NewEnumerator4                                                        = 4,
	EBodyType__NewEnumerator5                                                        = 5,
	EBodyType__NewEnumerator6                                                        = 6
};

/// Enum /Game/Aki/Character/BaseCharacter/EClimbState.EClimbState
/// Size: 0x01 (1 bytes)
enum class EClimbState : uint8_t
{
	EClimbState__NewEnumerator0                                                      = 0,
	EClimbState__NewEnumerator1                                                      = 1,
	EClimbState__NewEnumerator2                                                      = 2,
	EClimbState__NewEnumerator3                                                      = 3,
	EClimbState__NewEnumerator4                                                      = 4
};

/// Enum /Game/Aki/GamePlay/Cipher/ECipherGameplayType.ECipherGameplayType
/// Size: 0x01 (1 bytes)
enum class ECipherGameplayType : uint8_t
{
	ECipherGameplayType__NewEnumerator0                                              = 0,
	ECipherGameplayType__NewEnumerator1                                              = 1,
	ECipherGameplayType__NewEnumerator2                                              = 2
};

/// Enum /Game/Aki/Data/Quest/Enum/EQuestHandleType.EQuestHandleType
/// Size: 0x01 (1 bytes)
enum class EQuestHandleType : uint8_t
{
	EQuestHandleType__NewEnumerator0                                                 = 0,
	EQuestHandleType__NewEnumerator1                                                 = 1
};

/// Enum /Game/Aki/Sequence/Manager/ESeqSwtichType.ESeqSwtichType
/// Size: 0x01 (1 bytes)
enum class ESeqSwtichType : uint8_t
{
	ESeqSwtichType__NewEnumerator0                                                   = 0,
	ESeqSwtichType__NewEnumerator1                                                   = 1,
	ESeqSwtichType__NewEnumerator2                                                   = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ECustomCameraMode.ECustomCameraMode
/// Size: 0x01 (1 bytes)
enum class ECustomCameraMode : uint8_t
{
	ECustomCameraMode__NewEnumerator2                                                = 0,
	ECustomCameraMode__NewEnumerator3                                                = 1,
	ECustomCameraMode__NewEnumerator4                                                = 2,
	ECustomCameraMode__NewEnumerator5                                                = 3,
	ECustomCameraMode__NewEnumerator6                                                = 4
};

/// Enum /Game/Aki/Character/Input/Enum/EInputState.EInputState
/// Size: 0x01 (1 bytes)
enum class EInputState : uint8_t
{
	EInputState__NewEnumerator0                                                      = 0,
	EInputState__NewEnumerator1                                                      = 1,
	EInputState__NewEnumerator2                                                      = 2,
	EInputState__NewEnumerator3                                                      = 3
};

/// Enum /Game/Aki/Character/Input/Enum/EInputAction.EInputAction
/// Size: 0x01 (1 bytes)
enum class EInputAction : uint8_t
{
	EInputAction__NewEnumerator0                                                     = 0,
	EInputAction__NewEnumerator3                                                     = 1,
	EInputAction__NewEnumerator4                                                     = 2,
	EInputAction__NewEnumerator5                                                     = 3,
	EInputAction__NewEnumerator1                                                     = 4,
	EInputAction__NewEnumerator2                                                     = 5,
	EInputAction__NewEnumerator6                                                     = 6,
	EInputAction__NewEnumerator7                                                     = 7,
	EInputAction__NewEnumerator8                                                     = 8,
	EInputAction__NewEnumerator9                                                     = 9,
	EInputAction__NewEnumerator10                                                    = 10,
	EInputAction__NewEnumerator11                                                    = 11,
	EInputAction__NewEnumerator12                                                    = 12,
	EInputAction__NewEnumerator27                                                    = 13,
	EInputAction__NewEnumerator28                                                    = 14,
	EInputAction__NewEnumerator39                                                    = 15
};

/// Enum /Game/Aki/Core/Fight/EBulletObject.EBulletObject
/// Size: 0x01 (1 bytes)
enum class EBulletObject : uint8_t
{
	EBulletObject__NewEnumerator0                                                    = 0,
	EBulletObject__NewEnumerator1                                                    = 1,
	EBulletObject__NewEnumerator2                                                    = 2,
	EBulletObject__NewEnumerator3                                                    = 3
};

/// Enum /Game/Aki/Core/Fight/EBulletHitEffect.EBulletHitEffect
/// Size: 0x01 (1 bytes)
enum class EBulletHitEffect : uint8_t
{
	EBulletHitEffect__NewEnumerator0                                                 = 0,
	EBulletHitEffect__NewEnumerator1                                                 = 1,
	EBulletHitEffect__NewEnumerator2                                                 = 2,
	EBulletHitEffect__NewEnumerator3                                                 = 3,
	EBulletHitEffect__NewEnumerator4                                                 = 4,
	EBulletHitEffect__NewEnumerator5                                                 = 5,
	EBulletHitEffect__NewEnumerator6                                                 = 6,
	EBulletHitEffect__NewEnumerator7                                                 = 7,
	EBulletHitEffect__NewEnumerator8                                                 = 8,
	EBulletHitEffect__NewEnumerator9                                                 = 9
};

/// Enum /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/EBulletLogicStage.EBulletLogicStage
/// Size: 0x01 (1 bytes)
enum class EBulletLogicStage : uint8_t
{
	EBulletLogicStage__NewEnumerator5                                                = 0,
	EBulletLogicStage__NewEnumerator1                                                = 1,
	EBulletLogicStage__NewEnumerator2                                                = 2,
	EBulletLogicStage__NewEnumerator3                                                = 3,
	EBulletLogicStage__NewEnumerator4                                                = 4,
	EBulletLogicStage__NewEnumerator6                                                = 5
};

/// Enum /Game/Aki/Character/BaseCharacter/EBulletFollowType.EBulletFollowType
/// Size: 0x01 (1 bytes)
enum class EBulletFollowType : uint8_t
{
	EBulletFollowType__NewEnumerator0                                                = 0,
	EBulletFollowType__NewEnumerator1                                                = 1,
	EBulletFollowType__NewEnumerator2                                                = 2,
	EBulletFollowType__NewEnumerator3                                                = 3
};

/// Enum /Game/Aki/Core/Fight/EBulletTarget.EBulletTarget
/// Size: 0x01 (1 bytes)
enum class EBulletTarget : uint8_t
{
	EBulletTarget__NewEnumerator0                                                    = 0,
	EBulletTarget__NewEnumerator1                                                    = 1,
	EBulletTarget__NewEnumerator2                                                    = 2,
	EBulletTarget__NewEnumerator3                                                    = 3,
	EBulletTarget__NewEnumerator5                                                    = 4,
	EBulletTarget__NewEnumerator4                                                    = 5,
	EBulletTarget__NewEnumerator6                                                    = 6,
	EBulletTarget__NewEnumerator7                                                    = 7,
	EBulletTarget__NewEnumerator8                                                    = 8,
	EBulletTarget__NewEnumerator9                                                    = 9,
	EBulletTarget__NewEnumerator10                                                   = 10
};

/// Enum /Game/Aki/Character/BaseCharacter/EBulletRelativeDir.EBulletRelativeDir
/// Size: 0x01 (1 bytes)
enum class EBulletRelativeDir : uint8_t
{
	EBulletRelativeDir__NewEnumerator0                                               = 0,
	EBulletRelativeDir__NewEnumerator1                                               = 1,
	EBulletRelativeDir__NewEnumerator2                                               = 2,
	EBulletRelativeDir__NewEnumerator3                                               = 3,
	EBulletRelativeDir__NewEnumerator4                                               = 4
};

/// Enum /Game/Aki/Core/Fight/EInitialVelocityDirection.EInitialVelocityDirection
/// Size: 0x01 (1 bytes)
enum class EInitialVelocityDirection : uint8_t
{
	EInitialVelocityDirection__NewEnumerator0                                        = 0,
	EInitialVelocityDirection__NewEnumerator1                                        = 1,
	EInitialVelocityDirection__NewEnumerator2                                        = 2,
	EInitialVelocityDirection__NewEnumerator3                                        = 3,
	EInitialVelocityDirection__NewEnumerator4                                        = 4,
	EInitialVelocityDirection__NewEnumerator5                                        = 5,
	EInitialVelocityDirection__NewEnumerator7                                        = 6,
	EInitialVelocityDirection__NewEnumerator8                                        = 7,
	EInitialVelocityDirection__NewEnumerator9                                        = 8,
	EInitialVelocityDirection__NewEnumerator10                                       = 9,
	EInitialVelocityDirection__NewEnumerator11                                       = 10,
	EInitialVelocityDirection__NewEnumerator12                                       = 11
};

/// Enum /Game/Aki/Character/BaseCharacter/EBulletHitDirectionType.EBulletHitDirectionType
/// Size: 0x01 (1 bytes)
enum class EBulletHitDirectionType : uint8_t
{
	EBulletHitDirectionType__NewEnumerator0                                          = 0,
	EBulletHitDirectionType__NewEnumerator1                                          = 1
};

/// Enum /Game/Aki/Character/BaseCharacter/EBulletShape.EBulletShape
/// Size: 0x01 (1 bytes)
enum class EBulletShape : uint8_t
{
	EBulletShape__NewEnumerator0                                                     = 0,
	EBulletShape__NewEnumerator1                                                     = 1,
	EBulletShape__NewEnumerator2                                                     = 2,
	EBulletShape__NewEnumerator3                                                     = 3,
	EBulletShape__NewEnumerator5                                                     = 4,
	EBulletShape__NewEnumerator4                                                     = 5,
	EBulletShape__NewEnumerator6                                                     = 6,
	EBulletShape__NewEnumerator7                                                     = 7,
	EBulletShape__NewEnumerator8                                                     = 8,
	EBulletShape__NewEnumerator9                                                     = 9
};

/// Enum /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/EBulletLogicObstacles.EBulletLogicObstacles
/// Size: 0x01 (1 bytes)
enum class EBulletLogicObstacles : uint8_t
{
	EBulletLogicObstacles__NewEnumerator0                                            = 0,
	EBulletLogicObstacles__NewEnumerator1                                            = 1,
	EBulletLogicObstacles__NewEnumerator2                                            = 2
};

/// Enum /Game/Aki/Core/Fight/EBulletSyncType.EBulletSyncType
/// Size: 0x01 (1 bytes)
enum class EBulletSyncType : uint8_t
{
	EBulletSyncType__NewEnumerator0                                                  = 0,
	EBulletSyncType__NewEnumerator1                                                  = 1
};

/// Enum /Game/Aki/Character/BaseCharacter/EAimViewState.EAimViewState
/// Size: 0x01 (1 bytes)
enum class EAimViewState : uint8_t
{
	EAimViewState__NewEnumerator0                                                    = 0,
	EAimViewState__NewEnumerator1                                                    = 1
};

/// Enum /Game/Aki/Data/UiCameraAnimation/Enum/EUiCameraAnimationTargetType.EUiCameraAnimationTargetType
/// Size: 0x01 (1 bytes)
enum class EUiCameraAnimationTargetType : uint8_t
{
	EUiCameraAnimationTargetType__NewEnumerator0                                     = 0,
	EUiCameraAnimationTargetType__NewEnumerator1                                     = 1,
	EUiCameraAnimationTargetType__NewEnumerator2                                     = 2,
	EUiCameraAnimationTargetType__NewEnumerator4                                     = 3,
	EUiCameraAnimationTargetType__NewEnumerator5                                     = 4,
	EUiCameraAnimationTargetType__NewEnumerator6                                     = 5
};

/// Enum /Game/Aki/Data/UiCameraAnimation/Enum/EUiCameraAnimationRotationType.EUiCameraAnimationRotationType
/// Size: 0x01 (1 bytes)
enum class EUiCameraAnimationRotationType : uint8_t
{
	EUiCameraAnimationRotationType__NewEnumerator0                                   = 0,
	EUiCameraAnimationRotationType__NewEnumerator1                                   = 1,
	EUiCameraAnimationRotationType__NewEnumerator2                                   = 2,
	EUiCameraAnimationRotationType__NewEnumerator4                                   = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/EEnterClimb.EEnterClimb
/// Size: 0x01 (1 bytes)
enum class EEnterClimb : uint8_t
{
	EEnterClimb__NewEnumerator0                                                      = 0,
	EEnterClimb__NewEnumerator1                                                      = 1,
	EEnterClimb__NewEnumerator2                                                      = 2,
	EEnterClimb__NewEnumerator3                                                      = 3,
	EEnterClimb__NewEnumerator5                                                      = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/ECharViewDirectionState.ECharViewDirectionState
/// Size: 0x01 (1 bytes)
enum class ECharViewDirectionState : uint8_t
{
	ECharViewDirectionState__NewEnumerator0                                          = 0,
	ECharViewDirectionState__NewEnumerator1                                          = 1,
	ECharViewDirectionState__NewEnumerator2                                          = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ECharParentMoveState.ECharParentMoveState
/// Size: 0x01 (1 bytes)
enum class ECharParentMoveState : uint8_t
{
	ECharParentMoveState__NewEnumerator0                                             = 0,
	ECharParentMoveState__NewEnumerator1                                             = 1,
	ECharParentMoveState__NewEnumerator2                                             = 2,
	ECharParentMoveState__NewEnumerator3                                             = 3
};

/// Enum /Game/Aki/Core/Fight/EMoveTrajectory.EMoveTrajectory
/// Size: 0x01 (1 bytes)
enum class EMoveTrajectory : uint8_t
{
	EMoveTrajectory__NewEnumerator0                                                  = 0,
	EMoveTrajectory__NewEnumerator1                                                  = 1,
	EMoveTrajectory__NewEnumerator2                                                  = 2,
	EMoveTrajectory__NewEnumerator3                                                  = 3,
	EMoveTrajectory__NewEnumerator4                                                  = 4,
	EMoveTrajectory__NewEnumerator5                                                  = 5,
	EMoveTrajectory__NewEnumerator6                                                  = 6
};

/// Enum /Game/Aki/Character/BaseCharacter/ECharState.ECharState
/// Size: 0x01 (1 bytes)
enum class ECharState : uint8_t
{
	ECharState__NewEnumerator5                                                       = 0,
	ECharState__NewEnumerator0                                                       = 1,
	ECharState__NewEnumerator1                                                       = 2,
	ECharState__NewEnumerator32                                                      = 3,
	ECharState__NewEnumerator2                                                       = 4,
	ECharState__NewEnumerator33                                                      = 5,
	ECharState__NewEnumerator3                                                       = 6,
	ECharState__NewEnumerator34                                                      = 7,
	ECharState__NewEnumerator7                                                       = 8,
	ECharState__NewEnumerator28                                                      = 9,
	ECharState__NewEnumerator35                                                      = 10,
	ECharState__NewEnumerator27                                                      = 11,
	ECharState__NewEnumerator29                                                      = 12,
	ECharState__NewEnumerator30                                                      = 13,
	ECharState__NewEnumerator14                                                      = 14,
	ECharState__NewEnumerator15                                                      = 15,
	ECharState__NewEnumerator18                                                      = 16,
	ECharState__NewEnumerator31                                                      = 17,
	ECharState__NewEnumerator20                                                      = 18,
	ECharState__NewEnumerator21                                                      = 19,
	ECharState__NewEnumerator36                                                      = 20,
	ECharState__NewEnumerator37                                                      = 21
};

/// Enum /Game/Aki/Character/BaseCharacter/ECaughtType.ECaughtType
/// Size: 0x01 (1 bytes)
enum class ECaughtType : uint8_t
{
	ECaughtType__NewEnumerator0                                                      = 0,
	ECaughtType__NewEnumerator1                                                      = 1
};

/// Enum /Game/Aki/Character/BaseCharacter/EHitAnim.EHitAnim
/// Size: 0x01 (1 bytes)
enum class EHitAnim : uint8_t
{
	EHitAnim__NewEnumerator0                                                         = 0,
	EHitAnim__NewEnumerator1                                                         = 1,
	EHitAnim__NewEnumerator2                                                         = 2,
	EHitAnim__NewEnumerator3                                                         = 3,
	EHitAnim__NewEnumerator4                                                         = 4,
	EHitAnim__NewEnumerator5                                                         = 5,
	EHitAnim__NewEnumerator6                                                         = 6,
	EHitAnim__NewEnumerator7                                                         = 7,
	EHitAnim__NewEnumerator8                                                         = 8,
	EHitAnim__NewEnumerator9                                                         = 9,
	EHitAnim__NewEnumerator10                                                        = 10,
	EHitAnim__NewEnumerator11                                                        = 11
};

/// Enum /Game/Aki/Data/UiCameraAnimation/Enum/EUiCameraAnimationLocationType.EUiCameraAnimationLocationType
/// Size: 0x01 (1 bytes)
enum class EUiCameraAnimationLocationType : uint8_t
{
	EUiCameraAnimationLocationType__NewEnumerator0                                   = 0,
	EUiCameraAnimationLocationType__NewEnumerator1                                   = 1,
	EUiCameraAnimationLocationType__NewEnumerator2                                   = 2
};

/// Enum /Game/Aki/GamePlay/EGameplayFunctionType.EGameplayFunctionType
/// Size: 0x01 (1 bytes)
enum class EGameplayFunctionType : uint8_t
{
	EGameplayFunctionType__NewEnumerator0                                            = 0,
	EGameplayFunctionType__NewEnumerator1                                            = 1,
	EGameplayFunctionType__NewEnumerator2                                            = 2,
	EGameplayFunctionType__NewEnumerator3                                            = 3,
	EGameplayFunctionType__NewEnumerator4                                            = 4,
	EGameplayFunctionType__NewEnumerator5                                            = 5,
	EGameplayFunctionType__NewEnumerator6                                            = 6,
	EGameplayFunctionType__NewEnumerator7                                            = 7,
	EGameplayFunctionType__NewEnumerator8                                            = 8,
	EGameplayFunctionType__NewEnumerator9                                            = 9,
	EGameplayFunctionType__NewEnumerator10                                           = 10,
	EGameplayFunctionType__NewEnumerator11                                           = 11,
	EGameplayFunctionType__NewEnumerator13                                           = 12,
	EGameplayFunctionType__NewEnumerator14                                           = 13
};

/// Enum /Game/Aki/GamePlay/TriggerItems/ETriggerType.ETriggerType
/// Size: 0x01 (1 bytes)
enum class ETriggerType : uint8_t
{
	ETriggerType__NewEnumerator0                                                     = 0,
	ETriggerType__NewEnumerator1                                                     = 1,
	ETriggerType__NewEnumerator2                                                     = 2,
	ETriggerType__NewEnumerator3                                                     = 3,
	ETriggerType__NewEnumerator4                                                     = 4,
	ETriggerType__NewEnumerator6                                                     = 5,
	ETriggerType__NewEnumerator7                                                     = 6
};

/// Enum /Game/Aki/Character/BaseCharacter/ECaughtResultType.ECaughtResultType
/// Size: 0x01 (1 bytes)
enum class ECaughtResultType : uint8_t
{
	ECaughtResultType__NewEnumerator0                                                = 0,
	ECaughtResultType__NewEnumerator1                                                = 1,
	ECaughtResultType__NewEnumerator2                                                = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/EBulletType.EBulletType
/// Size: 0x01 (1 bytes)
enum class EBulletType : uint8_t
{
	EBulletType__NewEnumerator0                                                      = 0,
	EBulletType__NewEnumerator1                                                      = 1,
	EBulletType__NewEnumerator2                                                      = 2,
	EBulletType__NewEnumerator3                                                      = 3,
	EBulletType__NewEnumerator4                                                      = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/ERelation.ERelation
/// Size: 0x01 (1 bytes)
enum class ERelation : uint8_t
{
	ERelation__NewEnumerator2                                                        = 0,
	ERelation__NewEnumerator0                                                        = 1,
	ERelation__NewEnumerator1                                                        = 2
};

/// Enum /Game/Aki/Protocol/EAttributeType.EAttributeType
/// Size: 0x01 (1 bytes)
enum class EAttributeType : uint8_t
{
	EAttributeType__EAttributeType_None                                              = 0,
	EAttributeType__Lv                                                               = 1,
	EAttributeType__LifeMax                                                          = 2,
	EAttributeType__Life                                                             = 3,
	EAttributeType__Sheild                                                           = 4,
	EAttributeType__SheildDamageChange                                               = 5,
	EAttributeType__SheildDamageReduce                                               = 6,
	EAttributeType__Atk                                                              = 7,
	EAttributeType__Crit                                                             = 8,
	EAttributeType__CritDamage                                                       = 9,
	EAttributeType__Def                                                              = 10,
	EAttributeType__EnergyEfficiency                                                 = 11,
	EAttributeType__CDReduse                                                         = 12,
	EAttributeType__ReactionEfficiency                                               = 13,
	EAttributeType__AttackSpeed                                                      = 14,
	EAttributeType__DamageChange                                                     = 15,
	EAttributeType__DamageReduce                                                     = 16,
	EAttributeType__DamageChangeAuto                                                 = 17,
	EAttributeType__DamageChangeCast                                                 = 18,
	EAttributeType__DamageChangeUltra                                                = 19,
	EAttributeType__DamageChangeQTE                                                  = 20,
	EAttributeType__DamageChangePhys                                                 = 21,
	EAttributeType__DamageChangeElement1                                             = 22,
	EAttributeType__DamageChangeElement2                                             = 23,
	EAttributeType__DamageChangeElement3                                             = 24,
	EAttributeType__DamageChangeElement4                                             = 25,
	EAttributeType__DamageChangeElement5                                             = 26,
	EAttributeType__DamageChangeElement6                                             = 27,
	EAttributeType__DamageResistancePhys                                             = 28,
	EAttributeType__DamageResistanceElement1                                         = 29,
	EAttributeType__DamageResistanceElement2                                         = 30,
	EAttributeType__DamageResistanceElement3                                         = 31,
	EAttributeType__DamageResistanceElement4                                         = 32,
	EAttributeType__DamageResistanceElement5                                         = 33,
	EAttributeType__DamageResistanceElement6                                         = 34,
	EAttributeType__HealChange                                                       = 35,
	EAttributeType__HealedChange                                                     = 36,
	EAttributeType__DamageReducePhys                                                 = 37,
	EAttributeType__DamageReduceElement1                                             = 38,
	EAttributeType__DamageReduceElement2                                             = 39,
	EAttributeType__DamageReduceElement3                                             = 40,
	EAttributeType__DamageReduceElement4                                             = 41,
	EAttributeType__DamageReduceElement5                                             = 42,
	EAttributeType__DamageReduceElement6                                             = 43,
	EAttributeType__ReactionChange1                                                  = 44,
	EAttributeType__ReactionChange2                                                  = 45,
	EAttributeType__ReactionChange3                                                  = 46,
	EAttributeType__ReactionChange4                                                  = 47,
	EAttributeType__ReactionChange5                                                  = 48,
	EAttributeType__ReactionChange6                                                  = 49,
	EAttributeType__ReactionChange7                                                  = 50,
	EAttributeType__ReactionChange8                                                  = 51,
	EAttributeType__ReactionChange9                                                  = 52,
	EAttributeType__ReactionChange10                                                 = 53,
	EAttributeType__ReactionChange11                                                 = 54,
	EAttributeType__ReactionChange12                                                 = 55,
	EAttributeType__ReactionChange13                                                 = 56,
	EAttributeType__ReactionChange14                                                 = 57,
	EAttributeType__ReactionChange15                                                 = 58,
	EAttributeType__EnergyMax                                                        = 59,
	EAttributeType__Energy                                                           = 60,
	EAttributeType__SpecialEnergy1Max                                                = 61,
	EAttributeType__SpecialEnergy1                                                   = 62,
	EAttributeType__SpecialEnergy2Max                                                = 63,
	EAttributeType__SpecialEnergy2                                                   = 64,
	EAttributeType__SpecialEnergy3Max                                                = 65,
	EAttributeType__SpecialEnergy3                                                   = 66,
	EAttributeType__SpecialEnergy4Max                                                = 67,
	EAttributeType__SpecialEnergy4                                                   = 68,
	EAttributeType__StrengthMax                                                      = 69,
	EAttributeType__Strength                                                         = 70,
	EAttributeType__StrengthRecover                                                  = 71,
	EAttributeType__StrengthPunishTime                                               = 72,
	EAttributeType__StrengthRun                                                      = 73,
	EAttributeType__StrengthSwim                                                     = 74,
	EAttributeType__StrengthFastSwim                                                 = 75,
	EAttributeType__StrengthClimb                                                    = 76,
	EAttributeType__StrengthFastClimb                                                = 77,
	EAttributeType__HardnessMax                                                      = 78,
	EAttributeType__Hardness                                                         = 79,
	EAttributeType__HardnessRecover                                                  = 80,
	EAttributeType__HardnessPunishTime                                               = 81,
	EAttributeType__HardnessChange                                                   = 82,
	EAttributeType__HardnessReduce                                                   = 83,
	EAttributeType__ToughMax                                                         = 84,
	EAttributeType__Tough                                                            = 85,
	EAttributeType__ToughRecover                                                     = 86,
	EAttributeType__ToughChange                                                      = 87,
	EAttributeType__ToughReduce                                                      = 88,
	EAttributeType__ElementPower1                                                    = 89,
	EAttributeType__ElementPower2                                                    = 90,
	EAttributeType__ElementPower3                                                    = 91,
	EAttributeType__ElementPower4                                                    = 92,
	EAttributeType__ElementPower5                                                    = 93,
	EAttributeType__ElementPower6                                                    = 94,
	EAttributeType__SpecialDamageChange                                              = 95,
	EAttributeType__StrengthFastClimbCost                                            = 96,
	EAttributeType__ElementPropertyType                                              = 97,
	EAttributeType__WeakTime                                                         = 98,
	EAttributeType__IgnoreDefRate                                                    = 99,
	EAttributeType__IgnoreDamageResistancePhys                                       = 100,
	EAttributeType__IgnoreDamageResistanceElement1                                   = 101,
	EAttributeType__IgnoreDamageResistanceElement2                                   = 102,
	EAttributeType__IgnoreDamageResistanceElement3                                   = 103,
	EAttributeType__IgnoreDamageResistanceElement4                                   = 104,
	EAttributeType__IgnoreDamageResistanceElement5                                   = 105,
	EAttributeType__IgnoreDamageResistanceElement6                                   = 106,
	EAttributeType__NewEnumerator0                                                   = 107,
	EAttributeType__NewEnumerator1                                                   = 108,
	EAttributeType__NewEnumerator2                                                   = 109,
	EAttributeType__NewEnumerator3                                                   = 110,
	EAttributeType__NewEnumerator4                                                   = 111,
	EAttributeType__NewEnumerator5                                                   = 112,
	EAttributeType__NewEnumerator6                                                   = 113,
	EAttributeType__NewEnumerator7                                                   = 114,
	EAttributeType__NewEnumerator8                                                   = 115,
	EAttributeType__NewEnumerator9                                                   = 116,
	EAttributeType__NewEnumerator13                                                  = 117,
	EAttributeType__NewEnumerator12                                                  = 118,
	EAttributeType__NewEnumerator14                                                  = 119,
	EAttributeType__NewEnumerator15                                                  = 120,
	EAttributeType__NewEnumerator16                                                  = 121,
	EAttributeType__NewEnumerator17                                                  = 122,
	EAttributeType__NewEnumerator18                                                  = 123,
	EAttributeType__NewEnumerator19                                                  = 124,
	EAttributeType__NewEnumerator20                                                  = 125,
	EAttributeType__NewEnumerator21                                                  = 126,
	EAttributeType__NewEnumerator10                                                  = 127,
	EAttributeType__NewEnumerator11                                                  = 128,
	EAttributeType__NewEnumerator22                                                  = 129,
	EAttributeType__NewEnumerator23                                                  = 130,
	EAttributeType__NewEnumerator24                                                  = 131,
	EAttributeType__NewEnumerator25                                                  = 132,
	EAttributeType__NewEnumerator26                                                  = 133,
	EAttributeType__NewEnumerator27                                                  = 134,
	EAttributeType__NewEnumerator28                                                  = 135,
	EAttributeType__NewEnumerator29                                                  = 136
};

/// Enum /Game/Aki/Character/BaseCharacter/ECamp.ECamp
/// Size: 0x01 (1 bytes)
enum class ECamp : uint8_t
{
	ECamp__NewEnumerator0                                                            = 0,
	ECamp__NewEnumerator1                                                            = 1,
	ECamp__NewEnumerator2                                                            = 2,
	ECamp__NewEnumerator3                                                            = 3,
	ECamp__NewEnumerator4                                                            = 4,
	ECamp__NewEnumerator5                                                            = 5,
	ECamp__NewEnumerator6                                                            = 6,
	ECamp__NewEnumerator7                                                            = 7,
	ECamp__NewEnumerator8                                                            = 8,
	ECamp__NewEnumerator9                                                            = 9,
	ECamp__NewEnumerator10                                                           = 10,
	ECamp__NewEnumerator11                                                           = 11,
	ECamp__NewEnumerator12                                                           = 12,
	ECamp__NewEnumerator13                                                           = 13,
	ECamp__NewEnumerator14                                                           = 14
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialController/ECharacterControllerType.ECharacterControllerType
/// Size: 0x01 (1 bytes)
enum class ECharacterControllerType : uint8_t
{
	ECharacterControllerType__NewEnumerator0                                         = 0,
	ECharacterControllerType__NewEnumerator1                                         = 1,
	ECharacterControllerType__NewEnumerator2                                         = 2
};

/// Enum /Game/Aki/Data/Common/Enum/EWeatherState.EWeatherState
/// Size: 0x01 (1 bytes)
enum class EWeatherState : uint8_t
{
	EWeatherState__NewEnumerator0                                                    = 0,
	EWeatherState__NewEnumerator1                                                    = 1,
	EWeatherState__NewEnumerator2                                                    = 2
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialContainer/ECharacterBodySpecifiedType.ECharacterBodySpecifiedType
/// Size: 0x01 (1 bytes)
enum class ECharacterBodySpecifiedType : uint8_t
{
	ECharacterBodySpecifiedType__NewEnumerator0                                      = 0,
	ECharacterBodySpecifiedType__NewEnumerator1                                      = 1,
	ECharacterBodySpecifiedType__NewEnumerator2                                      = 2,
	ECharacterBodySpecifiedType__NewEnumerator3                                      = 3,
	ECharacterBodySpecifiedType__NewEnumerator5                                      = 4,
	ECharacterBodySpecifiedType__NewEnumerator6                                      = 5
};

/// Enum /Game/Aki/Data/Quest/Enum/EQuestStepState.EQuestStepState
/// Size: 0x01 (1 bytes)
enum class EQuestStepState : uint8_t
{
	EQuestStepState__NewEnumerator0                                                  = 0,
	EQuestStepState__NewEnumerator1                                                  = 1,
	EQuestStepState__NewEnumerator2                                                  = 2,
	EQuestStepState__NewEnumerator3                                                  = 3,
	EQuestStepState__NewEnumerator4                                                  = 4
};

/// Enum /Game/Aki/Data/Condition/Enum/SConDitionGroupType.SConditionGroupType
/// Size: 0x01 (1 bytes)
enum class SConditionGroupType : uint8_t
{
	SConditionGroupType__NewEnumerator0                                              = 0,
	SConditionGroupType__NewEnumerator1                                              = 1
};

/// Enum /Game/Aki/Data/Common/Enum/EDayState.EDayState
/// Size: 0x01 (1 bytes)
enum class EDayState : uint8_t
{
	EDayState__NewEnumerator0                                                        = 0,
	EDayState__NewEnumerator1                                                        = 1
};

/// Enum /Game/Aki/AI/AIFunctionCommon/EMovementDirection.EMovementDirection
/// Size: 0x01 (1 bytes)
enum class EMovementDirection : uint8_t
{
	EMovementDirection__NewEnumerator0                                               = 0,
	EMovementDirection__NewEnumerator1                                               = 1,
	EMovementDirection__NewEnumerator2                                               = 2,
	EMovementDirection__NewEnumerator3                                               = 3,
	EMovementDirection__NewEnumerator4                                               = 4
};

/// Enum /Game/Aki/Core/Fight/EBulletEffectParam.EBulletEffectParam
/// Size: 0x01 (1 bytes)
enum class EBulletEffectParam : uint8_t
{
	EBulletEffectParam__NewEnumerator0                                               = 0
};

/// Enum /Game/Aki/Core/Fight/EBulletBaseSpecificParam.EBulletBaseSpecificParam
/// Size: 0x01 (1 bytes)
enum class EBulletBaseSpecificParam : uint8_t
{
	EBulletBaseSpecificParam__NewEnumerator0                                         = 0,
	EBulletBaseSpecificParam__NewEnumerator1                                         = 1
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillType.ESkillType
/// Size: 0x01 (1 bytes)
enum class ESkillType : uint8_t
{
	ESkillType__NewEnumerator0                                                       = 0,
	ESkillType__NewEnumerator1                                                       = 1,
	ESkillType__NewEnumerator3                                                       = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/EAnsBlackboardType.EAnsBlackboardType
/// Size: 0x01 (1 bytes)
enum class EAnsBlackboardType : uint8_t
{
	EAnsBlackboardType__NewEnumerator2                                               = 0,
	EAnsBlackboardType__NewEnumerator1                                               = 1,
	EAnsBlackboardType__NewEnumerator0                                               = 2,
	EAnsBlackboardType__NewEnumerator3                                               = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraSidestep.EFightCameraSidestep
/// Size: 0x01 (1 bytes)
enum class EFightCameraSidestep : uint8_t
{
	EFightCameraSidestep__NewEnumerator7                                             = 0,
	EFightCameraSidestep__NewEnumerator0                                             = 1,
	EFightCameraSidestep__NewEnumerator1                                             = 2,
	EFightCameraSidestep__NewEnumerator2                                             = 3,
	EFightCameraSidestep__NewEnumerator3                                             = 4,
	EFightCameraSidestep__NewEnumerator4                                             = 5,
	EFightCameraSidestep__NewEnumerator5                                             = 6,
	EFightCameraSidestep__NewEnumerator6                                             = 7,
	EFightCameraSidestep__NewEnumerator8                                             = 8,
	EFightCameraSidestep__NewEnumerator9                                             = 9,
	EFightCameraSidestep__NewEnumerator10                                            = 10,
	EFightCameraSidestep__NewEnumerator11                                            = 11,
	EFightCameraSidestep__NewEnumerator12                                            = 12,
	EFightCameraSidestep__NewEnumerator13                                            = 13
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Enum/ESceneInteractionEffect.ESceneInteractionEffect
/// Size: 0x01 (1 bytes)
enum class ESceneInteractionEffect : uint8_t
{
	ESceneInteractionEffect__NewEnumerator0                                          = 0,
	ESceneInteractionEffect__NewEnumerator1                                          = 1,
	ESceneInteractionEffect__NewEnumerator2                                          = 2,
	ESceneInteractionEffect__NewEnumerator3                                          = 3,
	ESceneInteractionEffect__NewEnumerator4                                          = 4,
	ESceneInteractionEffect__NewEnumerator5                                          = 5,
	ESceneInteractionEffect__NewEnumerator6                                          = 6,
	ESceneInteractionEffect__NewEnumerator7                                          = 7,
	ESceneInteractionEffect__NewEnumerator8                                          = 8,
	ESceneInteractionEffect__NewEnumerator9                                          = 9,
	ESceneInteractionEffect__NewEnumerator10                                         = 10
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Enum/EAnimNotifyEffectLocationType.EAnimNotifyEffectLocationType
/// Size: 0x01 (1 bytes)
enum class EAnimNotifyEffectLocationType : uint8_t
{
	EAnimNotifyEffectLocationType__NewEnumerator0                                    = 0,
	EAnimNotifyEffectLocationType__NewEnumerator1                                    = 1,
	EAnimNotifyEffectLocationType__NewEnumerator2                                    = 2
};

/// Enum /Game/Aki/Character/Role/Common/Data/Structure/EFootstepAkAudioEventType.EFootstepAkAudioEventType
/// Size: 0x01 (1 bytes)
enum class EFootstepAkAudioEventType : uint8_t
{
	EFootstepAkAudioEventType__NewEnumerator0                                        = 0,
	EFootstepAkAudioEventType__NewEnumerator1                                        = 1,
	EFootstepAkAudioEventType__NewEnumerator2                                        = 2,
	EFootstepAkAudioEventType__NewEnumerator3                                        = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/ESequenceCameraAnsEffectiveClientType.ESequenceCameraAnsEffectiveClientType
/// Size: 0x01 (1 bytes)
enum class ESequenceCameraAnsEffectiveClientType : uint8_t
{
	ESequenceCameraAnsEffectiveClientType__NewEnumerator0                            = 0,
	ESequenceCameraAnsEffectiveClientType__NewEnumerator1                            = 1,
	ESequenceCameraAnsEffectiveClientType__NewEnumerator2                            = 2,
	ESequenceCameraAnsEffectiveClientType__NewEnumerator3                            = 3,
	ESequenceCameraAnsEffectiveClientType__NewEnumerator4                            = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/ECameraAnsEffectiveClientType.ECameraAnsEffectiveClientType
/// Size: 0x01 (1 bytes)
enum class ECameraAnsEffectiveClientType : uint8_t
{
	ECameraAnsEffectiveClientType__NewEnumerator0                                    = 0,
	ECameraAnsEffectiveClientType__NewEnumerator1                                    = 1,
	ECameraAnsEffectiveClientType__NewEnumerator2                                    = 2,
	ECameraAnsEffectiveClientType__NewEnumerator3                                    = 3,
	ECameraAnsEffectiveClientType__NewEnumerator4                                    = 4,
	ECameraAnsEffectiveClientType__NewEnumerator5                                    = 5,
	ECameraAnsEffectiveClientType__NewEnumerator6                                    = 6
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EAimAssistMode.EAimAssistMode
/// Size: 0x01 (1 bytes)
enum class EAimAssistMode : uint8_t
{
	EAimAssistMode__NewEnumerator0                                                   = 0,
	EAimAssistMode__NewEnumerator1                                                   = 1,
	EAimAssistMode__NewEnumerator2                                                   = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillLoadType.ESkillLoadType
/// Size: 0x01 (1 bytes)
enum class ESkillLoadType : uint8_t
{
	ESkillLoadType__NewEnumerator0                                                   = 0,
	ESkillLoadType__NewEnumerator1                                                   = 1,
	ESkillLoadType__NewEnumerator2                                                   = 2,
	ESkillLoadType__NewEnumerator3                                                   = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorRestrictType.ESkillBehaviorRestrictType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorRestrictType : uint8_t
{
	ESkillBehaviorRestrictType__NewEnumerator12                                      = 0,
	ESkillBehaviorRestrictType__NewEnumerator13                                      = 1,
	ESkillBehaviorRestrictType__NewEnumerator14                                      = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorRotationType.ESkillBehaviorRotationType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorRotationType : uint8_t
{
	ESkillBehaviorRotationType__NewEnumerator12                                      = 0,
	ESkillBehaviorRotationType__NewEnumerator13                                      = 1,
	ESkillBehaviorRotationType__NewEnumerator14                                      = 2,
	ESkillBehaviorRotationType__NewEnumerator15                                      = 3,
	ESkillBehaviorRotationType__NewEnumerator16                                      = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorLocationForwardType.ESkillBehaviorLocationForwardType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorLocationForwardType : uint8_t
{
	ESkillBehaviorLocationForwardType__NewEnumerator12                               = 0,
	ESkillBehaviorLocationForwardType__NewEnumerator13                               = 1,
	ESkillBehaviorLocationForwardType__NewEnumerator14                               = 2,
	ESkillBehaviorLocationForwardType__NewEnumerator15                               = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorLocationType.ESkillBehaviorLocationType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorLocationType : uint8_t
{
	ESkillBehaviorLocationType__NewEnumerator0                                       = 0,
	ESkillBehaviorLocationType__NewEnumerator7                                       = 1,
	ESkillBehaviorLocationType__NewEnumerator8                                       = 2,
	ESkillBehaviorLocationType__NewEnumerator9                                       = 3,
	ESkillBehaviorLocationType__NewEnumerator10                                      = 4,
	ESkillBehaviorLocationType__NewEnumerator11                                      = 5,
	ESkillBehaviorLocationType__NewEnumerator13                                      = 6,
	ESkillBehaviorLocationType__NewEnumerator14                                      = 7
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorActionType.ESkillBehaviorActionType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorActionType : uint8_t
{
	ESkillBehaviorActionType__NewEnumerator0                                         = 0,
	ESkillBehaviorActionType__NewEnumerator1                                         = 1,
	ESkillBehaviorActionType__NewEnumerator2                                         = 2,
	ESkillBehaviorActionType__NewEnumerator3                                         = 3,
	ESkillBehaviorActionType__NewEnumerator4                                         = 4,
	ESkillBehaviorActionType__NewEnumerator5                                         = 5,
	ESkillBehaviorActionType__NewEnumerator6                                         = 6,
	ESkillBehaviorActionType__NewEnumerator7                                         = 7,
	ESkillBehaviorActionType__NewEnumerator8                                         = 8,
	ESkillBehaviorActionType__NewEnumerator9                                         = 9,
	ESkillBehaviorActionType__NewEnumerator10                                        = 10,
	ESkillBehaviorActionType__NewEnumerator11                                        = 11
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorComparisonLogic.ESkillBehaviorComparisonLogic
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorComparisonLogic : uint8_t
{
	ESkillBehaviorComparisonLogic__NewEnumerator0                                    = 0,
	ESkillBehaviorComparisonLogic__NewEnumerator1                                    = 1,
	ESkillBehaviorComparisonLogic__NewEnumerator2                                    = 2,
	ESkillBehaviorComparisonLogic__NewEnumerator5                                    = 3,
	ESkillBehaviorComparisonLogic__NewEnumerator6                                    = 4,
	ESkillBehaviorComparisonLogic__NewEnumerator7                                    = 5
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorConditionType.ESkillBehaviorConditionType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorConditionType : uint8_t
{
	ESkillBehaviorConditionType__NewEnumerator0                                      = 0,
	ESkillBehaviorConditionType__NewEnumerator1                                      = 1,
	ESkillBehaviorConditionType__NewEnumerator2                                      = 2,
	ESkillBehaviorConditionType__NewEnumerator5                                      = 3,
	ESkillBehaviorConditionType__NewEnumerator6                                      = 4,
	ESkillBehaviorConditionType__NewEnumerator7                                      = 5
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillMode.ESkillMode
/// Size: 0x01 (1 bytes)
enum class ESkillMode : uint8_t
{
	ESkillMode__NewEnumerator0                                                       = 0,
	ESkillMode__NewEnumerator1                                                       = 1
};

/// Enum /Game/Aki/Data/Effect/Struct/EEffectType.EEffectType
/// Size: 0x01 (1 bytes)
enum class EEffectType : uint8_t
{
	EEffectType__NewEnumerator0                                                      = 0,
	EEffectType__NewEnumerator1                                                      = 1,
	EEffectType__NewEnumerator2                                                      = 2,
	EEffectType__NewEnumerator3                                                      = 3
};

/// Enum /Game/Aki/Data/Effect/Struct/EEffectPlay.EEffectPlay
/// Size: 0x01 (1 bytes)
enum class EEffectPlay : uint8_t
{
	EEffectPlay__NewEnumerator0                                                      = 0,
	EEffectPlay__NewEnumerator1                                                      = 1,
	EEffectPlay__NewEnumerator2                                                      = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/EPawnChannel.EPawnChannel
/// Size: 0x01 (1 bytes)
enum class EPawnChannel : uint8_t
{
	EPawnChannel__NewEnumerator0                                                     = 0,
	EPawnChannel__NewEnumerator1                                                     = 1,
	EPawnChannel__NewEnumerator2                                                     = 2,
	EPawnChannel__NewEnumerator3                                                     = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillTargetDirection.ESkillTargetDirection
/// Size: 0x01 (1 bytes)
enum class ESkillTargetDirection : uint8_t
{
	ESkillTargetDirection__NewEnumerator0                                            = 0,
	ESkillTargetDirection__NewEnumerator5                                            = 1,
	ESkillTargetDirection__NewEnumerator4                                            = 2,
	ESkillTargetDirection__NewEnumerator3                                            = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillTargetPriority.ESkillTargetPriority
/// Size: 0x01 (1 bytes)
enum class ESkillTargetPriority : uint8_t
{
	ESkillTargetPriority__NewEnumerator0                                             = 0,
	ESkillTargetPriority__NewEnumerator4                                             = 1,
	ESkillTargetPriority__NewEnumerator3                                             = 2,
	ESkillTargetPriority__NewEnumerator7                                             = 3
};

/// Enum /Game/Aki/Data/UiNavigation/Enum/ECursorOffsetType.ECursorOffsetType
/// Size: 0x01 (1 bytes)
enum class ECursorOffsetType : uint8_t
{
	ECursorOffsetType__NewEnumerator0                                                = 0,
	ECursorOffsetType__NewEnumerator1                                                = 1,
	ECursorOffsetType__NewEnumerator2                                                = 2,
	ECursorOffsetType__NewEnumerator3                                                = 3
};

/// Enum /Game/Aki/Data/UiNavigation/Enum/EHotKeyNameStateType.EHotKeyNameStateType
/// Size: 0x01 (1 bytes)
enum class EHotKeyNameStateType : uint8_t
{
	EHotKeyNameStateType__NewEnumerator2                                             = 0,
	EHotKeyNameStateType__NewEnumerator0                                             = 1,
	EHotKeyNameStateType__NewEnumerator1                                             = 2
};

/// Enum /Game/Aki/Scene/NewGacha/BP/E_GachaResultNew.E_GachaResultNew
/// Size: 0x01 (1 bytes)
enum class E_GachaResultNew : uint8_t
{
	E_GachaResultNew__NewEnumerator0                                                 = 0,
	E_GachaResultNew__NewEnumerator1                                                 = 1,
	E_GachaResultNew__NewEnumerator2                                                 = 2,
	E_GachaResultNew__NewEnumerator3                                                 = 3,
	E_GachaResultNew__NewEnumerator4                                                 = 4
};

/// Enum /Game/Aki/Data/Role/Enum/ERoleInteractType.ERoleInteractType
/// Size: 0x01 (1 bytes)
enum class ERoleInteractType : uint8_t
{
	ERoleInteractType__NewEnumerator0                                                = 0,
	ERoleInteractType__NewEnumerator1                                                = 1,
	ERoleInteractType__NewEnumerator2                                                = 2,
	ERoleInteractType__NewEnumerator3                                                = 3
};

/// Enum /Game/Aki/Sequence/Manager/EPlotSequenceType.EPlotSequenceType
/// Size: 0x01 (1 bytes)
enum class EPlotSequenceType : uint8_t
{
	EPlotSequenceType__NewEnumerator0                                                = 0,
	EPlotSequenceType__NewEnumerator1                                                = 1,
	EPlotSequenceType__NewEnumerator2                                                = 2
};

/// Enum /Game/Aki/Character/Role/Common/Data/Enum/EWeaponViewName.EWeaponViewName
/// Size: 0x01 (1 bytes)
enum class EWeaponViewName : uint8_t
{
	EWeaponViewName__NewEnumerator0                                                  = 0,
	EWeaponViewName__NewEnumerator19                                                 = 1,
	EWeaponViewName__NewEnumerator20                                                 = 2,
	EWeaponViewName__NewEnumerator21                                                 = 3,
	EWeaponViewName__NewEnumerator22                                                 = 4
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialController/ECharacterMeshPart.ECharacterMeshPart
/// Size: 0x01 (1 bytes)
enum class ECharacterMeshPart : uint8_t
{
	ECharacterMeshPart__NewEnumerator0                                               = 0,
	ECharacterMeshPart__NewEnumerator1                                               = 1,
	ECharacterMeshPart__NewEnumerator2                                               = 2,
	ECharacterMeshPart__NewEnumerator3                                               = 3,
	ECharacterMeshPart__NewEnumerator4                                               = 4,
	ECharacterMeshPart__NewEnumerator5                                               = 5,
	ECharacterMeshPart__NewEnumerator6                                               = 6,
	ECharacterMeshPart__NewEnumerator7                                               = 7,
	ECharacterMeshPart__NewEnumerator12                                              = 8,
	ECharacterMeshPart__NewEnumerator13                                              = 9,
	ECharacterMeshPart__NewEnumerator8                                               = 10,
	ECharacterMeshPart__NewEnumerator9                                               = 11,
	ECharacterMeshPart__NewEnumerator17                                              = 12,
	ECharacterMeshPart__NewEnumerator10                                              = 13,
	ECharacterMeshPart__NewEnumerator11                                              = 14,
	ECharacterMeshPart__NewEnumerator18                                              = 15,
	ECharacterMeshPart__NewEnumerator19                                              = 16,
	ECharacterMeshPart__NewEnumerator16                                              = 17
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialController/ECharacterControllerCaseType.ECharacterControllerCaseType
/// Size: 0x01 (1 bytes)
enum class ECharacterControllerCaseType : uint8_t
{
	ECharacterControllerCaseType__NewEnumerator0                                     = 0,
	ECharacterControllerCaseType__NewEnumerator1                                     = 1,
	ECharacterControllerCaseType__NewEnumerator2                                     = 2,
	ECharacterControllerCaseType__NewEnumerator3                                     = 3,
	ECharacterControllerCaseType__NewEnumerator4                                     = 4,
	ECharacterControllerCaseType__NewEnumerator5                                     = 5,
	ECharacterControllerCaseType__NewEnumerator6                                     = 6,
	ECharacterControllerCaseType__NewEnumerator7                                     = 7,
	ECharacterControllerCaseType__NewEnumerator8                                     = 8,
	ECharacterControllerCaseType__NewEnumerator9                                     = 9,
	ECharacterControllerCaseType__NewEnumerator10                                    = 10,
	ECharacterControllerCaseType__NewEnumerator11                                    = 11
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Scene/ESceneEffectStateType.ESceneEffectStateType
/// Size: 0x01 (1 bytes)
enum class ESceneEffectStateType : uint8_t
{
	ESceneEffectStateType__NewEnumerator0                                            = 0,
	ESceneEffectStateType__NewEnumerator1                                            = 1
};

/// Enum /Game/Aki/Character/NPC/Animal/EAnimalEcologicalState.EAnimalEcologicalState
/// Size: 0x01 (1 bytes)
enum class EAnimalEcologicalState : uint8_t
{
	EAnimalEcologicalState__NewEnumerator11                                          = 0,
	EAnimalEcologicalState__NewEnumerator0                                           = 1,
	EAnimalEcologicalState__NewEnumerator1                                           = 2,
	EAnimalEcologicalState__NewEnumerator4                                           = 3,
	EAnimalEcologicalState__NewEnumerator3                                           = 4,
	EAnimalEcologicalState__NewEnumerator6                                           = 5,
	EAnimalEcologicalState__NewEnumerator12                                          = 6
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/MultiEffect/EMultiEffectType.EMultiEffectType
/// Size: 0x01 (1 bytes)
enum class EMultiEffectType : uint8_t
{
	EMultiEffectType__NewEnumerator0                                                 = 0
};

/// Enum /Game/Aki/Core/Fight/EBulletSpecificEffect.EBulletSpecificEffect
/// Size: 0x01 (1 bytes)
enum class EBulletSpecificEffect : uint8_t
{
	EBulletSpecificEffect__NewEnumerator2                                            = 0,
	EBulletSpecificEffect__NewEnumerator0                                            = 1,
	EBulletSpecificEffect__NewEnumerator1                                            = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ECharacterState.ECharacterState
/// Size: 0x01 (1 bytes)
enum class ECharacterState : uint8_t
{
	ECharacterState__NewEnumerator0                                                  = 0,
	ECharacterState__NewEnumerator1                                                  = 1,
	ECharacterState__NewEnumerator2                                                  = 2,
	ECharacterState__NewEnumerator3                                                  = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/ECaughtDirectionType.ECaughtDirectionType
/// Size: 0x01 (1 bytes)
enum class ECaughtDirectionType : uint8_t
{
	ECaughtDirectionType__NewEnumerator0                                             = 0,
	ECaughtDirectionType__NewEnumerator1                                             = 1,
	ECaughtDirectionType__NewEnumerator2                                             = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/EAnsRotateBlackboardType.EAnsRotateBlackboardType
/// Size: 0x01 (1 bytes)
enum class EAnsRotateBlackboardType : uint8_t
{
	EAnsRotateBlackboardType__NewEnumerator0                                         = 0,
	EAnsRotateBlackboardType__NewEnumerator1                                         = 1,
	EAnsRotateBlackboardType__NewEnumerator2                                         = 2,
	EAnsRotateBlackboardType__NewEnumerator3                                         = 3
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/Npc/ENpcSetupType.ENpcSetupType
/// Size: 0x01 (1 bytes)
enum class ENpcSetupType : uint8_t
{
	ENpcSetupType__NewEnumerator0                                                    = 0,
	ENpcSetupType__NewEnumerator1                                                    = 1
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraSpecialGameplay.EFightCameraSpecialGameplay
/// Size: 0x01 (1 bytes)
enum class EFightCameraSpecialGameplay : uint8_t
{
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraModify.EFightCameraModify
/// Size: 0x01 (1 bytes)
enum class EFightCameraModify : uint8_t
{
	EFightCameraModify__NewEnumerator4                                               = 0,
	EFightCameraModify__NewEnumerator0                                               = 1,
	EFightCameraModify__NewEnumerator1                                               = 2,
	EFightCameraModify__NewEnumerator2                                               = 3,
	EFightCameraModify__NewEnumerator3                                               = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraInput.EFightCameraInput
/// Size: 0x01 (1 bytes)
enum class EFightCameraInput : uint8_t
{
	EFightCameraInput__NewEnumerator6                                                = 0,
	EFightCameraInput__NewEnumerator0                                                = 1,
	EFightCameraInput__NewEnumerator1                                                = 2,
	EFightCameraInput__NewEnumerator2                                                = 3,
	EFightCameraInput__NewEnumerator3                                                = 4,
	EFightCameraInput__NewEnumerator4                                                = 5,
	EFightCameraInput__NewEnumerator5                                                = 6,
	EFightCameraInput__NewEnumerator7                                                = 7,
	EFightCameraInput__NewEnumerator8                                                = 8,
	EFightCameraInput__NewEnumerator9                                                = 9,
	EFightCameraInput__NewEnumerator10                                               = 10,
	EFightCameraInput__NewEnumerator11                                               = 11,
	EFightCameraInput__NewEnumerator12                                               = 12,
	EFightCameraInput__NewEnumerator13                                               = 13,
	EFightCameraInput__NewEnumerator15                                               = 14,
	EFightCameraInput__NewEnumerator16                                               = 15,
	EFightCameraInput__NewEnumerator17                                               = 16,
	EFightCameraInput__NewEnumerator14                                               = 17,
	EFightCameraInput__NewEnumerator18                                               = 18,
	EFightCameraInput__NewEnumerator19                                               = 19,
	EFightCameraInput__NewEnumerator20                                               = 20
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraGuide.EFightCameraGuide
/// Size: 0x01 (1 bytes)
enum class EFightCameraGuide : uint8_t
{
	EFightCameraGuide__NewEnumerator17                                               = 0,
	EFightCameraGuide__NewEnumerator0                                                = 1,
	EFightCameraGuide__NewEnumerator1                                                = 2,
	EFightCameraGuide__NewEnumerator2                                                = 3,
	EFightCameraGuide__NewEnumerator3                                                = 4,
	EFightCameraGuide__NewEnumerator4                                                = 5,
	EFightCameraGuide__NewEnumerator5                                                = 6,
	EFightCameraGuide__NewEnumerator6                                                = 7,
	EFightCameraGuide__NewEnumerator7                                                = 8,
	EFightCameraGuide__NewEnumerator8                                                = 9,
	EFightCameraGuide__NewEnumerator9                                                = 10,
	EFightCameraGuide__NewEnumerator10                                               = 11,
	EFightCameraGuide__NewEnumerator11                                               = 12,
	EFightCameraGuide__NewEnumerator12                                               = 13,
	EFightCameraGuide__NewEnumerator13                                               = 14,
	EFightCameraGuide__NewEnumerator14                                               = 15,
	EFightCameraGuide__NewEnumerator15                                               = 16,
	EFightCameraGuide__NewEnumerator16                                               = 17
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraFocus.EFightCameraFocus
/// Size: 0x01 (1 bytes)
enum class EFightCameraFocus : uint8_t
{
	EFightCameraFocus__NewEnumerator1                                                = 0,
	EFightCameraFocus__NewEnumerator0                                                = 1,
	EFightCameraFocus__NewEnumerator3                                                = 2,
	EFightCameraFocus__NewEnumerator4                                                = 3,
	EFightCameraFocus__NewEnumerator5                                                = 4,
	EFightCameraFocus__NewEnumerator6                                                = 5,
	EFightCameraFocus__NewEnumerator7                                                = 6,
	EFightCameraFocus__NewEnumerator8                                                = 7,
	EFightCameraFocus__NewEnumerator9                                                = 8,
	EFightCameraFocus__NewEnumerator10                                               = 9,
	EFightCameraFocus__NewEnumerator11                                               = 10,
	EFightCameraFocus__NewEnumerator13                                               = 11,
	EFightCameraFocus__NewEnumerator30                                               = 12,
	EFightCameraFocus__NewEnumerator14                                               = 13,
	EFightCameraFocus__NewEnumerator31                                               = 14,
	EFightCameraFocus__NewEnumerator15                                               = 15,
	EFightCameraFocus__NewEnumerator16                                               = 16,
	EFightCameraFocus__NewEnumerator17                                               = 17,
	EFightCameraFocus__NewEnumerator18                                               = 18,
	EFightCameraFocus__NewEnumerator19                                               = 19,
	EFightCameraFocus__NewEnumerator20                                               = 20,
	EFightCameraFocus__NewEnumerator21                                               = 21,
	EFightCameraFocus__NewEnumerator22                                               = 22,
	EFightCameraFocus__NewEnumerator23                                               = 23,
	EFightCameraFocus__NewEnumerator28                                               = 24,
	EFightCameraFocus__NewEnumerator32                                               = 25,
	EFightCameraFocus__NewEnumerator29                                               = 26,
	EFightCameraFocus__NewEnumerator33                                               = 27,
	EFightCameraFocus__NewEnumerator34                                               = 28,
	EFightCameraFocus__NewEnumerator35                                               = 29,
	EFightCameraFocus__NewEnumerator36                                               = 30,
	EFightCameraFocus__NewEnumerator37                                               = 31
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraExplore.EFightCameraExplore
/// Size: 0x01 (1 bytes)
enum class EFightCameraExplore : uint8_t
{
	EFightCameraExplore__NewEnumerator8                                              = 0,
	EFightCameraExplore__NewEnumerator0                                              = 1,
	EFightCameraExplore__NewEnumerator1                                              = 2,
	EFightCameraExplore__NewEnumerator2                                              = 3,
	EFightCameraExplore__NewEnumerator3                                              = 4,
	EFightCameraExplore__NewEnumerator4                                              = 5,
	EFightCameraExplore__NewEnumerator5                                              = 6,
	EFightCameraExplore__NewEnumerator6                                              = 7,
	EFightCameraExplore__NewEnumerator7                                              = 8
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraDialogue.EFightCameraDialogue
/// Size: 0x01 (1 bytes)
enum class EFightCameraDialogue : uint8_t
{
	EFightCameraDialogue__NewEnumerator11                                            = 0,
	EFightCameraDialogue__NewEnumerator0                                             = 1,
	EFightCameraDialogue__NewEnumerator1                                             = 2,
	EFightCameraDialogue__NewEnumerator2                                             = 3,
	EFightCameraDialogue__NewEnumerator3                                             = 4,
	EFightCameraDialogue__NewEnumerator4                                             = 5,
	EFightCameraDialogue__NewEnumerator5                                             = 6,
	EFightCameraDialogue__NewEnumerator6                                             = 7,
	EFightCameraDialogue__NewEnumerator7                                             = 8,
	EFightCameraDialogue__NewEnumerator8                                             = 9,
	EFightCameraDialogue__NewEnumerator9                                             = 10,
	EFightCameraDialogue__NewEnumerator10                                            = 11,
	EFightCameraDialogue__NewEnumerator12                                            = 12
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraDefault.EFightCameraDefault
/// Size: 0x01 (1 bytes)
enum class EFightCameraDefault : uint8_t
{
	EFightCameraDefault__NewEnumerator21                                             = 0,
	EFightCameraDefault__NewEnumerator23                                             = 1,
	EFightCameraDefault__NewEnumerator24                                             = 2,
	EFightCameraDefault__NewEnumerator25                                             = 3,
	EFightCameraDefault__NewEnumerator26                                             = 4,
	EFightCameraDefault__NewEnumerator27                                             = 5,
	EFightCameraDefault__NewEnumerator28                                             = 6,
	EFightCameraDefault__NewEnumerator29                                             = 7,
	EFightCameraDefault__NewEnumerator30                                             = 8,
	EFightCameraDefault__NewEnumerator0                                              = 9,
	EFightCameraDefault__NewEnumerator1                                              = 10,
	EFightCameraDefault__NewEnumerator2                                              = 11,
	EFightCameraDefault__NewEnumerator3                                              = 12,
	EFightCameraDefault__NewEnumerator4                                              = 13,
	EFightCameraDefault__NewEnumerator5                                              = 14,
	EFightCameraDefault__NewEnumerator6                                              = 15,
	EFightCameraDefault__NewEnumerator7                                              = 16,
	EFightCameraDefault__NewEnumerator8                                              = 17,
	EFightCameraDefault__NewEnumerator9                                              = 18,
	EFightCameraDefault__NewEnumerator10                                             = 19,
	EFightCameraDefault__NewEnumerator11                                             = 20,
	EFightCameraDefault__NewEnumerator12                                             = 21,
	EFightCameraDefault__NewEnumerator13                                             = 22,
	EFightCameraDefault__NewEnumerator14                                             = 23,
	EFightCameraDefault__NewEnumerator15                                             = 24,
	EFightCameraDefault__NewEnumerator16                                             = 25,
	EFightCameraDefault__NewEnumerator17                                             = 26,
	EFightCameraDefault__NewEnumerator18                                             = 27,
	EFightCameraDefault__NewEnumerator19                                             = 28,
	EFightCameraDefault__NewEnumerator20                                             = 29,
	EFightCameraDefault__NewEnumerator31                                             = 30,
	EFightCameraDefault__NewEnumerator32                                             = 31,
	EFightCameraDefault__NewEnumerator33                                             = 32,
	EFightCameraDefault__NewEnumerator34                                             = 33,
	EFightCameraDefault__NewEnumerator35                                             = 34,
	EFightCameraDefault__NewEnumerator36                                             = 35,
	EFightCameraDefault__NewEnumerator37                                             = 36,
	EFightCameraDefault__NewEnumerator38                                             = 37,
	EFightCameraDefault__NewEnumerator39                                             = 38,
	EFightCameraDefault__NewEnumerator40                                             = 39,
	EFightCameraDefault__NewEnumerator41                                             = 40,
	EFightCameraDefault__NewEnumerator42                                             = 41,
	EFightCameraDefault__NewEnumerator43                                             = 42,
	EFightCameraDefault__NewEnumerator44                                             = 43,
	EFightCameraDefault__NewEnumerator45                                             = 44,
	EFightCameraDefault__NewEnumerator46                                             = 45,
	EFightCameraDefault__NewEnumerator47                                             = 46,
	EFightCameraDefault__NewEnumerator48                                             = 47,
	EFightCameraDefault__NewEnumerator49                                             = 48,
	EFightCameraDefault__NewEnumerator50                                             = 49,
	EFightCameraDefault__NewEnumerator51                                             = 50,
	EFightCameraDefault__NewEnumerator52                                             = 51,
	EFightCameraDefault__NewEnumerator53                                             = 52,
	EFightCameraDefault__NewEnumerator54                                             = 53,
	EFightCameraDefault__NewEnumerator55                                             = 54,
	EFightCameraDefault__NewEnumerator57                                             = 55,
	EFightCameraDefault__NewEnumerator58                                             = 56,
	EFightCameraDefault__NewEnumerator59                                             = 57,
	EFightCameraDefault__NewEnumerator60                                             = 58,
	EFightCameraDefault__NewEnumerator61                                             = 59,
	EFightCameraDefault__NewEnumerator62                                             = 60,
	EFightCameraDefault__NewEnumerator63                                             = 61,
	EFightCameraDefault__NewEnumerator64                                             = 62,
	EFightCameraDefault__NewEnumerator65                                             = 63,
	EFightCameraDefault__NewEnumerator66                                             = 64
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraClimb.EFightCameraClimb
/// Size: 0x01 (1 bytes)
enum class EFightCameraClimb : uint8_t
{
	EFightCameraClimb__NewEnumerator17                                               = 0,
	EFightCameraClimb__NewEnumerator0                                                = 1,
	EFightCameraClimb__NewEnumerator1                                                = 2,
	EFightCameraClimb__NewEnumerator2                                                = 3,
	EFightCameraClimb__NewEnumerator3                                                = 4,
	EFightCameraClimb__NewEnumerator4                                                = 5,
	EFightCameraClimb__NewEnumerator5                                                = 6,
	EFightCameraClimb__NewEnumerator6                                                = 7,
	EFightCameraClimb__NewEnumerator7                                                = 8,
	EFightCameraClimb__NewEnumerator8                                                = 9,
	EFightCameraClimb__NewEnumerator9                                                = 10,
	EFightCameraClimb__NewEnumerator10                                               = 11,
	EFightCameraClimb__NewEnumerator11                                               = 12,
	EFightCameraClimb__NewEnumerator12                                               = 13,
	EFightCameraClimb__NewEnumerator13                                               = 14,
	EFightCameraClimb__NewEnumerator14                                               = 15,
	EFightCameraClimb__NewEnumerator15                                               = 16,
	EFightCameraClimb__NewEnumerator16                                               = 17,
	EFightCameraClimb__NewEnumerator18                                               = 18,
	EFightCameraClimb__NewEnumerator19                                               = 19,
	EFightCameraClimb__NewEnumerator20                                               = 20
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraAdjust.EFightCameraAdjust
/// Size: 0x01 (1 bytes)
enum class EFightCameraAdjust : uint8_t
{
	EFightCameraAdjust__NewEnumerator14                                              = 0,
	EFightCameraAdjust__NewEnumerator0                                               = 1,
	EFightCameraAdjust__NewEnumerator1                                               = 2,
	EFightCameraAdjust__NewEnumerator2                                               = 3,
	EFightCameraAdjust__NewEnumerator3                                               = 4,
	EFightCameraAdjust__NewEnumerator4                                               = 5,
	EFightCameraAdjust__NewEnumerator5                                               = 6,
	EFightCameraAdjust__NewEnumerator6                                               = 7,
	EFightCameraAdjust__NewEnumerator7                                               = 8,
	EFightCameraAdjust__NewEnumerator8                                               = 9,
	EFightCameraAdjust__NewEnumerator9                                               = 10,
	EFightCameraAdjust__NewEnumerator10                                              = 11,
	EFightCameraAdjust__NewEnumerator11                                              = 12,
	EFightCameraAdjust__NewEnumerator12                                              = 13,
	EFightCameraAdjust__NewEnumerator13                                              = 14
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraAuto.EFightCameraAuto
/// Size: 0x01 (1 bytes)
enum class EFightCameraAuto : uint8_t
{
	EFightCameraAuto__NewEnumerator16                                                = 0,
	EFightCameraAuto__NewEnumerator0                                                 = 1,
	EFightCameraAuto__NewEnumerator1                                                 = 2,
	EFightCameraAuto__NewEnumerator2                                                 = 3,
	EFightCameraAuto__NewEnumerator3                                                 = 4,
	EFightCameraAuto__NewEnumerator4                                                 = 5,
	EFightCameraAuto__NewEnumerator5                                                 = 6,
	EFightCameraAuto__NewEnumerator6                                                 = 7,
	EFightCameraAuto__NewEnumerator7                                                 = 8,
	EFightCameraAuto__NewEnumerator8                                                 = 9,
	EFightCameraAuto__NewEnumerator9                                                 = 10,
	EFightCameraAuto__NewEnumerator10                                                = 11,
	EFightCameraAuto__NewEnumerator11                                                = 12,
	EFightCameraAuto__NewEnumerator12                                                = 13,
	EFightCameraAuto__NewEnumerator13                                                = 14,
	EFightCameraAuto__NewEnumerator14                                                = 15,
	EFightCameraAuto__NewEnumerator15                                                = 16,
	EFightCameraAuto__NewEnumerator23                                                = 17,
	EFightCameraAuto__NewEnumerator24                                                = 18,
	EFightCameraAuto__NewEnumerator25                                                = 19,
	EFightCameraAuto__NewEnumerator26                                                = 20,
	EFightCameraAuto__NewEnumerator27                                                = 21,
	EFightCameraAuto__NewEnumerator30                                                = 22,
	EFightCameraAuto__NewEnumerator31                                                = 23
};

/// Enum /Game/Aki/Data/Entity/Enum/EEntityType.EEntityType
/// Size: 0x01 (1 bytes)
enum class EEntityType : uint8_t
{
	EEntityType__NewEnumerator0                                                      = 0,
	EEntityType__NewEnumerator6                                                      = 1,
	EEntityType__NewEnumerator1                                                      = 2,
	EEntityType__NewEnumerator2                                                      = 3,
	EEntityType__NewEnumerator3                                                      = 4,
	EEntityType__NewEnumerator4                                                      = 5,
	EEntityType__NewEnumerator5                                                      = 6,
	EEntityType__NewEnumerator7                                                      = 7
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialContainer/ECharacterBodyType.ECharacterBodyType
/// Size: 0x01 (1 bytes)
enum class ECharacterBodyType : uint8_t
{
	ECharacterBodyType__NewEnumerator0                                               = 0,
	ECharacterBodyType__NewEnumerator1                                               = 1,
	ECharacterBodyType__NewEnumerator2                                               = 2,
	ECharacterBodyType__NewEnumerator3                                               = 3
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Trailing/ETrailingAttachType.ETrailingAttachType
/// Size: 0x01 (1 bytes)
enum class ETrailingAttachType : uint8_t
{
	ETrailingAttachType__NewEnumerator0                                              = 0,
	ETrailingAttachType__NewEnumerator1                                              = 1,
	ETrailingAttachType__NewEnumerator2                                              = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillEffectType.ESkillEffectType
/// Size: 0x01 (1 bytes)
enum class ESkillEffectType : uint8_t
{
	ESkillEffectType__NewEnumerator0                                                 = 0,
	ESkillEffectType__NewEnumerator1                                                 = 1,
	ESkillEffectType__NewEnumerator2                                                 = 2
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Scalability/ENiagaraScalabilityType.ENiagaraScalabilityType
/// Size: 0x01 (1 bytes)
enum class ENiagaraScalabilityType : uint8_t
{
	ENiagaraScalabilityType__NewEnumerator6                                          = 0,
	ENiagaraScalabilityType__NewEnumerator0                                          = 1,
	ENiagaraScalabilityType__NewEnumerator1                                          = 2,
	ENiagaraScalabilityType__NewEnumerator2                                          = 3,
	ENiagaraScalabilityType__NewEnumerator3                                          = 4
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Scalability/EEffectScalabilityType.EEffectScalabilityType
/// Size: 0x01 (1 bytes)
enum class EEffectScalabilityType : uint8_t
{
	EEffectScalabilityType__NewEnumerator0                                           = 0,
	EEffectScalabilityType__NewEnumerator4                                           = 1,
	EEffectScalabilityType__NewEnumerator5                                           = 2
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Statistics/EEffectStatisticsSortType.EEffectStatisticsSortType
/// Size: 0x01 (1 bytes)
enum class EEffectStatisticsSortType : uint8_t
{
	EEffectStatisticsSortType__NewEnumerator0                                        = 0,
	EEffectStatisticsSortType__NewEnumerator1                                        = 1,
	EEffectStatisticsSortType__NewEnumerator2                                        = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorBuffTargetType.ESkillBehaviorBuffTargetType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorBuffTargetType : uint8_t
{
	ESkillBehaviorBuffTargetType__NewEnumerator0                                     = 0,
	ESkillBehaviorBuffTargetType__NewEnumerator1                                     = 1
};

/// Enum /Game/Aki/Data/UiCameraAnimation/Enum/EUiCameraAnimationAttributeType.EUiCameraAnimationAttributeType
/// Size: 0x01 (1 bytes)
enum class EUiCameraAnimationAttributeType : uint8_t
{
	EUiCameraAnimationAttributeType__NewEnumerator0                                  = 0,
	EUiCameraAnimationAttributeType__NewEnumerator1                                  = 1,
	EUiCameraAnimationAttributeType__NewEnumerator2                                  = 2,
	EUiCameraAnimationAttributeType__NewEnumerator3                                  = 3,
	EUiCameraAnimationAttributeType__NewEnumerator4                                  = 4,
	EUiCameraAnimationAttributeType__NewEnumerator5                                  = 5,
	EUiCameraAnimationAttributeType__NewEnumerator6                                  = 6,
	EUiCameraAnimationAttributeType__NewEnumerator7                                  = 7,
	EUiCameraAnimationAttributeType__NewEnumerator8                                  = 8,
	EUiCameraAnimationAttributeType__NewEnumerator9                                  = 9
};

/// Enum /Game/Aki/Character/BaseCharacter/EVelocityCurveType.EVelocityCurveType
/// Size: 0x01 (1 bytes)
enum class EVelocityCurveType : uint8_t
{
	EVelocityCurveType__NewEnumerator0                                               = 0,
	EVelocityCurveType__NewEnumerator1                                               = 1,
	EVelocityCurveType__NewEnumerator2                                               = 2,
	EVelocityCurveType__NewEnumerator3                                               = 3
};

/// Enum /Game/Aki/Character/Vision/EVisionType.EVisionType
/// Size: 0x01 (1 bytes)
enum class EVisionType : uint8_t
{
	EVisionType__NewEnumerator0                                                      = 0,
	EVisionType__NewEnumerator1                                                      = 1,
	EVisionType__NewEnumerator2                                                      = 2,
	EVisionType__NewEnumerator3                                                      = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EBattleUIChild.EBattleUIChild
/// Size: 0x01 (1 bytes)
enum class EBattleUIChild : uint8_t
{
	EBattleUIChild__NewEnumerator0                                                   = 0,
	EBattleUIChild__NewEnumerator1                                                   = 1,
	EBattleUIChild__NewEnumerator2                                                   = 2,
	EBattleUIChild__NewEnumerator3                                                   = 3,
	EBattleUIChild__NewEnumerator4                                                   = 4,
	EBattleUIChild__NewEnumerator5                                                   = 5,
	EBattleUIChild__NewEnumerator6                                                   = 6,
	EBattleUIChild__NewEnumerator7                                                   = 7,
	EBattleUIChild__NewEnumerator8                                                   = 8,
	EBattleUIChild__NewEnumerator9                                                   = 9,
	EBattleUIChild__NewEnumerator10                                                  = 10,
	EBattleUIChild__NewEnumerator11                                                  = 11,
	EBattleUIChild__NewEnumerator12                                                  = 12,
	EBattleUIChild__NewEnumerator13                                                  = 13,
	EBattleUIChild__NewEnumerator14                                                  = 14,
	EBattleUIChild__NewEnumerator15                                                  = 15,
	EBattleUIChild__NewEnumerator16                                                  = 16,
	EBattleUIChild__NewEnumerator17                                                  = 17,
	EBattleUIChild__NewEnumerator18                                                  = 18,
	EBattleUIChild__NewEnumerator19                                                  = 19,
	EBattleUIChild__NewEnumerator20                                                  = 20
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillBehaviorBestSpotType.ESkillBehaviorBestSpotType
/// Size: 0x01 (1 bytes)
enum class ESkillBehaviorBestSpotType : uint8_t
{
	ESkillBehaviorBestSpotType__NewEnumerator12                                      = 0,
	ESkillBehaviorBestSpotType__NewEnumerator13                                      = 1
};

/// Enum /Game/Aki/Data/NPC/SimpleNpcFlow/ESimpleNpcFlowIndex.ESimpleNpcFlowIndex
/// Size: 0x01 (1 bytes)
enum class ESimpleNpcFlowIndex : uint8_t
{
	ESimpleNpcFlowIndex__NewEnumerator0                                              = 0,
	ESimpleNpcFlowIndex__NewEnumerator1                                              = 1,
	ESimpleNpcFlowIndex__NewEnumerator2                                              = 2,
	ESimpleNpcFlowIndex__NewEnumerator3                                              = 3,
	ESimpleNpcFlowIndex__NewEnumerator4                                              = 4,
	ESimpleNpcFlowIndex__NewEnumerator5                                              = 5,
	ESimpleNpcFlowIndex__NewEnumerator6                                              = 6,
	ESimpleNpcFlowIndex__NewEnumerator7                                              = 7,
	ESimpleNpcFlowIndex__NewEnumerator8                                              = 8,
	ESimpleNpcFlowIndex__NewEnumerator9                                              = 9,
	ESimpleNpcFlowIndex__NewEnumerator10                                             = 10
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Billboard/E_BillboardMode.E_BillboardMode
/// Size: 0x01 (1 bytes)
enum class E_BillboardMode : uint8_t
{
	E_BillboardMode__NewEnumerator2                                                  = 0,
	E_BillboardMode__NewEnumerator1                                                  = 1,
	E_BillboardMode__NewEnumerator3                                                  = 2
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialController/ECharacterControllerUVSwitch.ECharacterControllerUVSwitch
/// Size: 0x01 (1 bytes)
enum class ECharacterControllerUVSwitch : uint8_t
{
	ECharacterControllerUVSwitch__NewEnumerator0                                     = 0,
	ECharacterControllerUVSwitch__NewEnumerator1                                     = 1,
	ECharacterControllerUVSwitch__NewEnumerator2                                     = 2,
	ECharacterControllerUVSwitch__NewEnumerator3                                     = 3,
	ECharacterControllerUVSwitch__NewEnumerator4                                     = 4
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialController/ECharacterControllerChannelSwitch.ECharacterControllerChannelSwitch
/// Size: 0x01 (1 bytes)
enum class ECharacterControllerChannelSwitch : uint8_t
{
	ECharacterControllerChannelSwitch__NewEnumerator0                                = 0,
	ECharacterControllerChannelSwitch__NewEnumerator1                                = 1,
	ECharacterControllerChannelSwitch__NewEnumerator2                                = 2,
	ECharacterControllerChannelSwitch__NewEnumerator3                                = 3,
	ECharacterControllerChannelSwitch__NewEnumerator4                                = 4
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialController/ECharacterControllerApplyType.ECharacterControllerApplyType
/// Size: 0x01 (1 bytes)
enum class ECharacterControllerApplyType : uint8_t
{
	ECharacterControllerApplyType__NewEnumerator0                                    = 0,
	ECharacterControllerApplyType__NewEnumerator2                                    = 1
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialContainer/ECharacterSlotSpecifiedType.ECharacterSlotSpecifiedType
/// Size: 0x01 (1 bytes)
enum class ECharacterSlotSpecifiedType : uint8_t
{
	ECharacterSlotSpecifiedType__NewEnumerator3                                      = 0,
	ECharacterSlotSpecifiedType__NewEnumerator0                                      = 1,
	ECharacterSlotSpecifiedType__NewEnumerator1                                      = 2,
	ECharacterSlotSpecifiedType__NewEnumerator2                                      = 3
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/MaterialContainer/ECharacterSlotType.ECharacterSlotType
/// Size: 0x01 (1 bytes)
enum class ECharacterSlotType : uint8_t
{
	ECharacterSlotType__NewEnumerator4                                               = 0,
	ECharacterSlotType__NewEnumerator0                                               = 1,
	ECharacterSlotType__NewEnumerator1                                               = 2,
	ECharacterSlotType__NewEnumerator2                                               = 3,
	ECharacterSlotType__NewEnumerator3                                               = 4,
	ECharacterSlotType__NewEnumerator5                                               = 5
};

/// Enum /Game/Aki/Data/NPC/SimpleNpcFlow/ESimpleNpcFlowCheckType.ESimpleNpcFlowCheckType
/// Size: 0x01 (1 bytes)
enum class ESimpleNpcFlowCheckType : uint8_t
{
	ESimpleNpcFlowCheckType__NewEnumerator0                                          = 0,
	ESimpleNpcFlowCheckType__NewEnumerator1                                          = 1,
	ESimpleNpcFlowCheckType__NewEnumerator4                                          = 2,
	ESimpleNpcFlowCheckType__NewEnumerator3                                          = 3,
	ESimpleNpcFlowCheckType__NewEnumerator6                                          = 4,
	ESimpleNpcFlowCheckType__NewEnumerator7                                          = 5,
	ESimpleNpcFlowCheckType__NewEnumerator2                                          = 6,
	ESimpleNpcFlowCheckType__NewEnumerator5                                          = 7,
	ESimpleNpcFlowCheckType__NewEnumerator9                                          = 8,
	ESimpleNpcFlowCheckType__NewEnumerator8                                          = 9
};

/// Enum /Game/Aki/Core/Fight/EPositionStandard.EPositionStandard
/// Size: 0x01 (1 bytes)
enum class EPositionStandard : uint8_t
{
	EPositionStandard__NewEnumerator0                                                = 0,
	EPositionStandard__NewEnumerator1                                                = 1,
	EPositionStandard__NewEnumerator2                                                = 2,
	EPositionStandard__NewEnumerator3                                                = 3,
	EPositionStandard__NewEnumerator4                                                = 4,
	EPositionStandard__NewEnumerator5                                                = 5,
	EPositionStandard__NewEnumerator7                                                = 6,
	EPositionStandard__NewEnumerator8                                                = 7,
	EPositionStandard__NewEnumerator9                                                = 8,
	EPositionStandard__NewEnumerator10                                               = 9,
	EPositionStandard__NewEnumerator11                                               = 10
};

/// Enum /Game/Aki/Core/Fight/EHitType.EHitType
/// Size: 0x01 (1 bytes)
enum class EHitType : uint8_t
{
	EHitType__NewEnumerator0                                                         = 0,
	EHitType__NewEnumerator1                                                         = 1,
	EHitType__NewEnumerator2                                                         = 2,
	EHitType__NewEnumerator3                                                         = 3,
	EHitType__NewEnumerator4                                                         = 4
};

/// Enum /Game/Aki/Core/Fight/EBulletChildrenType.EBulletChildrenType
/// Size: 0x01 (1 bytes)
enum class EBulletChildrenType : uint8_t
{
	EBulletChildrenType__NewEnumerator4                                              = 0,
	EBulletChildrenType__NewEnumerator0                                              = 1,
	EBulletChildrenType__NewEnumerator1                                              = 2,
	EBulletChildrenType__NewEnumerator2                                              = 3,
	EBulletChildrenType__NewEnumerator3                                              = 4,
	EBulletChildrenType__NewEnumerator5                                              = 5
};

/// Enum /Game/Aki/Sequence/Manager/Enum/SeqCameraMode.SeqCameraMode
/// Size: 0x01 (1 bytes)
enum class SeqCameraMode : uint8_t
{
	SeqCameraMode__NewEnumerator0                                                    = 0,
	SeqCameraMode__NewEnumerator1                                                    = 1,
	SeqCameraMode__NewEnumerator2                                                    = 2
};

/// Enum /Game/Aki/Character/Role/Common/Data/Enum/EPerformanceRoleState.EPerformanceRoleState
/// Size: 0x01 (1 bytes)
enum class EPerformanceRoleState : uint8_t
{
	EPerformanceRoleState__NewEnumerator0                                            = 0,
	EPerformanceRoleState__NewEnumerator1                                            = 1,
	EPerformanceRoleState__NewEnumerator7                                            = 2,
	EPerformanceRoleState__NewEnumerator2                                            = 3,
	EPerformanceRoleState__NewEnumerator9                                            = 4,
	EPerformanceRoleState__NewEnumerator3                                            = 5,
	EPerformanceRoleState__NewEnumerator4                                            = 6,
	EPerformanceRoleState__NewEnumerator5                                            = 7,
	EPerformanceRoleState__NewEnumerator6                                            = 8,
	EPerformanceRoleState__NewEnumerator10                                           = 9,
	EPerformanceRoleState__NewEnumerator11                                           = 10,
	EPerformanceRoleState__NewEnumerator12                                           = 11,
	EPerformanceRoleState__NewEnumerator13                                           = 12,
	EPerformanceRoleState__NewEnumerator14                                           = 13,
	EPerformanceRoleState__NewEnumerator15                                           = 14,
	EPerformanceRoleState__NewEnumerator16                                           = 15,
	EPerformanceRoleState__NewEnumerator17                                           = 16,
	EPerformanceRoleState__NewEnumerator18                                           = 17,
	EPerformanceRoleState__NewEnumerator19                                           = 18,
	EPerformanceRoleState__NewEnumerator21                                           = 19,
	EPerformanceRoleState__NewEnumerator22                                           = 20,
	EPerformanceRoleState__NewEnumerator23                                           = 21
};

/// Enum /Game/Aki/Character/Input/Enum/EInputCharacterState.EInputCharacterState
/// Size: 0x01 (1 bytes)
enum class EInputCharacterState : uint8_t
{
	EInputCharacterState__NewEnumerator0                                             = 0,
	EInputCharacterState__NewEnumerator1                                             = 1,
	EInputCharacterState__NewEnumerator2                                             = 2,
	EInputCharacterState__NewEnumerator3                                             = 3,
	EInputCharacterState__NewEnumerator4                                             = 4,
	EInputCharacterState__NewEnumerator5                                             = 5,
	EInputCharacterState__NewEnumerator6                                             = 6,
	EInputCharacterState__NewEnumerator7                                             = 7,
	EInputCharacterState__NewEnumerator8                                             = 8
};

/// Enum /Game/Aki/Data/LevelGamePlay/StrikeResponse/Stuct/StrikeType.StrikeType
/// Size: 0x01 (1 bytes)
enum class StrikeType : uint8_t
{
	StrikeType__NewEnumerator0                                                       = 0,
	StrikeType__NewEnumerator1                                                       = 1,
	StrikeType__NewEnumerator4                                                       = 2,
	StrikeType__NewEnumerator2                                                       = 3
};

/// Enum /Game/Aki/Data/Interaction/Enum/EInteractOptionType.EInteractOptionType
/// Size: 0x01 (1 bytes)
enum class EInteractOptionType : uint8_t
{
	EInteractOptionType__NewEnumerator0                                              = 0,
	EInteractOptionType__NewEnumerator1                                              = 1,
	EInteractOptionType__NewEnumerator2                                              = 2
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillGenre.ESkillGenre
/// Size: 0x01 (1 bytes)
enum class ESkillGenre : uint8_t
{
	ESkillGenre__NewEnumerator0                                                      = 0,
	ESkillGenre__NewEnumerator1                                                      = 1,
	ESkillGenre__NewEnumerator2                                                      = 2,
	ESkillGenre__NewEnumerator3                                                      = 3,
	ESkillGenre__NewEnumerator4                                                      = 4,
	ESkillGenre__NewEnumerator5                                                      = 5,
	ESkillGenre__NewEnumerator6                                                      = 6,
	ESkillGenre__NewEnumerator7                                                      = 7,
	ESkillGenre__NewEnumerator8                                                      = 8,
	ESkillGenre__NewEnumerator9                                                      = 9,
	ESkillGenre__NewEnumerator10                                                     = 10,
	ESkillGenre__NewEnumerator11                                                     = 11,
	ESkillGenre__NewEnumerator13                                                     = 12,
	ESkillGenre__NewEnumerator12                                                     = 13
};

/// Enum /Game/Aki/Character/BaseCharacter/EExitClimb.EExitClimb
/// Size: 0x01 (1 bytes)
enum class EExitClimb : uint8_t
{
	EExitClimb__NewEnumerator0                                                       = 0,
	EExitClimb__NewEnumerator1                                                       = 1,
	EExitClimb__NewEnumerator2                                                       = 2,
	EExitClimb__NewEnumerator3                                                       = 3,
	EExitClimb__NewEnumerator5                                                       = 4,
	EExitClimb__NewEnumerator6                                                       = 5,
	EExitClimb__NewEnumerator7                                                       = 6,
	EExitClimb__NewEnumerator8                                                       = 7,
	EExitClimb__NewEnumerator11                                                      = 8,
	EExitClimb__NewEnumerator12                                                      = 9,
	EExitClimb__NewEnumerator13                                                      = 10
};

/// Enum /Game/Aki/Character/BaseCharacter/ESkillOverrideType.ESkillOverrideType
/// Size: 0x01 (1 bytes)
enum class ESkillOverrideType : uint8_t
{
	ESkillOverrideType__NewEnumerator0                                               = 0,
	ESkillOverrideType__NewEnumerator1                                               = 1,
	ESkillOverrideType__NewEnumerator2                                               = 2,
	ESkillOverrideType__NewEnumerator3                                               = 3
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/ECameraModifyConditionType.ECameraModifyConditionType
/// Size: 0x01 (1 bytes)
enum class ECameraModifyConditionType : uint8_t
{
	ECameraModifyConditionType__NewEnumerator0                                       = 0,
	ECameraModifyConditionType__NewEnumerator1                                       = 1,
	ECameraModifyConditionType__NewEnumerator2                                       = 2,
	ECameraModifyConditionType__NewEnumerator7                                       = 3,
	ECameraModifyConditionType__NewEnumerator3                                       = 4,
	ECameraModifyConditionType__NewEnumerator4                                       = 5,
	ECameraModifyConditionType__NewEnumerator5                                       = 6,
	ECameraModifyConditionType__NewEnumerator8                                       = 7
};

/// Enum /Game/Aki/Data/NPC/SimpleNpcFlow/ESimpleNpcWorldState.ESimpleNpcWorldState
/// Size: 0x01 (1 bytes)
enum class ESimpleNpcWorldState : uint8_t
{
	ESimpleNpcWorldState__NewEnumerator0                                             = 0,
	ESimpleNpcWorldState__NewEnumerator1                                             = 1,
	ESimpleNpcWorldState__NewEnumerator2                                             = 2
};

/// Enum /Game/Aki/Core/Fight/EBulletDestOffset.EBulletDestOffset
/// Size: 0x01 (1 bytes)
enum class EBulletDestOffset : uint8_t
{
	EBulletDestOffset__NewEnumerator0                                                = 0,
	EBulletDestOffset__NewEnumerator1                                                = 1,
	EBulletDestOffset__NewEnumerator2                                                = 2
};

/// Enum /Game/Aki/Core/Fight/EBulletBeginVelocityLimit.EBulletBeginVelocityLimit
/// Size: 0x01 (1 bytes)
enum class EBulletBeginVelocityLimit : uint8_t
{
	EBulletBeginVelocityLimit__NewEnumerator0                                        = 0,
	EBulletBeginVelocityLimit__NewEnumerator1                                        = 1,
	EBulletBeginVelocityLimit__NewEnumerator2                                        = 2,
	EBulletBeginVelocityLimit__NewEnumerator3                                        = 3
};

/// Enum /Game/Aki/Core/Fight/EBulletEffectOnHitType.EBulletEffectOnHitType
/// Size: 0x01 (1 bytes)
enum class EBulletEffectOnHitType : uint8_t
{
	EBulletEffectOnHitType__NewEnumerator0                                           = 0
};

/// Enum /Game/Aki/Data/Interaction/Enum/EInteractOptionLimit.EInteractOptionLimit
/// Size: 0x01 (1 bytes)
enum class EInteractOptionLimit : uint8_t
{
	EInteractOptionLimit__NewEnumerator0                                             = 0,
	EInteractOptionLimit__NewEnumerator1                                             = 1,
	EInteractOptionLimit__NewEnumerator3                                             = 2
};

/// Enum /Game/Aki/Render/RuntimeBP/StateMachineEffect/EEffectState.EEffectState
/// Size: 0x01 (1 bytes)
enum class EEffectState : uint8_t
{
	EEffectState__NewEnumerator0                                                     = 0,
	EEffectState__NewEnumerator1                                                     = 1,
	EEffectState__NewEnumerator2                                                     = 2,
	EEffectState__NewEnumerator3                                                     = 3,
	EEffectState__NewEnumerator4                                                     = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/EAttributeTarget.EAttributeTarget
/// Size: 0x01 (1 bytes)
enum class EAttributeTarget : uint8_t
{
	EAttributeTarget__NewEnumerator1                                                 = 0,
	EAttributeTarget__NewEnumerator0                                                 = 1
};

/// Enum /Game/Aki/Character/BaseCharacter/EAttributeOperation.EAttributeOperation
/// Size: 0x01 (1 bytes)
enum class EAttributeOperation : uint8_t
{
	EAttributeOperation__NewEnumerator0                                              = 0,
	EAttributeOperation__NewEnumerator1                                              = 1,
	EAttributeOperation__NewEnumerator2                                              = 2,
	EAttributeOperation__NewEnumerator3                                              = 3,
	EAttributeOperation__NewEnumerator4                                              = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/EAttributeEffectType.EAttributeEffectType
/// Size: 0x01 (1 bytes)
enum class EAttributeEffectType : uint8_t
{
	EAttributeEffectType__NewEnumerator0                                             = 0,
	EAttributeEffectType__NewEnumerator1                                             = 1,
	EAttributeEffectType__NewEnumerator2                                             = 2
};

/// Enum /Game/Aki/Render/RuntimeBP/ScreenEffect/Data/E_SE_PlayState.E_SE_PlayState
/// Size: 0x01 (1 bytes)
enum class E_SE_PlayState : uint8_t
{
	E_SE_PlayState__NewEnumerator0                                                   = 0,
	E_SE_PlayState__NewEnumerator1                                                   = 1,
	E_SE_PlayState__NewEnumerator2                                                   = 2,
	E_SE_PlayState__NewEnumerator3                                                   = 3
};

/// Enum /Game/Aki/AI/AIFunctionCommon/EActionPlan.EActionPlan
/// Size: 0x01 (1 bytes)
enum class EActionPlan : uint8_t
{
	EActionPlan__NewEnumerator0                                                      = 0,
	EActionPlan__NewEnumerator1                                                      = 1,
	EActionPlan__NewEnumerator3                                                      = 2,
	EActionPlan__NewEnumerator4                                                      = 3,
	EActionPlan__NewEnumerator5                                                      = 4
};

/// Enum /Game/Aki/Character/BaseCharacter/Camera/EFightCameraHook.EFightCameraHook
/// Size: 0x01 (1 bytes)
enum class EFightCameraHook : uint8_t
{
	EFightCameraHook__NewEnumerator0                                                 = 0
};

/// Enum /Game/Aki/Character/BaseCharacter/StateMachine/EMonsterDeathType.EMonsterDeathType
/// Size: 0x01 (1 bytes)
enum class EMonsterDeathType : uint8_t
{
	EMonsterDeathType__NewEnumerator0                                                = 0,
	EMonsterDeathType__NewEnumerator2                                                = 1,
	EMonsterDeathType__NewEnumerator1                                                = 2
};

/// Enum /Game/Aki/Character/Kpose/Blueprint/BP_Enum_PlatformSize.BP_Enum_PlatformSize
/// Size: 0x01 (1 bytes)
enum class BP_Enum_PlatformSize : uint8_t
{
	BP_Enum_PlatformSize__NewEnumerator0                                             = 0,
	BP_Enum_PlatformSize__NewEnumerator1                                             = 1,
	BP_Enum_PlatformSize__NewEnumerator2                                             = 2
};

/// Enum /Game/Aki/TypeScript/Game/NewWorld/Character/SimpleNpc/Blueprint/EHolographicState.EHolographicState
/// Size: 0x01 (1 bytes)
enum class EHolographicState : uint8_t
{
	EHolographicState__NewEnumerator0                                                = 0,
	EHolographicState__NewEnumerator1                                                = 1,
	EHolographicState__NewEnumerator2                                                = 2,
	EHolographicState__NewEnumerator3                                                = 3
};

/// Enum /Game/Aki/Render/RuntimeBP/Effect/Ghost/EEffectModelGhostComponent.EEffectModelGhostComponent
/// Size: 0x01 (1 bytes)
enum class EEffectModelGhostComponent : uint8_t
{
	EEffectModelGhostComponent__NewEnumerator0                                       = 0,
	EEffectModelGhostComponent__NewEnumerator1                                       = 1,
	EEffectModelGhostComponent__NewEnumerator2                                       = 2,
	EEffectModelGhostComponent__NewEnumerator5                                       = 3,
	EEffectModelGhostComponent__NewEnumerator6                                       = 4,
	EEffectModelGhostComponent__NewEnumerator7                                       = 5,
	EEffectModelGhostComponent__NewEnumerator3                                       = 6,
	EEffectModelGhostComponent__NewEnumerator8                                       = 7,
	EEffectModelGhostComponent__NewEnumerator9                                       = 8,
	EEffectModelGhostComponent__NewEnumerator10                                      = 9,
	EEffectModelGhostComponent__NewEnumerator11                                      = 10,
	EEffectModelGhostComponent__NewEnumerator12                                      = 11
};

/// Enum /Game/Aki/Render/RuntimeBP/ScreenEffect/Data/E_SE_PlayOrder.E_SE_PlayOrder
/// Size: 0x01 (1 bytes)
enum class E_SE_PlayOrder : uint8_t
{
	E_SE_PlayOrder__NewEnumerator0                                                   = 0,
	E_SE_PlayOrder__NewEnumerator1                                                   = 1
};

/// Enum /Game/Aki/Render/RuntimeBP/Character/Npc/EBodyPartName.EBodyPartName
/// Size: 0x01 (1 bytes)
enum class EBodyPartName : uint8_t
{
	EBodyPartName__NewEnumerator4                                                    = 0,
	EBodyPartName__NewEnumerator0                                                    = 1,
	EBodyPartName__NewEnumerator1                                                    = 2,
	EBodyPartName__NewEnumerator2                                                    = 3,
	EBodyPartName__NewEnumerator3                                                    = 4
};

/// Enum /Game/Aki/Data/Quest/Enum/EQuestType.EQuestType
/// Size: 0x01 (1 bytes)
enum class EQuestType : uint8_t
{
	EQuestType__NewEnumerator0                                                       = 0,
	EQuestType__NewEnumerator1                                                       = 1
};

/// Enum /Game/Aki/Data/Fight/UI/ESpecialEnergyBarPrefabType.ESpecialEnergyBarPrefabType
/// Size: 0x01 (1 bytes)
enum class ESpecialEnergyBarPrefabType : uint8_t
{
	ESpecialEnergyBarPrefabType__NewEnumerator0                                      = 0,
	ESpecialEnergyBarPrefabType__NewEnumerator1                                      = 1,
	ESpecialEnergyBarPrefabType__NewEnumerator2                                      = 2,
	ESpecialEnergyBarPrefabType__NewEnumerator3                                      = 3,
	ESpecialEnergyBarPrefabType__NewEnumerator4                                      = 4,
	ESpecialEnergyBarPrefabType__NewEnumerator5                                      = 5,
	ESpecialEnergyBarPrefabType__NewEnumerator11                                     = 6,
	ESpecialEnergyBarPrefabType__NewEnumerator6                                      = 7,
	ESpecialEnergyBarPrefabType__NewEnumerator12                                     = 8,
	ESpecialEnergyBarPrefabType__NewEnumerator13                                     = 9
};

/// Enum /Game/Aki/Data/Fight/UI/EPanelQteViewType.EPanelQteViewType
/// Size: 0x01 (1 bytes)
enum class EPanelQteViewType : uint8_t
{
	EPanelQteViewType__NewEnumerator0                                                = 0,
	EPanelQteViewType__NewEnumerator3                                                = 1
};

/// Enum /Game/Aki/Data/Fight/UI/EPanelQteCustomAction.EPanelQteCustomAction
/// Size: 0x01 (1 bytes)
enum class EPanelQteCustomAction : uint8_t
{
	EPanelQteCustomAction__NewEnumerator0                                            = 0,
	EPanelQteCustomAction__NewEnumerator1                                            = 1
};

/// Enum /Game/Aki/Character/Vision/GA/Role/BPE_ManipulateState.BPE_ManipulateState
/// Size: 0x01 (1 bytes)
enum class BPE_ManipulateState : uint8_t
{
	BPE_ManipulateState__NewEnumerator4                                              = 0,
	BPE_ManipulateState__NewEnumerator0                                              = 1,
	BPE_ManipulateState__NewEnumerator1                                              = 2,
	BPE_ManipulateState__NewEnumerator6                                              = 3,
	BPE_ManipulateState__NewEnumerator2                                              = 4,
	BPE_ManipulateState__NewEnumerator5                                              = 5
};

/// Enum /Game/Aki/AI/AIFunctionCommon/EWalkingPosture.EWalkingPosture
/// Size: 0x01 (1 bytes)
enum class EWalkingPosture : uint8_t
{
	EWalkingPosture__NewEnumerator0                                                  = 0,
	EWalkingPosture__NewEnumerator1                                                  = 1
};

/// Class /Game/Aki/Core/BP_MainGameInstance.BP_MainGameInstance_C
/// Size: 0x0011 (17 bytes) (0x0001B0 - 0x0001C1) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class UBP_MainGameInstance_C : public UGameInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01B0   (0x0008)  
	class ULoadMapNotify*                              _Wof_R_;                                                    // 0x01B8   (0x0008)  
	bool                                               IsStartFromLaunch;                                          // 0x01C0   (0x0001)  
	// void StartGame();                                                                                                        // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Reboot();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void MountGamePak();                                                                                                     // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void MountLauncherPak();                                                                                                 // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ReceiveInit();                                                                                                      // [0x25a7960] Event|Public|BlueprintEvent 
	// void ExecuteUbergraph_BP_MainGameInstance(int32_t EntryPoint);                                                           // [0x25a7960] Final                
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/PD_CloudPreset.PD_CloudPreset_C
/// Size: 0x03C0 (960 bytes) (0x000038 - 0x0003F8) align 8 pad: 0x0000
class UPD_CloudPreset_C : public UPrimaryDataAsset
{ 
public:
	SDK_UNDEFINED(48,938) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_Y);                                       // 0x0038   (0x0030)  
	SDK_UNDEFINED(48,939) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(W___);                                     // 0x0068   (0x0030)  
	SDK_UNDEFINED(48,940) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_eIQ);                                     // 0x0098   (0x0030)  
	SDK_UNDEFINED(48,941) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_vU_);                                     // 0x00C8   (0x0030)  
	SDK_UNDEFINED(48,942) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_e___S);                                   // 0x00F8   (0x0030)  
	SDK_UNDEFINED(48,943) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_e___);                                    // 0x0128   (0x0030)  
	SDK_UNDEFINED(48,944) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_N_f);                                     // 0x0158   (0x0030)  
	SDK_UNDEFINED(48,945) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_S_uKm_);                                  // 0x0188   (0x0030)  
	SDK_UNDEFINED(48,946) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_e___);                                    // 0x01B8   (0x0030)  
	SDK_UNDEFINED(48,947) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_e___);                                    // 0x01E8   (0x0030)  
	SDK_UNDEFINED(48,948) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_e___);                                    // 0x0218   (0x0030)  
	SDK_UNDEFINED(48,949) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_e___);                                    // 0x0248   (0x0030)  
	SDK_UNDEFINED(48,950) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_o_);                                      // 0x0278   (0x0030)  
	SDK_UNDEFINED(48,951) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(__no);                                     // 0x02A8   (0x0030)  
	SDK_UNDEFINED(48,952) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(4__Y);                                     // 0x02D8   (0x0030)  
	SDK_UNDEFINED(48,953) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(___f);                                     // 0x0308   (0x0030)  
	SDK_UNDEFINED(48,954) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_S___);                                    // 0x0338   (0x0030)  
	SDK_UNDEFINED(48,955) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(_YZf);                                     // 0x0368   (0x0030)  
	SDK_UNDEFINED(48,956) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(__);                                       // 0x0398   (0x0030)  
	SDK_UNDEFINED(48,957) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(___);                                      // 0x03C8   (0x0030)  
};

/// Class /Game/Aki/Render/RuntimeBP/Library/BPF_CameraHelper.BPF_CameraHelper_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UBPF_CameraHelper_C : public UBlueprintFunctionLibrary
{ 
public:
	// void GetCameraRotator(int32_t PlayerIndex, class UObject* __WorldContext, bool& Success, FRotator& Rotator);             // [0x25a7960] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// void GetCameraLocation(int32_t PlayerIndex, class UObject* __WorldContext, bool& Success, FVector& Location);            // [0x25a7960] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// void GetCameraTransform(int32_t PlayerIndex, class UObject* __WorldContext, bool& Success, FTransform& Transform);       // [0x25a7960] Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
};

/// Class /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/BP_Clouds.BP_Clouds_C
/// Size: 0x0098 (152 bytes) (0x0002B8 - 0x000350) align 8 pad: 0x0000
class ABP_Clouds_C : public AKuroEditorTickActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  
	class UChildActorComponent*                        Cloud02;                                                    // 0x02C0   (0x0008)  
	class UChildActorComponent*                        Cloud01;                                                    // 0x02C8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02D0   (0x0008)  
	TEnumAsByte<E_Cloud_Presents>                      S_MR_N____;                                                 // 0x02D8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x02D9   (0x0007)  MISSED
	class UPD_CloudPreset_C*                           CloudData;                                                  // 0x02E0   (0x0008)  
	bool                                               Counting;                                                   // 0x02E8   (0x0001)  
	TEnumAsByte<E_Cloud_Presents>                      ______e;                                                    // 0x02E9   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x02EA   (0x0006)  MISSED
	SDK_UNDEFINED(48,958) /* TWeakObjectPtr<UPD_CloudPrefab_C*> */ __um(CloudAsset);                               // 0x02F0   (0x0030)  
	TArray<int32_t>                                    SortNumber;                                                 // 0x0320   (0x0010)  
	class UPD_CloudPrefab_C*                           As_PD_Cloud_Prefab;                                         // 0x0330   (0x0008)  
	class UAkAudioEvent*                               CachedAudioEvent2D;                                         // 0x0338   (0x0008)  
	bool                                               IsSkyOcean;                                                 // 0x0340   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0341   (0x0007)  MISSED
	class UAkAudioEvent*                               SkyOceanAudio;                                              // 0x0348   (0x0008)  
	// void GetGIParams(FSGIData GIData);                                                                                       // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _0();                                                                                                               // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void __();                                                                                                               // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _S___();                                                                                                            // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _S_uKm();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void SetCloudParameters(class UPD_CloudPrefab_C* CloudPrefeb, class UChildActorComponent* CloudActorComponent, float ChangeSpeed, int32_t TransSortNumber); // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void HiddenOld();                                                                                                        // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void SwitchCloudsSub(class UPD_CloudPrefab_C* CloudPresents, float ChangeSpeed);                                         // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void UserConstructionScript();                                                                                           // [0x25a7960] Event|Public|BlueprintCallable|BlueprintEvent 
	// void OnLoaded_63FE5E2B437AFAD504FBCAB26242EB8A(class UObject* Loaded);                                                   // [0x25a7960] BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x25a7960] Event|Public|BlueprintEvent 
	// void EditorTick(float DeltaSeconds);                                                                                     // [0x25a7960] Event|Public|BlueprintEvent 
	// void ChangeCloud();                                                                                                      // [0x25a7960] BlueprintCallable|BlueprintEvent 
	// void SwitchClouds(TEnumAsByte<E_Cloud_Presents> CloudPresents, float ChangeSpeed, bool IsInEditor);                      // [0x25a7960] BlueprintCallable|BlueprintEvent 
	// void LoadAndSwitch(TWeakObjectPtr<UObject*> Asset, float ChangeSpeed, bool IsInEditor, bool IsAudio);                    // [0x25a7960] BlueprintCallable|BlueprintEvent 
	// void ExecuteUbergraph_BP_Clouds(int32_t EntryPoint);                                                                     // [0x25a7960] Final|HasDefaults    
};

/// Struct /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WeatherData.WeatherData
/// Size: 0x006C (108 bytes) (0x000000 - 0x00006C) align 4 pad: 0x0000
struct FWeatherData
{ 
	float                                              CloudsScale_6_46BD2FFD4101E62C58B396AE3DAA8046;             // 0x0000   (0x0004)  
	float                                              CloudsDensity_8_C959F15B494C31785AB9BDA43B1D7D13;           // 0x0004   (0x0004)  
	float                                              CloudsVertexDensity_80_5B70D3CB4EBF864F08091E8395A218C9;    // 0x0008   (0x0004)  
	float                                              CloudsHarness_10_C035BB69421FE083D844959BBFE947D1;          // 0x000C   (0x0004)  
	float                                              CloudsTranslucent_18_6BF1A8914FAA8F67988B9DADC914CBC6;      // 0x0010   (0x0004)  
	float                                              CloudsBlend_17_0B0902B849FFF532D0FA73AD750162A7;            // 0x0014   (0x0004)  
	float                                              CloudsDistotion_19_FF8260554CA3B701D6C62A87A392E3BA;        // 0x0018   (0x0004)  
	float                                              CloudsScattering_20_EA03A384445C04BBBC4EA2A3A28674D9;       // 0x001C   (0x0004)  
	float                                              CloudsUpperBrightness_47_80E6F59C44C0E63FF352E1ACA405DEAD;  // 0x0020   (0x0004)  
	float                                              CloudsLowerBrightness_48_C275CDC444671D9809D344A043817F24;  // 0x0024   (0x0004)  
	float                                              CloudsAmbient_26_B3DE5189457AF2F2C9061DAE095629E4;          // 0x0028   (0x0004)  
	float                                              CloudsShadowSize_32_30070F544C29A5175B4905A3CAA43C9B;       // 0x002C   (0x0004)  
	float                                              CloudsShadowSoft_33_242397844998748E4CE442A82FABD76E;       // 0x0030   (0x0004)  
	float                                              CloudsBackground_34_81AB1CD743507906283E26BC8179CD02;       // 0x0034   (0x0004)  
	float                                              CloudsHorizonDensity_35_A9DA12E04BD1ACCE877556A07AFC0A81;   // 0x0038   (0x0004)  
	float                                              CloudsHorizonAlpha_36_B5FE09604EE51B66C6109689DD26A633;     // 0x003C   (0x0004)  
	float                                              CloudsHorizonScattering_38_96C12A72485C8C653890E983ADECA031; // 0x0040   (0x0004)  
	float                                              HorizonFalloff_41_7ADEA15D4BAFCED09051BDAAB67D0E6E;         // 0x0044   (0x0004)  
	float                                              WindForceScale_42_494196B04350B9CE2B731E97799FE070;         // 0x0048   (0x0004)  
	float                                              WindDynamic_45_4BD5C5EC4B00477CD0BAC8857B6087F7;            // 0x004C   (0x0004)  
	float                                              WindDispersing_46_747C4F2B40612E5FE76792B0CB7C4E90;         // 0x0050   (0x0004)  
	float                                              SkylightBrightness_52_D0DC0C2C48095A9468CA2A8ECC6B512B;     // 0x0054   (0x0004)  
	float                                              SecondLayerHardness_84_45838BE4416742C9BAAEBE949ACA2027;    // 0x0058   (0x0004)  
	float                                              SecondLayerColor_71_16427994489B87788D8B02B67E7E863B;       // 0x005C   (0x0004)  
	float                                              SecondLayerAlpha_72_8759E297465AF80FD8856791526E7414;       // 0x0060   (0x0004)  
	float                                              SecondLayerScale_77_6F5F9AE84D7C8132AF2BD68DD7F5A018;       // 0x0064   (0x0004)  
	float                                              SecondLayerWind_73_58F8ABAE4AE471692F3D53A832B70EC0;        // 0x0068   (0x0004)  
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WeatherPreset.WeatherPreset_C
/// Size: 0x006C (108 bytes) (0x000030 - 0x00009C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UWeatherPreset_C : public UObject
{ 
public:
	FWeatherData                                       Data;                                                       // 0x0030   (0x006C)  
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Sunny.WP_Sunny_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Sunny_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Stormy.WP_Stormy_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Stormy_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Snowy.WP_Snowy_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Snowy_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Smoky.WP_Smoky_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Smoky_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Rainy.WP_Rainy_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Rainy_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Overcast.WP_Overcast_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Overcast_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_HalfSunny.WP_HalfSunny_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_HalfSunny_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Gloomy.WP_Gloomy_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Gloomy_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Foggy.WP_Foggy_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Foggy_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Cloudy.WP_Cloudy_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Cloudy_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Clean.WP_Clean_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Clean_C : public UWeatherPreset_C
{ 
public:
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/WP_Blizzard.WP_Blizzard_C
/// Size: 0x0000 (0 bytes) (0x00009C - 0x00009C) align 8 pad: 0x0000
class UWP_Blizzard_C : public UWeatherPreset_C
{ 
public:
};

/// Struct /Game/Aki/Render/RuntimeBP/GI/Data/TOD/TimeOfDayData.TimeOfDayData
/// Size: 0x00A4 (164 bytes) (0x000000 - 0x0000A4) align 4 pad: 0x0000
struct FTimeOfDayData
{ 
	float                                              PresetTimeOfDay_48_72731B344467C1038DE1E18CEB2DA386;        // 0x0000   (0x0004)  
	FLinearColor                                       SkyUpperColor_36_F574B1FF4C660D607018378D4D29D5D8;          // 0x0004   (0x0010)  
	FLinearColor                                       SkyLowerColor_37_9AE60C56438D767F5189779E892918F6;          // 0x0014   (0x0010)  
	FLinearColor                                       CloudsUpperColor_38_427730AB4B57918C2621AC9E42481B18;       // 0x0024   (0x0010)  
	FLinearColor                                       CloudsLowerColor_39_8C51A73643E77F6D68DF0C9FB66307B7;       // 0x0034   (0x0010)  
	FLinearColor                                       CloudsSecondaryColor_53_DC9F541A4A5DF218D25F3BAEFD108CC9;   // 0x0044   (0x0010)  
	FLinearColor                                       CloudsBackground_40_C26ACFC54FD13F33D88102AE41FC8C47;       // 0x0054   (0x0010)  
	FLinearColor                                       SunColor_41_4127FF7441301541CCC14C97D84E54F5;               // 0x0064   (0x0010)  
	FLinearColor                                       MoonColor_42_A8304BE24B8F8E787E683A8FEA4D486C;              // 0x0074   (0x0010)  
	FLinearColor                                       StarsColor_43_5B3DF4A1431B005F9583B498B90E49FC;             // 0x0084   (0x0010)  
	FLinearColor                                       FogColor_44_3CDDDC604F2BA0AD72A137903A4167F5;               // 0x0094   (0x0010)  
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Data/TOD/TimeOfDayPreset.TimeOfDayPreset_C
/// Size: 0x00A4 (164 bytes) (0x000030 - 0x0000D4) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UTimeOfDayPreset_C : public UObject
{ 
public:
	FTimeOfDayData                                     Data;                                                       // 0x0030   (0x00A4)  
};
#pragma pack(pop)

/// Struct /Game/Aki/Render/RuntimeBP/GI/Data/TOD/TimeOfDayCurves.TimeOfDayCurves
/// Size: 0x0050 (80 bytes) (0x000000 - 0x000050) align 8 pad: 0x0000
struct FTimeOfDayCurves
{ 
	class UCurveLinearColor*                           SkyUpperColorCurve_14_F574B1FF4C660D607018378D4D29D5D8;     // 0x0000   (0x0008)  
	class UCurveLinearColor*                           SkyLowerColorCurve_15_9AE60C56438D767F5189779E892918F6;     // 0x0008   (0x0008)  
	class UCurveLinearColor*                           CloudsUpperColorCurve_16_427730AB4B57918C2621AC9E42481B18;  // 0x0010   (0x0008)  
	class UCurveLinearColor*                           CloudsLowerColorCurve_17_8C51A73643E77F6D68DF0C9FB66307B7;  // 0x0018   (0x0008)  
	class UCurveLinearColor*                           CloudsBackgroundCurve_18_C26ACFC54FD13F33D88102AE41FC8C47;  // 0x0020   (0x0008)  
	class UCurveLinearColor*                           CloudsSecondaryColorCurve_31_EE55225E47F0CD95AF3DED9A93746791; // 0x0028   (0x0008)  
	class UCurveLinearColor*                           SunColorCurve_19_4127FF7441301541CCC14C97D84E54F5;          // 0x0030   (0x0008)  
	class UCurveLinearColor*                           MoonColorCurve_20_A8304BE24B8F8E787E683A8FEA4D486C;         // 0x0038   (0x0008)  
	class UCurveLinearColor*                           StarsColorCurve_22_5B3DF4A1431B005F9583B498B90E49FC;        // 0x0040   (0x0008)  
	class UCurveLinearColor*                           FogColorCurve_26_3CDDDC604F2BA0AD72A137903A4167F5;          // 0x0048   (0x0008)  
};

/// Struct /Game/Aki/Render/RuntimeBP/GI/Data/TOD/PresetChangeInfo.PresetChangeInfo
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 4 pad: 0x0000
struct FPresetChangeInfo
{ 
	bool                                               ReloadSelected_25_165DD8E44AE6D7882C2F5ABE35BF41BA;         // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            Selected_16_785F8D8944070D067940B8B6B53E25FC;               // 0x0004   (0x0004)  
	TEnumAsByte<PresetSelection>                       Mode_17_A4BD793844A78E1A22E2778BB14BE206;                   // 0x0008   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              TransitionDuration_19_73F6782E4DE8FB03600ECFBBB894BC0B;     // 0x000C   (0x0004)  
	TEnumAsByte<EEasingFunc>                           TransitionFunc_18_88BE11474DF134CA5C3E6190B2940A25;         // 0x0010   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0011   (0x0003)  MISSED
	float                                              ChangeAfterTime_21_BF5A190D458432A5BC9B168EA48AE7ED;        // 0x0014   (0x0004)  
};

/// Class /Game/Aki/Render/RuntimeBP/GI/Skybox/BP_SkyDome.BP_SkyDome_C
/// Size: 0x066C (1644 bytes) (0x0002A8 - 0x000914) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class ABP_SkyDome_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class UStaticMeshComponent*                        Dummy;                                                      // 0x02B0   (0x0008)  
	class UStaticMeshComponent*                        SkyMesh;                                                    // 0x02B8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02C0   (0x0008)  
	float                                              TimeOfDay;                                                  // 0x02C8   (0x0004)  
	float                                              TimeChangeSpeed;                                            // 0x02CC   (0x0004)  
	float                                              TimeCycleDuration;                                          // 0x02D0   (0x0004)  
	bool                                               UseTimeOfDayCurves;                                         // 0x02D4   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02D5   (0x0003)  MISSED
	FTimeOfDayCurves                                   TimeOfDayCurves;                                            // 0x02D8   (0x0050)  
	TArray<class UClass*>                              WeatherPresetList;                                          // 0x0328   (0x0010)  
	int32_t                                            SelectedWeatherPreset;                                      // 0x0338   (0x0004)  
	TEnumAsByte<PresetSelection>                       WeatherChangeMode;                                          // 0x033C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x033D   (0x0003)  MISSED
	float                                              WeatherChangeDuration;                                      // 0x0340   (0x0004)  
	TEnumAsByte<EEasingFunc>                           WeatherChangeTransition;                                    // 0x0344   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0345   (0x0003)  MISSED
	float                                              WeatherChangeAfterTime;                                     // 0x0348   (0x0004)  
	FTimeOfDayData                                     TimeOfDaySettings;                                          // 0x034C   (0x00A4)  
	TArray<class UClass*>                              TimeOfDayPresetList;                                        // 0x03F0   (0x0010)  
	FPresetChangeInfo                                  TimeOfDayPresetChange;                                      // 0x0400   (0x0018)  
	FRotator                                           MoonDirection;                                              // 0x0418   (0x000C)  
	float                                              SunHeight;                                                  // 0x0424   (0x0004)  
	FWeatherData                                       WeatherSettings;                                            // 0x0428   (0x006C)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0494   (0x0004)  MISSED
	class UMaterialInstanceDynamic*                    SkyMaterialInst;                                            // 0x0498   (0x0008)  
	class UClass*                                      WeatherPresetTarget;                                        // 0x04A0   (0x0008)  
	float                                              WeatherPresetInterp;                                        // 0x04A8   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x04AC   (0x0004)  MISSED
	class UMaterialInstanceConstant*                   SkyMaterial;                                                // 0x04B0   (0x0008)  
	class UMaterialInstanceConstant*                   SkyMaterialNight;                                           // 0x04B8   (0x0008)  
	class ADirectionalLight*                           SunLightSource;                                             // 0x04C0   (0x0008)  
	class ADirectionalLight*                           MoonLightSource;                                            // 0x04C8   (0x0008)  
	class AExponentialHeightFog*                       HeightFog;                                                  // 0x04D0   (0x0008)  
	class ASkyLight*                                   SkyLight;                                                   // 0x04D8   (0x0008)  
	float                                              SkyLightRecaptureDelay;                                     // 0x04E0   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x04E4   (0x0004)  MISSED
	TArray<class UTextureCube*>                        SkyLightStaticCubemaps;                                     // 0x04E8   (0x0010)  
	bool                                               SkyLightCubemapsTimeDriven;                                 // 0x04F8   (0x0001)  
	unsigned char                                      UnknownData06_6[0x3];                                       // 0x04F9   (0x0003)  MISSED
	float                                              Saturation;                                                 // 0x04FC   (0x0004)  
	float                                              CloudsBloom;                                                // 0x0500   (0x0004)  
	float                                              CloudsFluffy;                                               // 0x0504   (0x0004)  
	float                                              UVHorizonRadius;                                            // 0x0508   (0x0004)  
	float                                              UVHorizonMapping;                                           // 0x050C   (0x0004)  
	float                                              UVScale;                                                    // 0x0510   (0x0004)  
	float                                              FogDirectionalInScattering;                                 // 0x0514   (0x0004)  
	float                                              FogDensity;                                                 // 0x0518   (0x0004)  
	float                                              HorizonTilt;                                                // 0x051C   (0x0004)  
	FLinearColor                                       UVBaseLayerPosition;                                        // 0x0520   (0x0010)  
	FLinearColor                                       UVBaseLayerSize;                                            // 0x0530   (0x0010)  
	FLinearColor                                       UVSecondLayerSize;                                          // 0x0540   (0x0010)  
	FLinearColor                                       UVSecondLayerPosition;                                      // 0x0550   (0x0010)  
	class UTexture*                                    CloudsLayer1;                                               // 0x0560   (0x0008)  
	class UTexture*                                    CloudsLayer2;                                               // 0x0568   (0x0008)  
	FVector2D                                          WindForce;                                                  // 0x0570   (0x0008)  
	float                                              SunRadius;                                                  // 0x0578   (0x0004)  
	float                                              SunShine;                                                   // 0x057C   (0x0004)  
	float                                              SunSaturation;                                              // 0x0580   (0x0004)  
	float                                              SunMaxAltitude;                                             // 0x0584   (0x0004)  
	float                                              SunAzimuth;                                                 // 0x0588   (0x0004)  
	float                                              SunVisibleDuration;                                         // 0x058C   (0x0004)  
	bool                                               SunDirectionTimeOfDay;                                      // 0x0590   (0x0001)  
	unsigned char                                      UnknownData07_6[0x3];                                       // 0x0591   (0x0003)  MISSED
	FRotator                                           SunDirection;                                               // 0x0594   (0x000C)  
	float                                              StarsBrightness;                                            // 0x05A0   (0x0004)  
	unsigned char                                      UnknownData08_6[0x4];                                       // 0x05A4   (0x0004)  MISSED
	class UTexture*                                    MoonTexture;                                                // 0x05A8   (0x0008)  
	float                                              MoonBightness;                                              // 0x05B0   (0x0004)  
	float                                              MoonRadius;                                                 // 0x05B4   (0x0004)  
	float                                              MoonClouds;                                                 // 0x05B8   (0x0004)  
	float                                              MoonShine;                                                  // 0x05BC   (0x0004)  
	float                                              MoonRoll;                                                   // 0x05C0   (0x0004)  
	float                                              MoonVisibleDuration;                                        // 0x05C4   (0x0004)  
	bool                                               MoonSyncedToSun;                                            // 0x05C8   (0x0001)  
	unsigned char                                      UnknownData09_6[0x3];                                       // 0x05C9   (0x0003)  MISSED
	FRotator                                           MoonRotation;                                               // 0x05CC   (0x000C)  
	FWeatherData                                       WeatherFrom;                                                // 0x05D8   (0x006C)  
	FWeatherData                                       WeatherTo;                                                  // 0x0644   (0x006C)  
	FRotator                                           MoonChangeSpeed;                                            // 0x06B0   (0x000C)  
	float                                              WorldRotation;                                              // 0x06BC   (0x0004)  
	float                                              WorldRotationSpeed;                                         // 0x06C0   (0x0004)  
	unsigned char                                      UnknownData10_6[0x4];                                       // 0x06C4   (0x0004)  MISSED
	class UTexture*                                    WorldLayerTexture;                                          // 0x06C8   (0x0008)  
	float                                              WorldLayerFog;                                              // 0x06D0   (0x0004)  
	float                                              WorldLayerDepth;                                            // 0x06D4   (0x0004)  
	FLinearColor                                       WorldLayerColor;                                            // 0x06D8   (0x0010)  
	float                                              SkyLightRecaptureTime;                                      // 0x06E8   (0x0004)  
	float                                              TimeOfDayFrom;                                              // 0x06EC   (0x0004)  
	float                                              TimeOfDayTo;                                                // 0x06F0   (0x0004)  
	float                                              TimeOfDayTransitionDuration;                                // 0x06F4   (0x0004)  
	TEnumAsByte<EEasingFunc>                           TimeOfDayTransition;                                        // 0x06F8   (0x0001)  
	unsigned char                                      UnknownData11_6[0x3];                                       // 0x06F9   (0x0003)  MISSED
	float                                              TimeOfDayInterp;                                            // 0x06FC   (0x0004)  
	class UMaterialInstanceConstant*                   GroundShadowMaterial;                                       // 0x0700   (0x0008)  
	class UMaterialInstanceDynamic*                    GroundShadowMaterialInst;                                   // 0x0708   (0x0008)  
	float                                              GroundShadowScale;                                          // 0x0710   (0x0004)  
	float                                              GroundShadowSoft;                                           // 0x0714   (0x0004)  
	int32_t                                            Version;                                                    // 0x0718   (0x0004)  
	FTimeOfDayData                                     TimeOfDayDataFrom;                                          // 0x071C   (0x00A4)  
	FTimeOfDayData                                     TimeOfDayDataTo;                                            // 0x07C0   (0x00A4)  
	float                                              TimeOfDayPresetInterp;                                      // 0x0864   (0x0004)  
	class UClass*                                      TimeOfDayPresetTarget;                                      // 0x0868   (0x0008)  
	float                                              SkyLightIntensity;                                          // 0x0870   (0x0004)  
	float                                              SkyLightLightning;                                          // 0x0874   (0x0004)  
	bool                                               UseWorldSpaceRotation;                                      // 0x0878   (0x0001)  
	unsigned char                                      UnknownData12_6[0x3];                                       // 0x0879   (0x0003)  MISSED
	int32_t                                            DaysPassedBy;                                               // 0x087C   (0x0004)  
	SDK_UNDEFINED(16,959) /* FMulticastInlineDelegate */ __um(OnWeatherPresetChanged);                             // 0x0880   (0x0010)  
	SDK_UNDEFINED(16,960) /* FMulticastInlineDelegate */ __um(OnTimeOfDayPresetChanged);                           // 0x0890   (0x0010)  
	SDK_UNDEFINED(16,961) /* FMulticastInlineDelegate */ __um(OnHourPassedBy);                                     // 0x08A0   (0x0010)  
	SDK_UNDEFINED(16,962) /* FMulticastInlineDelegate */ __um(OnDayPassedBy);                                      // 0x08B0   (0x0010)  
	float                                              MoonLightLightning;                                         // 0x08C0   (0x0004)  
	float                                              ColorScale;                                                 // 0x08C4   (0x0004)  
	int32_t                                            EngineVersion;                                              // 0x08C8   (0x0004)  
	float                                              Curr_Time_Of_Day;                                           // 0x08CC   (0x0004)  
	float                                              BlueSaturation;                                             // 0x08D0   (0x0004)  
	float                                              SkyShineScale;                                              // 0x08D4   (0x0004)  
	float                                              Total_TODTime;                                              // 0x08D8   (0x0004)  
	bool                                               CloudsMoveWithTOD;                                          // 0x08DC   (0x0001)  
	unsigned char                                      UnknownData13_6[0x3];                                       // 0x08DD   (0x0003)  MISSED
	float                                              CloudsTODTimeScale;                                         // 0x08E0   (0x0004)  
	float                                              Layer1Phase;                                                // 0x08E4   (0x0004)  
	float                                              Layer2Phase;                                                // 0x08E8   (0x0004)  
	float                                              MoonFade;                                                   // 0x08EC   (0x0004)  
	float                                              CloudsBlendScale;                                           // 0x08F0   (0x0004)  
	float                                              SunHardness;                                                // 0x08F4   (0x0004)  
	float                                              SkyLowerFalloff;                                            // 0x08F8   (0x0004)  
	float                                              EclipseLevel;                                               // 0x08FC   (0x0004)  
	float                                              EclipseOffset;                                              // 0x0900   (0x0004)  
	float                                              EclipseAngle;                                               // 0x0904   (0x0004)  
	float                                              EclipseHardness;                                            // 0x0908   (0x0004)  
	bool                                               bUseNightMtl;                                               // 0x090C   (0x0001)  
	unsigned char                                      UnknownData14_6[0x3];                                       // 0x090D   (0x0003)  MISSED
	float                                              UseFlowmapSkybox;                                           // 0x0910   (0x0004)  
	// void ExecuteUbergraph_BP_SkyDome(int32_t EntryPoint);                                                                    // [0x25a7960] Final                
	// void OnDayPassedBy__DelegateSignature(int32_t Day);                                                                      // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// void OnHourPassedBy__DelegateSignature(int32_t Hour);                                                                    // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// void OnTimeOfDayPresetChanged__DelegateSignature(class UClass* Preset, float TransitionDuraion);                         // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// void OnWeatherPresetChanged__DelegateSignature(class UClass* Preset, float TransitionDuration);                          // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
};
#pragma pack(pop)

/// Struct /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/SCloudParameters.SCloudParameters
/// Size: 0x00C8 (200 bytes) (0x000000 - 0x0000C8) align 8 pad: 0x0000
struct FSCloudParameters
{ 
	class UTexture*                                    Mask_8_F15855E04FF4BB57CD47D4BD2E0389B4;                    // 0x0000   (0x0008)  
	bool                                               YesUV1NoUV2_24_9EAB91FF46BBE03FC4916C8044566733;            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            UVTiling_27_CA2827D746C96BC6C5BD3BAF6F84F90D;               // 0x000C   (0x0004)  
	float                                              CloudAngle_11_A4A0E29A4273FD2FC96B80BF46207982;             // 0x0010   (0x0004)  
	float                                              CloudSpeed_66_BEAF97D341EED8F6BCA62993218B6EBF;             // 0x0014   (0x0004)  
	bool                                               CloudRotation_74_073D936140252C61167ABABF2EB420F3;          // 0x0018   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0019   (0x0007)  MISSED
	class UTexture*                                    NoiseMap_81_111842B746A717F706DAFE9282DB74E0;               // 0x0020   (0x0008)  
	float                                              NoiseSpeed_77_F8E4B503421091B3D69660ADDD820B7A;             // 0x0028   (0x0004)  
	float                                              NoiseStrength_84_2085AC85465A4E4C896A7A8A944AE088;          // 0x002C   (0x0004)  
	float                                              NoiseTilling_86_250028C642C8358B5366C7B001F1845B;           // 0x0030   (0x0004)  
	bool                                               SDF__98_FF0615434C8BB1E4D024B1890722FDE0;                   // 0x0034   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0035   (0x0003)  MISSED
	FKuroCurveFloat                                    SDFTime_101_C436D6E344106E77F486C29C910E4148;               // 0x0038   (0x0090)  
};

/// Struct /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/SCloudCover.SCloudCover
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 pad: 0x0000
struct FSCloudCover
{ 
	class UMaterialInterface*                          CoverMaterial_5_2342ED874AB1269370653CBA828D8872;           // 0x0000   (0x0008)  
};

/// Struct /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/SPOICloudParameters.SPOICloudParameters
/// Size: 0x0041 (65 bytes) (0x000000 - 0x000041) align 8 pad: 0x0001
#pragma pack(push, 0x1)
struct FSPOICloudParameters
{ 
	class UTexture*                                    Mask_8_F15855E04FF4BB57CD47D4BD2E0389B4;                    // 0x0000   (0x0008)  
	bool                                               YesUV1NoUV2_24_9EAB91FF46BBE03FC4916C8044566733;            // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	int32_t                                            UVTiling_27_CA2827D746C96BC6C5BD3BAF6F84F90D;               // 0x000C   (0x0004)  
	float                                              CloudAngle_11_A4A0E29A4273FD2FC96B80BF46207982;             // 0x0010   (0x0004)  
	float                                              CloudSpeed_66_BEAF97D341EED8F6BCA62993218B6EBF;             // 0x0014   (0x0004)  
	bool                                               CloudRotation_74_073D936140252C61167ABABF2EB420F3;          // 0x0018   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0019   (0x0007)  MISSED
	class UTexture*                                    NoiseMap_81_111842B746A717F706DAFE9282DB74E0;               // 0x0020   (0x0008)  
	float                                              NoiseSpeed_77_F8E4B503421091B3D69660ADDD820B7A;             // 0x0028   (0x0004)  
	float                                              NoiseStrength_84_2085AC85465A4E4C896A7A8A944AE088;          // 0x002C   (0x0004)  
	float                                              NoiseTilling_86_250028C642C8358B5366C7B001F1845B;           // 0x0030   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0034   (0x0004)  MISSED
	class UStaticMesh*                                 Mesh_104_179F0F1948B1CDAC0E6F08945374623E;                  // 0x0038   (0x0008)  
	bool                                               SDF__106_65FB5C8047611BF527CC84B5E47F667A;                  // 0x0040   (0x0001)  
};
#pragma pack(pop)

/// Struct /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/SMountainParameters.SMountainParameters
/// Size: 0x0001 (1 bytes) (0x000000 - 0x000001) align 1 pad: 0x0000
struct FSMountainParameters
{ 
	bool                                               HasMountain_26_EBAAF41A42DC7A7B2B9A20AF09B060D5;            // 0x0000   (0x0001)  
};

/// Struct /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/SAnomaliesParameters.SAnomaliesParameters
/// Size: 0x0038 (56 bytes) (0x000000 - 0x000038) align 8 pad: 0x0000
struct FSAnomaliesParameters
{ 
	class UTexture*                                    Color_7_EBAAF41A42DC7A7B2B9A20AF09B060D5;                   // 0x0000   (0x0008)  
	float                                              CloudAngle_11_A4A0E29A4273FD2FC96B80BF46207982;             // 0x0008   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x000C   (0x0004)  MISSED
	class UTexture*                                    NoiseMap_67_8F8087DD4B77E14B5CAC989129EC6903;               // 0x0010   (0x0008)  
	float                                              NoiseSpeed_70_E70E129C4258256659962AB15F6407EF;             // 0x0018   (0x0004)  
	float                                              NoiseStrength_72_2F0856124FA4AF6F618586ACF0DBF1D3;          // 0x001C   (0x0004)  
	float                                              NoiseTilling_74_759C116A41650EECA98634A1CABEC395;           // 0x0020   (0x0004)  
	float                                              luminance_59_6A5B888449289A5F956608B60446197A;              // 0x0024   (0x0004)  
	bool                                               Rotation_61_A37EFA55431B77B53AA73B90574A7DD8;               // 0x0028   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0029   (0x0007)  MISSED
	class UStaticMesh*                                 Mesh_64_5A3F88FA4600004653ED5D959E1C58FA;                   // 0x0030   (0x0008)  
};

/// Class /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/PD_CloudPrefab.PD_CloudPrefab_C
/// Size: 0x0160 (352 bytes) (0x000038 - 0x000198) align 8 pad: 0x0000
class UPD_CloudPrefab_C : public UPrimaryDataAsset
{ 
public:
	class UClass*                                      PrefebBP;                                                   // 0x0038   (0x0008)  
	FSCloudParameters                                  CloudTop;                                                   // 0x0040   (0x00C8)  
	FSCloudCover                                       CloudCover;                                                 // 0x0108   (0x0008)  
	FSPOICloudParameters                               CloudBigShape;                                              // 0x0110   (0x0048)  
	FSMountainParameters                               Mountain;                                                   // 0x0158   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0159   (0x0007)  MISSED
	FSAnomaliesParameters                              CloudAnomalies;                                             // 0x0160   (0x0038)  
};

/// Class /Game/Aki/Render/RuntimeBP/GI/NewCloud/BP/BP_CloudPrefab.BP_CloudPrefab_C
/// Size: 0x00FC (252 bytes) (0x0002B8 - 0x0003B4) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class ABP_CloudPrefab_C : public AKuroEditorTickActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  
	class UStaticMeshComponent*                        Mountain;                                                   // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        Cloud_BigShape;                                             // 0x02C8   (0x0008)  
	class UStaticMeshComponent*                        Cloud_Cover;                                                // 0x02D0   (0x0008)  
	class UStaticMeshComponent*                        Cloud_Top;                                                  // 0x02D8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02E0   (0x0008)  
	class UTexture*                                    CloudColorMap;                                              // 0x02E8   (0x0008)  
	class UTexture*                                    CloudMaskMap;                                               // 0x02F0   (0x0008)  
	float                                              ChangeSpeed;                                                // 0x02F8   (0x0004)  
	float                                              CloudRotateSpeed;                                           // 0x02FC   (0x0004)  
	float                                              Time;                                                       // 0x0300   (0x0004)  
	bool                                               change;                                                     // 0x0304   (0x0001)  
	bool                                               Stop;                                                       // 0x0305   (0x0001)  
	bool                                               Farward;                                                    // 0x0306   (0x0001)  
	unsigned char                                      UnknownData00_6[0x1];                                       // 0x0307   (0x0001)  MISSED
	TArray<class UMaterialInstanceDynamic*>            DMI;                                                        // 0x0308   (0x0010)  
	float                                              Delta_Seconds;                                              // 0x0318   (0x0004)  
	bool                                               TimerInit;                                                  // 0x031C   (0x0001)  
	bool                                               ColoredCloud_;                                              // 0x031D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x031E   (0x0002)  MISSED
	float                                              CloudSaturation;                                            // 0x0320   (0x0004)  
	float                                              C;                                                          // 0x0324   (0x0004)  
	class UMaterialInstanceDynamic*                    DMI_Top;                                                    // 0x0328   (0x0008)  
	class UMaterialInstanceDynamic*                    DMI_Cover;                                                  // 0x0330   (0x0008)  
	class UMaterialInstanceDynamic*                    DMI_Anomalies;                                              // 0x0338   (0x0008)  
	class UMaterialInstanceDynamic*                    DMI_BigShape;                                               // 0x0340   (0x0008)  
	class UMaterialInstanceDynamic*                    DMI_Mountain;                                               // 0x0348   (0x0008)  
	float                                              CloudInitialZAngle;                                         // 0x0350   (0x0004)  
	bool                                               UpdatePerFourFrame01;                                       // 0x0354   (0x0001)  
	bool                                               UpdatePerFourFrame02;                                       // 0x0355   (0x0001)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x0356   (0x0002)  MISSED
	class UPD_CloudPrefab_C*                           CloudPrefeb;                                                // 0x0358   (0x0008)  
	bool                                               SetCoverMaterial;                                           // 0x0360   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0361   (0x0007)  MISSED
	class UMaterialInterface*                          Cloud_Cover_Material;                                       // 0x0368   (0x0008)  
	int32_t                                            TransSortNumber;                                            // 0x0370   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x0374   (0x0004)  MISSED
	TArray<class UStaticMeshComponent*>                MeshArray;                                                  // 0x0378   (0x0010)  
	TArray<class UMaterialInstanceDynamic*>            DMIArray;                                                   // 0x0388   (0x0010)  
	float                                              Random;                                                     // 0x0398   (0x0004)  
	unsigned char                                      UnknownData05_6[0x4];                                       // 0x039C   (0x0004)  MISSED
	TArray<int32_t>                                    Trans;                                                      // 0x03A0   (0x0010)  
	float                                              SDFTime;                                                    // 0x03B0   (0x0004)  
	// void SinglePOICloudParametersInitial(class UMaterialInstanceDynamic* DMI, class UStaticMeshComponent* Mesh, FSPOICloudParameters CloudStructParameter, int32_t TransSortNumber); // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void SetGIParams(FSGIData GIParams);                                                                                     // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void SingleBuildingParametersInitial(class UMaterialInstanceDynamic* DMI, class UStaticMeshComponent* Mesh, FSAnomaliesParameters CloudStructParameter, int32_t TransSortNumber); // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void UpdatePerFourFrame();                                                                                               // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void CreateDMI(class UStaticMeshComponent* Mesh, class UMaterialInstanceDynamic*& DMI);                                  // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void SingleCloudParametersInitial(class UMaterialInstanceDynamic* DMI, class UStaticMeshComponent* Mesh, FSCloudParameters CloudStructParameter, int32_t TransSortNumber); // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void CloudInitial();                                                                                                     // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void Timer(bool Forward, float DeltaTime, float Speed, float& Time, bool& Stop);                                         // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void AddCloudRotation();                                                                                                 // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void Hidden();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Active();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void UserConstructionScript();                                                                                           // [0x25a7960] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void EditorTick(float DeltaSeconds);                                                                                     // [0x25a7960] Event|Public|BlueprintEvent 
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x25a7960] Event|Public|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
	// void ExecuteUbergraph_BP_CloudPrefab(int32_t EntryPoint);                                                                // [0x25a7960] Final|HasDefaults    
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/GI/NewCloud/Prefab/BP_Cloud_None.BP_Cloud_None_C
/// Size: 0x000C (12 bytes) (0x0003B4 - 0x0003C0) align 8 pad: 0x0000
class ABP_Cloud_None_C : public ABP_CloudPrefab_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x4];                                       // 0x03B4   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03B8   (0x0008)  
	// void Hidden();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Active();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x25a7960] Event|Public|BlueprintEvent 
	// void EditorTick(float DeltaSeconds);                                                                                     // [0x25a7960] Event|Public|BlueprintEvent 
	// void ExecuteUbergraph_BP_Cloud_None(int32_t EntryPoint);                                                                 // [0x25a7960] Final                
};

/// Class /Game/Aki/Render/RuntimeBP/Scene/LensFlare/PDA_ModelLensFlareConfig.PDA_ModelLensFlareConfig_C
/// Size: 0x0000 (0 bytes) (0x000068 - 0x000068) align 8 pad: 0x0000
class UPDA_ModelLensFlareConfig_C : public USunLensFlareConfig
{ 
public:
};

/// Class /Game/Aki/HotPatch/TsHotFixActionHandle.TsHotFixActionHandle_C
/// Size: 0x0070 (112 bytes) (0x000030 - 0x0000A0) align 8 pad: 0x0000
class UTsHotFixActionHandle_C : public UObject
{ 
public:
	FName                                              FuncName;                                                   // 0x0030   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED
	class UObject*                                     _v;                                                         // 0x0040   (0x0008)  
	FString                                            ActionName;                                                 // 0x0048   (0x0010)  
	bool                                               bPress;                                                     // 0x0058   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0059   (0x0007)  MISSED
	SDK_UNDEFINED(16,963) /* FMulticastInlineDelegate */ __um(OnPressActionCallback);                              // 0x0060   (0x0010)  
	TEnumAsByte<ETouchIndex>                           TouchIndex;                                                 // 0x0070   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0071   (0x0003)  MISSED
	FVector                                            TouchPosition;                                              // 0x0074   (0x000C)  
	SDK_UNDEFINED(16,964) /* FMulticastInlineDelegate */ __um(OnTouchActionCallback);                              // 0x0080   (0x0010)  
	SDK_UNDEFINED(16,965) /* FMulticastInlineDelegate */ __um(OnTouchMovedActionCallback);                         // 0x0090   (0x0010)  
	// void AddTouchMoveBinding(class ABasePlayerController* Controller);                                                       // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void OnTouchMoveAction(TEnumAsByte<ETouchIndex> TouchIndex, FVector Position);                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ClearActionBinding(class ABasePlayerController* Controller);                                                        // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void OnTouchReleaseAction(TEnumAsByte<ETouchIndex> TouchIndex, FVector Position);                                        // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void OnTouchPressAction(TEnumAsByte<ETouchIndex> TouchIndex, FVector Position);                                          // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void AddTouchReleaseBinding(class ABasePlayerController* Controller);                                                    // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void AddTouchPressBinding(class ABasePlayerController* Controller);                                                      // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void AddReleaseBinding(FString ActionName, class ABasePlayerController* Controller);                                     // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void AddPressBinding(FString ActionName, class ABasePlayerController* Controller);                                       // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void OnReleaseAction();                                                                                                  // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void OnPressAction();                                                                                                    // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void OnTouchMovedActionCallback__DelegateSignature();                                                                    // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// void OnTouchActionCallback__DelegateSignature();                                                                         // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// void OnPressActionCallback__DelegateSignature();                                                                         // [0x25a7960] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/TypeScript/Game/Ui/LguiEventSystem/TsLguiEventSystemActor.TsLguiEventSystemActor_C
/// Size: 0x0021 (33 bytes) (0x0002B0 - 0x0002D1) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class ATsLguiEventSystemActor_C : public ALGUIEventSystemActor
{ 
public:
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02B0   (0x0008)  
	class ULGUI_TouchInputModule*                      TouchInputModule;                                           // 0x02B8   (0x0008)  
	class ULGUI_StandaloneInputModule*                 StandaloneInputModule;                                      // 0x02C0   (0x0008)  
	class ULGUI_PointerInputModule*                    currentInputModule;                                         // 0x02C8   (0x0008)  
	bool                                               NavigationEnable;                                           // 0x02D0   (0x0001)  
	// bool IsPointerEventDataLineTrace(class ULGUIPointerEventData* pointerEventData);                                         // [0x13db470] Native|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// class ULGUIPointerEventData* GetPointerEventData(float PointerId, bool CreateIfNotExist);                                // [0x13db470] Native|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// class UUIItem* GetNowHitComponent();                                                                                     // [0x13db470] Native|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void InputTouchMove(int32_t TouchID, FVector TouchPointPosition);                                                        // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void InputTouchTrigger(bool TouchPress, int32_t TouchID, FVector TouchPointPosition);                                    // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void InputScroll(float AxisValue);                                                                                       // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void InputTriggerForNavigation(bool triggerPress);                                                                       // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void InputNavigation(ELGUINavigationDirection Direction, bool pressOrRelease, bool forceNavigation);                     // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void InputTrigger(bool triggerPress, EMouseButtonType mouseButtonType);                                                  // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Character/Common/Blueprint/Component/TsCharacterDebugComponent.TsCharacterDebugComponent_C
/// Size: 0x0054 (84 bytes) (0x0000C0 - 0x000114) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UTsCharacterDebugComponent_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00C0   (0x0008)  
	float                                              MaxFixSpeed;                                                // 0x00C8   (0x0004)  
	bool                                               StaticInit;                                                 // 0x00CC   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x00CD   (0x0003)  MISSED
	int32_t                                            StaticAttrId;                                               // 0x00D0   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x00D4   (0x0004)  MISSED
	FString                                            StaticAiId;                                                 // 0x00D8   (0x0010)  
	float                                              TestRiseSpeed;                                              // 0x00E8   (0x0004)  
	TEnumAsByte<EDrawDebugTrace>                       EnterClimbTrace;                                            // 0x00EC   (0x0001)  
	TEnumAsByte<EDrawDebugTrace>                       UpArriveClimbTrace;                                         // 0x00ED   (0x0001)  
	TEnumAsByte<EDrawDebugTrace>                       VaultClimbTrace;                                            // 0x00EE   (0x0001)  
	TEnumAsByte<EDrawDebugTrace>                       ClimbingTrace;                                              // 0x00EF   (0x0001)  
	class UBehaviorTree*                               BehaviorTree;                                               // 0x00F0   (0x0008)  
	class AActor*                                      PatrolSpline;                                               // 0x00F8   (0x0008)  
	int32_t                                            DebugEntityId;                                              // 0x0100   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0104   (0x0004)  MISSED
	int64_t                                            DebugCreatureId;                                            // 0x0108   (0x0008)  
	int32_t                                            DebugInteractCount;                                         // 0x0110   (0x0004)  
	// void AiDebugDraw();                                                                                                      // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void SetMovementDebug(bool newDebug);                                                                                    // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void DrawErrorNavigationPaths();                                                                                         // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void DrawDebugPatrolPoints();                                                                                            // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void SetDebugRiseEnable(bool Enable);                                                                                    // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ChangeClimbingTrace();                                                                                              // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ChangeUpArriveClimbTrace();                                                                                         // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ChangeVaultClimbTrace();                                                                                            // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ChangeEnterClimbTrace();                                                                                            // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ChangeNoTop();                                                                                                      // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void DebugDrawActivateArea();                                                                                            // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ActivateDebugSpeed(bool Activate);                                                                                  // [0x13db470] Native|Public|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x13db470] Native|Event|Public|BlueprintCallable|BlueprintEvent 
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x13db470] Native|Event|Public|BlueprintCallable|BlueprintEvent 
	// void ExecuteUbergraph_TsCharacterDebugComponent(int32_t EntryPoint);                                                     // [0x13db470] Final|Native|Public|BlueprintCallable|BlueprintEvent 
};
#pragma pack(pop)

/// Class /Game/Aki/Core/Fight/BulletLogicType.BulletLogicType_C
/// Size: 0x0052 (82 bytes) (0x000038 - 0x00008A) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class UBulletLogicType_C : public UPrimaryDataAsset
{ 
public:
	bool                                               _kpe_N0;                                                    // 0x0038   (0x0001)  
	bool                                               _f_T_S_N__;                                                 // 0x0039   (0x0001)  
	bool                                               _f_T_S_N;                                                   // 0x003A   (0x0001)  
	bool                                               _f_T_S_N0;                                                  // 0x003B   (0x0001)  
	FName                                              P_9__x;                                                     // 0x003C   (0x000C)  
	bool                                               P_9__x_d;                                                   // 0x0048   (0x0001)  
	bool                                               P_9__x_d1;                                                  // 0x0049   (0x0001)  
	TEnumAsByte<EBulletType>                           P_9_;                                                       // 0x004A   (0x0001)  
	TEnumAsByte<EBulletHitDirectionType>               P_9__S_Q__;                                                 // 0x004B   (0x0001)  
	int32_t                                            _9__S;                                                      // 0x004C   (0x0004)  
	bool                                               null;                                                       // 0x0050   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0051   (0x0007)  MISSED
	FGameplayTagContainer                              ____;                                                       // 0x0058   (0x0020)  
	FString                                            _S_x_d;                                                     // 0x0078   (0x0010)  
	bool                                               __eu;                                                       // 0x0088   (0x0001)  
	bool                                               _Q_Q_;                                                      // 0x0089   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/Character/MaterialController/PD_CharacterControllerDataGroup.PD_CharacterControllerDataGroup_C
/// Size: 0x0052 (82 bytes) (0x000038 - 0x00008A) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class UPD_CharacterControllerDataGroup_C : public UPrimaryDataAsset
{ 
public:
	SDK_UNDEFINED(80,966) /* TMap<UPD_CharacterControllerData_C*, float> */ __um(DataMap);                         // 0x0038   (0x0050)  
	bool                                               IgnoreTimeDilation;                                         // 0x0088   (0x0001)  
	bool                                               CleanOriginEffect;                                          // 0x0089   (0x0001)  
};
#pragma pack(pop)

/// Struct /Game/Aki/Data/UiNavigation/Struct/SNavigationMode.SNavigationMode
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FSNavigationMode
{ 
	EUISelectableNavigationMode                        TopMode_2_2A60C94C4E76BE5EC2CA1D9876EEA5BD;                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	class AActor*                                      TopActor_11_F014E9604A3BBA1A18D8F9B4878908F3;               // 0x0008   (0x0008)  
	EUISelectableNavigationMode                        DownMode_12_9079FFBB4814018672326CA3579523AC;               // 0x0010   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0011   (0x0007)  MISSED
	class AActor*                                      DownActor_20_BDC3E88F4E320FECAB94BC87ECB5877B;              // 0x0018   (0x0008)  
	EUISelectableNavigationMode                        LeftMode_14_7CC7881F4F8F479A7574C5BAE4DAB485;               // 0x0020   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0021   (0x0007)  MISSED
	class AActor*                                      LeftActor_19_F6DEAD7F49C30ADE27054AA68DCD1D3B;              // 0x0028   (0x0008)  
	EUISelectableNavigationMode                        RightMode_16_960EF9BB4D316370DCEAB3A0981EF05F;              // 0x0030   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0031   (0x0007)  MISSED
	class AActor*                                      RightActor_18_33C083EF4D84464594266BBA39C41413;             // 0x0038   (0x0008)  
};

/// Struct /Game/Aki/Data/UiNavigation/Struct/SNavigationCursor.SNavigationCursor
/// Size: 0x0009 (9 bytes) (0x000000 - 0x000009) align 4 pad: 0x0001
#pragma pack(push, 0x1)
struct FSNavigationCursor
{ 
	TEnumAsByte<ECursorOffsetType>                     OffsetType_7_E9376C9F46DC5DE301F4CFBC50EF945A;              // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0001   (0x0003)  MISSED
	int32_t                                            BoundOffset_9_CB362485407CBDA2C3E910AC8F4583E4;             // 0x0004   (0x0004)  
	bool                                               Switch_12_48B8E4EB4D500E99B2A67E8110F9A938;                 // 0x0008   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/Module/UiNavigation/New/TsUiNavigationBehaviorListener.TsUiNavigationBehaviorListener_C
/// Size: 0x0168 (360 bytes) (0x0000F0 - 0x000258) align 8 pad: 0x0000
class UTsUiNavigationBehaviorListener_C : public UUINavigationBehaviour
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00F0   (0x0008)  
	FString                                            GroupName;                                                  // 0x00F8   (0x0010)  
	class AActor*                                      LayoutActor;                                                // 0x0108   (0x0008)  
	TArray<FString>                                    TagArray;                                                   // 0x0110   (0x0010)  
	TArray<int32_t>                                    ShieldHotKeyIndexArray;                                     // 0x0120   (0x0010)  
	class AActor*                                      ScrollViewActor;                                            // 0x0130   (0x0008)  
	SDK_UNDEFINED(80,967) /* TMap<TEnumAsByte<EHotKeyNameStateType>, FString> */ __um(HotKeyTipsTextIdMap);        // 0x0138   (0x0050)  
	class AActor*                                      InsideGroupActor;                                           // 0x0188   (0x0008)  
	FVector2D                                          ClickPivot;                                                 // 0x0190   (0x0008)  
	FSNavigationMode                                   NavigationMode;                                             // 0x0198   (0x0040)  
	FSNavigationCursor                                 Cursor;                                                     // 0x01D8   (0x000C)  
	float                                              ScrollbarIndex;                                             // 0x01E4   (0x0004)  
	FString                                            InteractiveTag;                                             // 0x01E8   (0x0010)  
	FString                                            DynamicTag;                                                 // 0x01F8   (0x0010)  
	SDK_UNDEFINED(80,968) /* TMap<FString, AActor*> */ __um(InsideActorMap);                                       // 0x0208   (0x0050)  
	// bool OnCheckLoopScrollChangeNavigationBP();                                                                              // [0x13db470] Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// bool OnCheckCanSetNavigationBP();                                                                                        // [0x13db470] Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void AwakeBP();                                                                                                          // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnDestroyBP();                                                                                                      // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnNotifyInteractiveBP();                                                                                            // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnNotifyNotInteractiveBP();                                                                                         // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnNotifyNavigationEnterBP(class ULGUIPointerEventData* eventData);                                                  // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnNotifyNavigationSelectBP(class ULGUIPointerEventData* eventData);                                                 // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void StartBP();                                                                                                          // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnEnableBP();                                                                                                       // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void OnDisableBP();                                                                                                      // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void ExecuteUbergraph_TsUiNavigationBehaviorListener(int32_t EntryPoint);                                                // [0x13db470] Final|Native|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/Data/Camera/BP_CameraShakeAndForceFeedback.BP_CameraShakeAndForceFeedback_C
/// Size: 0x0008 (8 bytes) (0x0001B0 - 0x0001B8) align 16 pad: 0x0008
#pragma pack(push, 0x1)
class UBP_CameraShakeAndForceFeedback_C : public UKuroCameraShake
{ 
public:
	class UKuroForceFeedbackEffect*                    ForceFeedbackEffect;                                        // 0x01B0   (0x0008)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/Effect/TsEffectFunctionLibrary.TsEffectFunctionLibrary_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UTsEffectFunctionLibrary_C : public UBlueprintFunctionLibrary
{ 
public:
	// void SetEffectIgnoreVisibilityOptimize(int32_t Handle, bool ignore, class UObject* __WorldContext);                      // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
	// int32_t SpawnEffectUI(class UObject* WorldContext, class UObject* callObject, FString Path, FTransform Transform, FString reason, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void SetEffectHiddenInGame(int32_t handle1, bool value1, class UObject* __WorldContext);                                 // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
	// void AttachEffectActorToActor(int32_t Handle, class AActor* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
	// void SetEffectParameterNiagara(int32_t Handle, TArray<FSEffectFloatParameter>& userParameterFloat, TArray<FSEffectColorParameter>& userParameterColor, TArray<FSEffectVectorParameter>& userParameterVector, TArray<FSEffectFloatParameter>& materialParameterFloat, TArray<FSEffectColorParameter>& materialParameterColor, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void SetEffectActorRelativeLocation(int32_t Handle, FVector NewRelativeLocation, bool bSweep, bool bTeleport, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
	// void AttachEffectActorToComponent(int32_t Handle, class USceneComponent* Parent, FName SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
	// bool EffectHandleIsValid(int32_t Handle, class UObject* __WorldContext);                                                 // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// bool StopEffect(int32_t Handle, class UObject* callObject, FString reason, bool Immediately, bool DestroyActor, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// int32_t SpawnEffectWithActor(class UObject* WorldContext, class UObject* callObject, class AActor* EffectActor, FString Path, FString reason, TEnumAsByte<EEffectPlay> PlayType, TEnumAsByte<EEffectType> EffectType, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// int32_t SpawnEffect(class UObject* WorldContext, class UObject* callObject, FString Path, FTransform Transform, FString reason, TEnumAsByte<EEffectPlay> PlayType, class UObject* __WorldContext); // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// class AActor* GetEffectActor(int32_t Handle, class UObject* __WorldContext);                                             // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// bool PlayEffect(int32_t Handle, class UObject* callObject, FString reason, class UObject* __WorldContext);               // [0x13db470] Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void EditorTickHandle(int32_t Handle, float Delta, class UObject* __WorldContext);                                       // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
	// void InitializeWithPreview(bool Refresh, class UObject* __WorldContext);                                                 // [0x13db470] Native|Static|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/Render/RuntimeBP/Character/Components/PD_MaterialDebug.PD_MaterialDebug_C
/// Size: 0x0140 (320 bytes) (0x000038 - 0x000178) align 8 pad: 0x0000
class UPD_MaterialDebug_C : public UPrimaryDataAsset
{ 
public:
	SDK_UNDEFINED(80,969) /* TMap<int32_t, FString> */ __um(MaterialControllerList);                               // 0x0038   (0x0050)  
	SDK_UNDEFINED(80,970) /* TMap<FString, FSMaterialDebugInfo> */ __um(Body);                                     // 0x0088   (0x0050)  
	SDK_UNDEFINED(80,971) /* TMap<FString, FSMaterialDebugInfo> */ __um(Weapon);                                   // 0x00D8   (0x0050)  
	SDK_UNDEFINED(80,972) /* TMap<FString, FSMaterialDebugInfo> */ __um(Hulu);                                     // 0x0128   (0x0050)  
};

/// Class /Game/Aki/Render/RuntimeBP/Effect/BPI_EffectInterface.BPI_EffectInterface_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UBPI_EffectInterface_C : public UInterface
{ 
public:
	// void RemoveHandle();                                                                                                     // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void SetHandle(int32_t Handle);                                                                                          // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void GetHandle(int32_t& Handle);                                                                                         // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/TypeScript/Game/Render/Effect/Data/EffectModelGroup.EffectModelGroup_C
/// Size: 0x0548 (1352 bytes) (0x000058 - 0x0005A0) align 8 pad: 0x0000
class UEffectModelGroup_C : public UEffectModelBase
{ 
public:
	SDK_UNDEFINED(80,973) /* TMap<UEffectModelBase*, float> */ __um(EffectData);                                   // 0x0058   (0x0050)  
	FKuroCurveVector                                   Location;                                                   // 0x00A8   (0x01A8)  
	FKuroCurveVector                                   Rotation;                                                   // 0x0250   (0x01A8)  
	FKuroCurveVector                                   Scale;                                                      // 0x03F8   (0x01A8)  
};

/// Class /Game/Aki/Core/Fight/BulletCampType.BulletCampType_C
/// Size: 0x0004 (4 bytes) (0x000038 - 0x00003C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UBulletCampType_C : public UPrimaryDataAsset
{ 
public:
	int32_t                                            _5_;                                                        // 0x0038   (0x0004)  
};
#pragma pack(pop)

/// Struct /Game/Aki/Render/RuntimeBP/Interaction/SKuroInteractionLimbsConfig.SKuroInteractionLimbsConfig
/// Size: 0x0040 (64 bytes) (0x000000 - 0x000040) align 8 pad: 0x0000
struct FSKuroInteractionLimbsConfig
{ 
	FName                                              _c_i_TW__;                                                  // 0x0000   (0x000C)  
	FVector                                            _v__MOn__;                                                  // 0x000C   (0x000C)  
	float                                              JS___;                                                      // 0x0018   (0x0004)  
	float                                              JS___0;                                                     // 0x001C   (0x0004)  
	FSoftObjectPath                                    _N_NM_n__;                                                  // 0x0020   (0x0020)  
};

/// Struct /Game/Aki/Render/RuntimeBP/Effect/WaterInteraction/SWaterEffectObject.SWaterEffectObject
/// Size: 0x00AC (172 bytes) (0x000000 - 0x0000AC) align 16 pad: 0x000C
#pragma pack(push, 0x1)
struct FSWaterEffectObject
{ 
	float                                              Radius_22_17F3D6B6442F4CA6C4EDAF9D624C7497;                 // 0x0000   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x0004   (0x000C)  MISSED
	FTransform                                         Transform_23_6C11AE9A4E3937F99FA86A8FB8A8A129;              // 0x0010   (0x0030)  
	SDK_UNDEFINED(48,974) /* TWeakObjectPtr<UEffectModelBase*> */ __um(Effect_57_4E5CF9D8490C25797E8CC0BFCEE5D983); // 0x0040   (0x0030)  
	bool                                               TriggerOnce_31_5812DF7046286E7C0528CBA4CD21A810;            // 0x0070   (0x0001)  
	bool                                               EnableSurfaceEffect_42_51D905A341688290E799958E968DF25F;    // 0x0071   (0x0001)  
	unsigned char                                      UnknownData01_6[0x6];                                       // 0x0072   (0x0006)  MISSED
	SDK_UNDEFINED(48,975) /* TWeakObjectPtr<UEffectModelBase*> */ __um(WaterSurfaceEffect_58_9B115E3B49603AA9550967AA55544EAA); // 0x0078   (0x0030)  
	float                                              TimeAfterSurfaceEffectStop_56_05E050574AF588AEF44FDC80738DD506; // 0x00A8   (0x0004)  
};
#pragma pack(pop)

/// Class /Game/Aki/Core/Fight/BulletSceneInteraction.BulletSceneInteraction_C
/// Size: 0x00F8 (248 bytes) (0x000038 - 0x000130) align 16 pad: 0x0000
class UBulletSceneInteraction_C : public UPrimaryDataAsset
{ 
public:
	FSKuroInteractionLimbsConfig                       WaterInteraction;                                           // 0x0038   (0x0040)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0078   (0x0008)  MISSED
	FSWaterEffectObject                                WaterEffect;                                                // 0x0080   (0x00B0)  
};

/// Class /Game/Aki/CreatureTools/BPI_CreatureInterface.BPI_CreatureInterface_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UBPI_CreatureInterface_C : public UInterface
{ 
public:
	// int32_t GetEntityId();                                                                                                   // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_TaskMontage.BP_SM_TaskMontage_C
/// Size: 0x0018 (24 bytes) (0x000030 - 0x000048) align 8 pad: 0x0000
class UBP_SM_TaskMontage_C : public UASMTask
{ 
public:
	FString                                            MontageName;                                                // 0x0030   (0x0010)  
	bool                                               _R___g__;                                                   // 0x0040   (0x0001)  
	bool                                               AQ__;                                                       // 0x0041   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0042   (0x0002)  MISSED
	int32_t                                            BlendInTime;                                                // 0x0044   (0x0004)  
};

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateTag.BP_SM_BindStateTag_C
/// Size: 0x000C (12 bytes) (0x000030 - 0x00003C) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UBP_SM_BindStateTag_C : public UASMBindState
{ 
public:
	FGameplayTag                                       Tag;                                                        // 0x0030   (0x000C)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_TaskRandomMontage.BP_SM_TaskRandomMontage_C
/// Size: 0x0018 (24 bytes) (0x000030 - 0x000048) align 8 pad: 0x0000
class UBP_SM_TaskRandomMontage_C : public UASMTask
{ 
public:
	TArray<FString>                                    MontageNames;                                               // 0x0030   (0x0010)  
	bool                                               _R___g__;                                                   // 0x0040   (0x0001)  
	bool                                               AQ__;                                                       // 0x0041   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0042   (0x0002)  MISSED
	int32_t                                            BlendInTime;                                                // 0x0044   (0x0004)  
};

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateBuff.BP_SM_BindStateBuff_C
/// Size: 0x0008 (8 bytes) (0x000030 - 0x000038) align 8 pad: 0x0000
class UBP_SM_BindStateBuff_C : public UASMBindState
{ 
public:
	int64_t                                            BuffID;                                                     // 0x0030   (0x0008)  
};

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_TaskSkillByName.BP_SM_TaskSkillByName_C
/// Size: 0x0011 (17 bytes) (0x000030 - 0x000041) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class UBP_SM_TaskSkillByName_C : public UASMTask
{ 
public:
	FString                                            SkillName;                                                  // 0x0030   (0x0010)  
	bool                                               AQ__;                                                       // 0x0040   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateBoneCollision.BP_SM_BindStateBoneCollision_C
/// Size: 0x0016 (22 bytes) (0x000030 - 0x000046) align 8 pad: 0x0006
#pragma pack(push, 0x1)
class UBP_SM_BindStateBoneCollision_C : public UASMBindState
{ 
public:
	FString                                            ___;                                                        // 0x0030   (0x0010)  
	bool                                               ___c;                                                       // 0x0040   (0x0001)  
	bool                                               ___c0;                                                      // 0x0041   (0x0001)  
	bool                                               ___c1;                                                      // 0x0042   (0x0001)  
	bool                                               null;                                                       // 0x0043   (0x0001)  
	bool                                               null2;                                                      // 0x0044   (0x0001)  
	bool                                               null3;                                                      // 0x0045   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateMeshVisible.BP_SM_BindStateMeshVisible_C
/// Size: 0x0012 (18 bytes) (0x000030 - 0x000042) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class UBP_SM_BindStateMeshVisible_C : public UASMBindState
{ 
public:
	FString                                            Tag;                                                        // 0x0030   (0x0010)  
	bool                                               _f;                                                         // 0x0040   (0x0001)  
	bool                                               _S_T_b_;                                                    // 0x0041   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateDisableCollision.BP_SM_BindStateDisableCollision_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UBP_SM_BindStateDisableCollision_C : public UASMBindState
{ 
public:
};

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateCollisionChannel.BP_SM_BindStateCollisionChannel_C
/// Size: 0x0010 (16 bytes) (0x000030 - 0x000040) align 8 pad: 0x0000
class UBP_SM_BindStateCollisionChannel_C : public UASMBindState
{ 
public:
	SDK_UNDEFINED(16,976) /* TArray<TEnumAsByte<ECollisionChannel>> */ __um(IgnoreChannels);                       // 0x0030   (0x0010)  
};

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateSkillCounter.BP_SM_BindStateSkillCounter_C
/// Size: 0x0029 (41 bytes) (0x000030 - 0x000059) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class UBP_SM_BindStateSkillCounter_C : public UASMBindState
{ 
public:
	TArray<int32_t>                                    SkillIds;                                                   // 0x0030   (0x0010)  
	FString                                            ___gK;                                                      // 0x0040   (0x0010)  
	int32_t                                            _X_R_P;                                                     // 0x0050   (0x0004)  
	int32_t                                            _X_R_P0;                                                    // 0x0054   (0x0004)  
	bool                                               __;                                                         // 0x0058   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_ConditionAttribute.BP_SM_ConditionAttribute_C
/// Size: 0x000C (12 bytes) (0x000038 - 0x000044) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UBP_SM_ConditionAttribute_C : public UASMConditionBase
{ 
public:
	TEnumAsByte<EAttributeType>                        ____;                                                       // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	int32_t                                            Min;                                                        // 0x003C   (0x0004)  
	int32_t                                            Max;                                                        // 0x0040   (0x0004)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateBoneVisible.BP_SM_BindStateBoneVisible_C
/// Size: 0x0011 (17 bytes) (0x000030 - 0x000041) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class UBP_SM_BindStateBoneVisible_C : public UASMBindState
{ 
public:
	FString                                            ___;                                                        // 0x0030   (0x0010)  
	bool                                               _f;                                                         // 0x0040   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateCue.BP_SM_BindStateCue_C
/// Size: 0x0011 (17 bytes) (0x000030 - 0x000041) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class UBP_SM_BindStateCue_C : public UASMBindState
{ 
public:
	TArray<int64_t>                                    CueIds;                                                     // 0x0030   (0x0010)  
	bool                                               _R___g__;                                                   // 0x0040   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_BindStateAiHateConfig.BP_SM_BindStateAiHateConfig_C
/// Size: 0x0004 (4 bytes) (0x000030 - 0x000034) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UBP_SM_BindStateAiHateConfig_C : public UASMBindState
{ 
public:
	int32_t                                            configId;                                                   // 0x0030   (0x0004)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_TaskSkill.BP_SM_TaskSkill_C
/// Size: 0x0005 (5 bytes) (0x000030 - 0x000035) align 8 pad: 0x0005
#pragma pack(push, 0x1)
class UBP_SM_TaskSkill_C : public UASMTask
{ 
public:
	int32_t                                            skillId;                                                    // 0x0030   (0x0004)  
	bool                                               AQ__;                                                       // 0x0034   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_ActionResetPart.BP_SM_ActionResetPart_C
/// Size: 0x0012 (18 bytes) (0x000030 - 0x000042) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class UBP_SM_ActionResetPart_C : public UASMAction
{ 
public:
	FString                                            __M;                                                        // 0x0030   (0x0010)  
	bool                                               __n_;                                                       // 0x0040   (0x0001)  
	bool                                               __n_0;                                                      // 0x0041   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Character/BaseCharacter/StateMachine/BP_SM_ConditionBuffStack.BP_SM_ConditionBuffStack_C
/// Size: 0x0010 (16 bytes) (0x000038 - 0x000048) align 8 pad: 0x0000
class UBP_SM_ConditionBuffStack_C : public UASMConditionBase
{ 
public:
	int64_t                                            BuffID;                                                     // 0x0038   (0x0008)  
	int32_t                                            Min;                                                        // 0x0040   (0x0004)  
	int32_t                                            Max;                                                        // 0x0044   (0x0004)  
};

/// Class /Game/Aki/Character/BaseCharacter/Abilities/GB/BP_BulletLogicBase.BP_BulletLogicBase_C
/// Size: 0x0000 (0 bytes) (0x000030 - 0x000030) align 8 pad: 0x0000
class UBP_BulletLogicBase_C : public UObject
{ 
public:
	// void P_9____(class UObject* P_, float _8TD_);                                                                            // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void gb(class ATsBaseCharacter_C* _e_, class ATsBaseCharacter_C* _S_, FSBulletDataMain P_9_, class UObject* P_);         // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataBase.LogicDataBase_C
/// Size: 0x0001 (1 bytes) (0x000038 - 0x000039) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class ULogicDataBase_C : public UKuroBpDataAsset
{ 
public:
	TEnumAsByte<EBulletLogicStage>                     ExecuteStage;                                               // 0x0038   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataDestroyOtherBullet.LogicDataDestroyOtherBullet_C
/// Size: 0x0019 (25 bytes) (0x000039 - 0x000052) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class ULogicDataDestroyOtherBullet_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FString                                            BulletId;                                                   // 0x0040   (0x0010)  
	bool                                               SummonChildBullet;                                          // 0x0050   (0x0001)  
	TEnumAsByte<ECamp>                                 Camp;                                                       // 0x0051   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataWhirlpool.LogicDataWhirlpool_C
/// Size: 0x000B (11 bytes) (0x000039 - 0x000044) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class ULogicDataWhirlpool_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              WeightLimit;                                                // 0x003C   (0x0004)  
	float                                              MoveTime;                                                   // 0x0040   (0x0004)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataManipulatableTagsChange.LogicDataManipulatableTagsChange_C
/// Size: 0x0087 (135 bytes) (0x000039 - 0x0000C0) align 8 pad: 0x0000
class ULogicDataManipulatableTagsChange_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FGameplayTagContainer                              ExistTagsCondition;                                         // 0x0040   (0x0020)  
	FGameplayTagContainer                              UnExistTagsCondition;                                       // 0x0060   (0x0020)  
	FGameplayTagContainer                              AddTags;                                                    // 0x0080   (0x0020)  
	FGameplayTagContainer                              RemoveTags;                                                 // 0x00A0   (0x0020)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataManipulatableCreateBullet.LogicDataManipulatableCreateBullet_C
/// Size: 0x0059 (89 bytes) (0x000039 - 0x000092) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class ULogicDataManipulatableCreateBullet_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FGameplayTagContainer                              ExistTagsCondition;                                         // 0x0040   (0x0020)  
	FGameplayTagContainer                              UnExistTagsCondition;                                       // 0x0060   (0x0020)  
	TArray<FString>                                    CreateBulletRowName;                                        // 0x0080   (0x0010)  
	TEnumAsByte<EBulletObject>                         BulletOwner;                                                // 0x0090   (0x0001)  
	TEnumAsByte<EBulletObject>                         BulletTransform;                                            // 0x0091   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataSpawnObstacles.LogicDataSpawnObstacles_C
/// Size: 0x002E (46 bytes) (0x000039 - 0x000067) align 8 pad: 0x0007
#pragma pack(push, 0x1)
class ULogicDataSpawnObstacles_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	FName                                              ProfileName;                                                // 0x003C   (0x000C)  
	bool                                               ShowModel;                                                  // 0x0048   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0049   (0x0007)  MISSED
	class UStaticMesh*                                 Mesh;                                                       // 0x0050   (0x0008)  
	FVector                                            Size;                                                       // 0x0058   (0x000C)  
	bool                                               NeedAttach;                                                 // 0x0064   (0x0001)  
	bool                                               CanStandOn;                                                 // 0x0065   (0x0001)  
	TEnumAsByte<EBulletLogicObstacles>                 Model;                                                      // 0x0066   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataSuiGuang.LogicDataSuiGuang_C
/// Size: 0x001F (31 bytes) (0x000039 - 0x000058) align 8 pad: 0x0000
class ULogicDataSuiGuang_C : public ULogicDataBase_C
{ 
public:
	bool                                               IncludeBullet;                                              // 0x0039   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x003A   (0x0002)  MISSED
	FGameplayTag                                       NeedTag;                                                    // 0x003C   (0x000C)  
	FString                                            NewBulletId;                                                // 0x0048   (0x0010)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataShowMesh.LogicDataShowMesh_C
/// Size: 0x0027 (39 bytes) (0x000039 - 0x000060) align 8 pad: 0x0000
class ULogicDataShowMesh_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FSoftObjectPath                                    MaterialEffect;                                             // 0x0040   (0x0020)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataShakeScreen.LogicDataShakeScreen_C
/// Size: 0x005F (95 bytes) (0x000039 - 0x000098) align 8 pad: 0x0000
class ULogicDataShakeScreen_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              Count;                                                      // 0x003C   (0x0004)  
	FString                                            Epicenter;                                                  // 0x0040   (0x0010)  
	float                                              Falloff;                                                    // 0x0050   (0x0004)  
	float                                              InnerRadius;                                                // 0x0054   (0x0004)  
	float                                              interval;                                                   // 0x0058   (0x0004)  
	bool                                               OrientShakeTowardsEpicenter;                                // 0x005C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x005D   (0x0003)  MISSED
	float                                              OuterRadius;                                                // 0x0060   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0064   (0x0004)  MISSED
	SDK_UNDEFINED(48,977) /* TWeakObjectPtr<UClass*> */ __um(Shake);                                               // 0x0068   (0x0030)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataSplineMovement.LogicDataSplineMovement_C
/// Size: 0x0090 (144 bytes) (0x000039 - 0x0000C9) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class ULogicDataSplineMovement_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              Duration;                                                   // 0x003C   (0x0004)  
	SDK_UNDEFINED(48,978) /* TWeakObjectPtr<UEffectModelBase*> */ __um(EffectOnReach);                             // 0x0040   (0x0030)  
	float                                              Height;                                                     // 0x0070   (0x0004)  
	bool                                               IsDestroyReach;                                             // 0x0074   (0x0001)  
	bool                                               IsForwardTangent;                                           // 0x0075   (0x0001)  
	bool                                               IsSummonOnReach;                                            // 0x0076   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x0077   (0x0001)  MISSED
	float                                              Length;                                                     // 0x0078   (0x0004)  
	float                                              MaxSpeed;                                                   // 0x007C   (0x0004)  
	float                                              MinSpeed;                                                   // 0x0080   (0x0004)  
	float                                              rotate;                                                     // 0x0084   (0x0004)  
	float                                              SelfHeight;                                                 // 0x0088   (0x0004)  
	float                                              SelfLength;                                                 // 0x008C   (0x0004)  
	float                                              SelfRotate;                                                 // 0x0090   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0094   (0x0004)  MISSED
	SDK_UNDEFINED(48,979) /* TWeakObjectPtr<UClass*> */ __um(SplineTrace);                                         // 0x0098   (0x0030)  
	bool                                               UseTargetLocation;                                          // 0x00C8   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataSupport.LogicDataSupport_C
/// Size: 0x0040 (64 bytes) (0x000039 - 0x000079) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class ULogicDataSupport_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	FGameplayTag                                       Tag;                                                        // 0x003C   (0x000C)  
	SDK_UNDEFINED(48,980) /* TWeakObjectPtr<UEffectModelBase*> */ __um(Effect);                                    // 0x0048   (0x0030)  
	TEnumAsByte<ECamp>                                 Camp;                                                       // 0x0078   (0x0001)  
};
#pragma pack(pop)

/// Struct /Game/Aki/Character/BaseCharacter/Camera/SFloatCurve.SFloatCurve
/// Size: 0x0008 (8 bytes) (0x000000 - 0x000008) align 8 pad: 0x0000
struct FSFloatCurve
{ 
	class UCurveFloat*                                 FloatCurve_7_359BA05547FEF437AB4D5FA2DFC1F098;              // 0x0000   (0x0008)  
};

/// Struct /Game/Aki/Character/BaseCharacter/Camera/SCameraModifier_Lens.SCameraModifier_Lens
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 4 pad: 0x0000
struct FSCameraModifier_Lens
{ 
	float                                              StartFStop_22_2AE41BCC4091518F84A145BB74DE1484;             // 0x0000   (0x0004)  
	float                                              EndFStop_24_9ACD9C10479EA8CE3B0D498E1D40FE1D;               // 0x0004   (0x0004)  
	float                                              RadialBlurStartIntensity_17_489DCA6F4E415B5242297EB8E070B416; // 0x0008   (0x0004)  
	float                                              RadialBlurEndIntensity_19_B5497B4A4630D7B38E0AC49FAC4A0D9A; // 0x000C   (0x0004)  
	FVector2D                                          RadialBlurCenter_6_9B288F0547473F71093BEEA3E37782F3;        // 0x0010   (0x0008)  
	float                                              RadialBlurRadius_9_DF54853044DAF80EBD76EA96BEB2D255;        // 0x0018   (0x0004)  
	float                                              RadialBlurHardness_11_36F4281F4305AAA87E4E4F92C403BB67;     // 0x001C   (0x0004)  
	float                                              RadialBlurPassNumber_13_28C543494EE741E1D7FBF38619D85057;   // 0x0020   (0x0004)  
	float                                              RadialBlurSampleNumber_15_3B432AD74740E2D8A277E5AA019FC441; // 0x0024   (0x0004)  
};

/// Struct /Game/Aki/Character/BaseCharacter/Camera/SCameraModifier_Settings.SCameraModifier_Settings
/// Size: 0x00E8 (232 bytes) (0x000000 - 0x0000E8) align 8 pad: 0x0000
struct FSCameraModifier_Settings
{ 
	int32_t                                            Priority_101_E74404724F7BCD1A815B9E8ECCEE64EC;              // 0x0000   (0x0004)  
	bool                                               IsModifiedArmLength_73_1686AE5842DD198072484BB2D855CAEB;    // 0x0004   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0005   (0x0003)  MISSED
	float                                              ArmLength_74_192752C04380D5CAF2EB7E910DC5C9C5;              // 0x0008   (0x0004)  
	float                                              ArmLengthAdditional_75_3ED4AAB647CA6863AC2F9F9C1D48D229;    // 0x000C   (0x0004)  
	bool                                               IsModifiedArmRotation_76_570606324FC53E504274BDA6F59BD5C3;  // 0x0010   (0x0001)  
	bool                                               IsModifiedArmRotationRoll_93_6CBBDC9043D8BF5E4EC3AB8E5473C625; // 0x0011   (0x0001)  
	bool                                               IsModifiedArmRotationPitch_94_6C16441D44C806A072B75DA882811D0C; // 0x0012   (0x0001)  
	bool                                               IsModifiedArmRotationYaw_95_FBE820DB4C8D5B75CEF242854F6F3774; // 0x0013   (0x0001)  
	FRotator                                           ArmRotation_77_B66F0D944DE7F4829886B997E0B1B89F;            // 0x0014   (0x000C)  
	FRotator                                           ArmRotationAdditional_78_A62C514641B680F97462AFB1C30145B6;  // 0x0020   (0x000C)  
	bool                                               IsModifyArmRotationBasedOnActorRotation_116_BEFC838C4104D109C6F38D82C10E3603; // 0x002C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x002D   (0x0003)  MISSED
	float                                              FocusCameraRelativeYaw_84_A1176B774431A0E9E231989EF65C2767; // 0x0030   (0x0004)  
	bool                                               IsModifiedCameraOffset_79_43F688EC4B642A9CB92B0A8548187E16; // 0x0034   (0x0001)  
	bool                                               IsModifiedCameraOffsetX_96_CCEBEC98498BB408B5BA0AB0BD15F414; // 0x0035   (0x0001)  
	bool                                               IsModifiedCameraOffsetY_97_F5766DB146F88618F570C4A1F04A00F7; // 0x0036   (0x0001)  
	bool                                               IsModifiedCameraOffsetZ_98_E6E0795348BE5A8749FB348FAD18D836; // 0x0037   (0x0001)  
	FVector                                            CameraOffset_80_EB37D424428EBE421F9AAEB064701EAD;           // 0x0038   (0x000C)  
	FVector                                            CameraOffsetAdditional_81_DABDCE1243662E3E72DB62A0B56CEA53; // 0x0044   (0x000C)  
	bool                                               IsModifiedCameraFov_53_1A8D869C4A5886B266452BBCB07BA93A;    // 0x0050   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0051   (0x0003)  MISSED
	float                                              CameraFov_63_A418591F41F5EF0F2D3D19B8F9967FC9;              // 0x0054   (0x0004)  
	bool                                               OverrideCameraInput_59_0083E3164D765950CF70528078BF8218;    // 0x0058   (0x0001)  
	bool                                               StopModifyOnMontageEnd_61_E5E58E644EDFAC8B5A53C08F375C0567; // 0x0059   (0x0001)  
	bool                                               ResetFinalArmRotation_70_56DCE7204671EC361892799BE39735C5;  // 0x005A   (0x0001)  
	bool                                               ResetFinalArmLength_72_0D8B0AFC4AA34A5415C9C6AC3D25FE4E;    // 0x005B   (0x0001)  
	bool                                               IsLockInput_86_CDDE4FA4418F23E40016969CB0D3623C;            // 0x005C   (0x0001)  
	bool                                               IsLerpArmLocation_111_5A5B00E645FAC54E063E8A93C1764D62;     // 0x005D   (0x0001)  
	unsigned char                                      UnknownData03_6[0x2];                                       // 0x005E   (0x0002)  MISSED
	float                                              MaxLookTargetAngle_108_B7453209457235E304455B91D84BDB4E;    // 0x0060   (0x0004)  
	float                                              MaxLookTargetAngleSpeed_110_32C2C0AE4FC4D3A9B189AE84953EB88A; // 0x0064   (0x0004)  
	bool                                               IsSwitchModifier_113_0BCB940D4AB7A06EB3485D98E853EC0A;      // 0x0068   (0x0001)  
	bool                                               IsUseArmLengthFloatCurve_145_52D03678481BE2CC47BAA09BB214D15F; // 0x0069   (0x0001)  
	unsigned char                                      UnknownData04_6[0x6];                                       // 0x006A   (0x0006)  MISSED
	FSFloatCurve                                       ArmLengthFloatCurve_146_2D69FECF4D82AFC253FA71B87883C047;   // 0x0070   (0x0008)  
	bool                                               IsUseArmRotationFloatCurve_147_A8AAAED54FF2147DFE0679962E192D84; // 0x0078   (0x0001)  
	unsigned char                                      UnknownData05_6[0x7];                                       // 0x0079   (0x0007)  MISSED
	FSFloatCurve                                       ArmRotationFloatCurve_148_68D46B3A4AF5A1E5882134A1981EBD80; // 0x0080   (0x0008)  
	bool                                               IsUseFovFloatCurve_149_C20764494AB9E116CE38FAA7715D45A5;    // 0x0088   (0x0001)  
	unsigned char                                      UnknownData06_6[0x7];                                       // 0x0089   (0x0007)  MISSED
	FSFloatCurve                                       FovFloatCurve_150_743C892B48A7416DE017A7BB65D2A494;         // 0x0090   (0x0008)  
	bool                                               IsModifiedCameraLens_165_4CA316F7450454A95F4B8BAFC6D2C306;  // 0x0098   (0x0001)  
	bool                                               IsUseLensFloatCurve_160_94D8F5374B9F5984B7E397801C0F5C78;   // 0x0099   (0x0001)  
	unsigned char                                      UnknownData07_6[0x6];                                       // 0x009A   (0x0006)  MISSED
	FSFloatCurve                                       LensFloatCurve_162_5C23EC1E47E31D144B2F018C6CF0C2D4;        // 0x00A0   (0x0008)  
	FSCameraModifier_Lens                              CameraLens_168_CC7FDCB54DB07FE211EE92BCF33EE2A0;            // 0x00A8   (0x0028)  
	bool                                               ResetFinalArmRotationToFocus_172_43F64407465FF68A8BA3B68991CCADAD; // 0x00D0   (0x0001)  
	unsigned char                                      UnknownData08_6[0x7];                                       // 0x00D1   (0x0007)  MISSED
	FString                                            Name_175_28D975324D4AEC9BFBFF84B8F8633373;                  // 0x00D8   (0x0010)  
};

/// Struct /Game/Aki/Character/BaseCharacter/SCounterAttackCamera.SCounterAttackCamera
/// Size: 0x0118 (280 bytes) (0x000000 - 0x000118) align 8 pad: 0x0000
struct FSCounterAttackCamera
{ 
	FGameplayTag                                       Tag_26_5F7910584795619EF6679EB61BB46FF8;                    // 0x0000   (0x000C)  
	float                                              _c___e___;                                                  // 0x000C   (0x0004)  
	float                                              _meQ_e___;                                                  // 0x0010   (0x0004)  
	float                                              _m_Q_e___;                                                  // 0x0014   (0x0004)  
	float                                              Sb_e_m_Q_e___;                                              // 0x0018   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x001C   (0x0004)  MISSED
	FString                                            CameraAttachSocket_18_6C5DA6F14E99C3E47A533BAC2B020FBD;     // 0x0020   (0x0010)  
	FSCameraModifier_Settings                          Dd_P_gM_n__;                                                // 0x0030   (0x00E8)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataRebound.LogicDataRebound_C
/// Size: 0x01AB (427 bytes) (0x000039 - 0x0001E4) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class ULogicDataRebound_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	TArray<FString>                                    BulletRowName;                                              // 0x0040   (0x0010)  
	SDK_UNDEFINED(48,981) /* TWeakObjectPtr<UEffectModelBase*> */ __um(EffectRebound);                             // 0x0050   (0x0030)  
	FVector                                            PositionOffset;                                             // 0x0080   (0x000C)  
	FRotator                                           RotationOffset;                                             // 0x008C   (0x000C)  
	SDK_UNDEFINED(48,982) /* TWeakObjectPtr<UClass*> */ __um(ScreenShake);                                         // 0x0098   (0x0030)  
	FSCounterAttackCamera                              CameraModified;                                             // 0x00C8   (0x0118)  
	int32_t                                            ReboundBitMask;                                             // 0x01E0   (0x0004)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataFreeze.LogicDataFreeze_C
/// Size: 0x002C (44 bytes) (0x000039 - 0x000065) align 8 pad: 0x0005
#pragma pack(push, 0x1)
class ULogicDataFreeze_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FGameplayTagContainer                              Tags;                                                       // 0x0040   (0x0020)  
	float                                              FreezeTime;                                                 // 0x0060   (0x0004)  
	TEnumAsByte<EBulletObject>                         Target;                                                     // 0x0064   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataAdditiveAccelerate.LogicDataAdditiveAccelerate_C
/// Size: 0x0017 (23 bytes) (0x000039 - 0x000050) align 8 pad: 0x0000
class ULogicDataAdditiveAccelerate_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	FVector                                            Acceleration;                                               // 0x003C   (0x000C)  
	class UCurveVector*                                AccelerationCurve;                                          // 0x0048   (0x0008)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataSpeedReduce.LogicDataSpeedReduce_C
/// Size: 0x000F (15 bytes) (0x000039 - 0x000048) align 8 pad: 0x0000
class ULogicDataSpeedReduce_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              SpeedDampingRatio;                                          // 0x003C   (0x0004)  
	bool                                               IsNotThroughObstacles;                                      // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              MinSpeed;                                                   // 0x0044   (0x0004)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataForce.LogicDataForce_C
/// Size: 0x005F (95 bytes) (0x000039 - 0x000098) align 8 pad: 0x0000
class ULogicDataForce_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              ForceBase;                                                  // 0x003C   (0x0004)  
	float                                              ForceDampingRatio;                                          // 0x0040   (0x0004)  
	float                                              InnerRadius;                                                // 0x0044   (0x0004)  
	float                                              OuterRadius;                                                // 0x0048   (0x0004)  
	int32_t                                            LimitWeight;                                                // 0x004C   (0x0004)  
	bool                                               ConstantForce;                                              // 0x0050   (0x0001)  
	bool                                               TowardsBullet;                                              // 0x0051   (0x0001)  
	bool                                               HaveTopArea;                                                // 0x0052   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1];                                       // 0x0053   (0x0001)  MISSED
	float                                              TopAreaHeight;                                              // 0x0054   (0x0004)  
	float                                              ContinueTime;                                               // 0x0058   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x005C   (0x0004)  MISSED
	class UCurveFloat*                                 ContinueTimeCurve;                                          // 0x0060   (0x0008)  
	bool                                               IsLaunching;                                                // 0x0068   (0x0001)  
	unsigned char                                      UnknownData03_6[0x7];                                       // 0x0069   (0x0007)  MISSED
	FGameplayTagContainer                              WorkHaveTag;                                                // 0x0070   (0x0020)  
	bool                                               IsResetOnLast;                                              // 0x0090   (0x0001)  
	unsigned char                                      UnknownData04_6[0x3];                                       // 0x0091   (0x0003)  MISSED
	int32_t                                            Group;                                                      // 0x0094   (0x0004)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataDestroyBullet.LogicDataDestroyBullet_C
/// Size: 0x0019 (25 bytes) (0x000039 - 0x000052) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class ULogicDataDestroyBullet_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FString                                            DestroyBulletRowName;                                       // 0x0040   (0x0010)  
	bool                                               SummonChildBullet;                                          // 0x0050   (0x0001)  
	TEnumAsByte<EBulletObject>                         BulletOwner;                                                // 0x0051   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/TypeScript/Game/NewWorld/Bullet/LogicDataClass/LogicDataCreateBullet.LogicDataCreateBullet_C
/// Size: 0x003A (58 bytes) (0x000039 - 0x000073) align 8 pad: 0x0003
#pragma pack(push, 0x1)
class ULogicDataCreateBullet_C : public ULogicDataBase_C
{ 
public:
	unsigned char                                      UnknownData00_3[0x7];                                       // 0x0039   (0x0007)  MISSED
	FString                                            CreateBulletRowName;                                        // 0x0040   (0x0010)  
	FString                                            AttachToBoneName;                                           // 0x0050   (0x0010)  
	FString                                            FlashBulletRowName;                                         // 0x0060   (0x0010)  
	TEnumAsByte<EBulletObject>                         BulletOwner;                                                // 0x0070   (0x0001)  
	TEnumAsByte<EBulletObject>                         BulletTransform;                                            // 0x0071   (0x0001)  
	TEnumAsByte<EBulletObject>                         AttachToActor;                                              // 0x0072   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/Interaction/PDA_InteractionGlobalConfigParameters.PDA_InteractionGlobalConfigParameters_C
/// Size: 0x002C (44 bytes) (0x000038 - 0x000064) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class UPDA_InteractionGlobalConfigParameters_C : public UPrimaryDataAsset
{ 
public:
	bool                                               _T_u_i;                                                     // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              _i___N;                                                     // 0x003C   (0x0004)  
	bool                                               _T_u4l;                                                     // 0x0040   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              _4lb__N;                                                    // 0x0044   (0x0004)  
	float                                              _4lb__N_N;                                                  // 0x0048   (0x0004)  
	float                                              _4l_l___Pb;                                                 // 0x004C   (0x0004)  
	float                                              _i__b_;                                                     // 0x0050   (0x0004)  
	float                                              _4l_l__i;                                                   // 0x0054   (0x0004)  
	float                                              _4l_l___;                                                   // 0x0058   (0x0004)  
	float                                              _4l_;                                                       // 0x005C   (0x0004)  
	float                                              _4l_l_;                                                     // 0x0060   (0x0004)  
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/Interaction/PDA_InteractionGlobalConfig.PDA_InteractionGlobalConfig_C
/// Size: 0x01BA (442 bytes) (0x000038 - 0x0001F2) align 8 pad: 0x0002
#pragma pack(push, 0x1)
class UPDA_InteractionGlobalConfig_C : public UPrimaryDataAsset
{ 
public:
	bool                                               O____b_g4l;                                                 // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
	FSoftObjectPath                                    _i__b_;                                                     // 0x0040   (0x0020)  
	FSoftObjectPath                                    _i___N_N;                                                   // 0x0060   (0x0020)  
	FSoftObjectPath                                    _i____;                                                     // 0x0080   (0x0020)  
	FSoftObjectPath                                    _4lb__l__;                                                  // 0x00A0   (0x0020)  
	FSoftObjectPath                                    _4lb__l__0;                                                 // 0x00C0   (0x0020)  
	FSoftObjectPath                                    ___e_j;                                                     // 0x00E0   (0x0020)  
	FSoftObjectPath                                    _4lb__l__1;                                                 // 0x0100   (0x0020)  
	FSoftObjectPath                                    _i___N;                                                     // 0x0120   (0x0020)  
	FSoftObjectPath                                    _i___N_N2;                                                  // 0x0140   (0x0020)  
	FSoftObjectPath                                    _4lb__N;                                                    // 0x0160   (0x0020)  
	FSoftObjectPath                                    _4lb__N_N4;                                                 // 0x0180   (0x0020)  
	FSoftObjectPath                                    _4lb__N_N43;                                                // 0x01A0   (0x0020)  
	FSoftObjectPath                                    _4lb__N_N44;                                                // 0x01C0   (0x0020)  
	bool                                               O____b_gI_;                                                 // 0x01E0   (0x0001)  
	bool                                               _Pbk4;                                                      // 0x01E1   (0x0001)  
	bool                                               _PbkI;                                                      // 0x01E2   (0x0001)  
	unsigned char                                      UnknownData01_6[0x5];                                       // 0x01E3   (0x0005)  MISSED
	class UPDA_InteractionGlobalConfigParameters_C*    _N_N;                                                       // 0x01E8   (0x0008)  
	bool                                               __6R_T_;                                                    // 0x01F0   (0x0001)  
	bool                                               __6R_T_5;                                                   // 0x01F1   (0x0001)  
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/Interaction/PDA_InteractionActorConfig.PDA_InteractionActorConfig_C
/// Size: 0x00B8 (184 bytes) (0x000038 - 0x0000F0) align 8 pad: 0x0000
class UPDA_InteractionActorConfig_C : public UPrimaryDataAsset
{ 
public:
	bool                                               _T_u4l;                                                     // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              _4lb__N;                                                    // 0x003C   (0x0004)  
	float                                              _4lb__N_;                                                   // 0x0040   (0x0004)  
	float                                              _4lb__N_N;                                                  // 0x0044   (0x0004)  
	float                                              _e____;                                                     // 0x0048   (0x0004)  
	float                                              _4lb__N_N0;                                                 // 0x004C   (0x0004)  
	float                                              _4lb__N_N1;                                                 // 0x0050   (0x0004)  
	float                                              _4lb__N_N2;                                                 // 0x0054   (0x0004)  
	FKuroCurveFloat                                    _N_N_____;                                                  // 0x0058   (0x0090)  
	float                                              _N_N__;                                                     // 0x00E8   (0x0004)  
	float                                              _N_NMO;                                                     // 0x00EC   (0x0004)  
};

/// Class /Game/Aki/Audio/AkTools/WorldPointSound/Audio_Multi_Base.Audio_Multi_Base_C
/// Size: 0x0055 (85 bytes) (0x0002A8 - 0x0002FD) align 8 pad: 0x0005
#pragma pack(push, 0x1)
class AAudio_Multi_Base_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class UInstancedStaticMeshComponent*               I;                                                          // 0x02B0   (0x0008)  
	class UAkComponent*                                Ak;                                                         // 0x02B8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02C0   (0x0008)  
	class UAkAudioEvent*                               Event;                                                      // 0x02C8   (0x0008)  
	float                                              _Q_____e;                                                   // 0x02D0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02D4   (0x0004)  MISSED
	TArray<FTransform>                                 MultiPos;                                                   // 0x02D8   (0x0010)  
	float                                              Am__;                                                       // 0x02E8   (0x0004)  
	float                                              _Y_p_Q___;                                                  // 0x02EC   (0x0004)  
	FVector                                            Pg__;                                                       // 0x02F0   (0x000C)  
	bool                                               _f_T_W;                                                     // 0x02FC   (0x0001)  
	// void Hide();                                                                                                             // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Show();                                                                                                             // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Gameplay();                                                                                                         // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _____();                                                                                                            // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void _f_yAm();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ___S_(FVector& _N_);                                                                                                // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// void Sb();                                                                                                               // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void p__QJS____(float& p__Q);                                                                                            // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// void Stop();                                                                                                             // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Play();                                                                                                             // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _nd__();                                                                                                            // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void Am____();                                                                                                           // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _9hnc_Q____();                                                                                                      // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void _S_();                                                                                                              // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
	// void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x25a7960] Event|Protected|BlueprintEvent 
	// void ExecuteUbergraph_Audio_Multi_Base(int32_t EntryPoint);                                                              // [0x25a7960] Final                
};
#pragma pack(pop)

/// Class /Game/Aki/AI/AIMoveSplineCount/CommonEffectMoveSpline2.CommonEffectMoveSpline2_C
/// Size: 0x0008 (8 bytes) (0x0002A8 - 0x0002B0) align 8 pad: 0x0000
class ACommonEffectMoveSpline2_C : public AActor
{ 
public:
	class UKuroMoveSplineComponent*                    KuroMoveSpline;                                             // 0x02A8   (0x0008)  
};

/// Class /Game/Aki/Render/RuntimeBP/Scene/Destructible/BP_KuroDestructibleActor.BP_KuroDestructibleActor_C
/// Size: 0x00A0 (160 bytes) (0x0002C0 - 0x000360) align 8 pad: 0x0000
class ABP_KuroDestructibleActor_C : public ADestructibleActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        ProxyMesh;                                                  // 0x02C8   (0x0008)  
	class UCharRenderingComponent_C*                   CharRenderingComponent;                                     // 0x02D0   (0x0008)  
	SDK_UNDEFINED(48,983) /* TWeakObjectPtr<UEffectModelBase*> */ __um(EffectDataAsset);                           // 0x02D8   (0x0030)  
	FCollisionResponseContainer                        OnDestoryReponses;                                          // 0x0308   (0x0020)  
	bool                                               IsDebug;                                                    // 0x0328   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0329   (0x0003)  MISSED
	float                                              Impluse;                                                    // 0x032C   (0x0004)  
	float                                              ImpluseFactor;                                              // 0x0330   (0x0004)  
	float                                              DamageRadius;                                               // 0x0334   (0x0004)  
	class UPD_CharacterControllerData_C*               MaterialControllerData;                                     // 0x0338   (0x0008)  
	FVector                                            OriginOffset;                                               // 0x0340   (0x000C)  
	float                                              BaseForce;                                                  // 0x034C   (0x0004)  
	bool                                               IgnoreBullet;                                               // 0x0350   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x0351   (0x0003)  MISSED
	FVector                                            HurtOrigin;                                                 // 0x0354   (0x000C)  
	// bool IsMobile();                                                                                                         // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void ModifiedCollison();                                                                                                 // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ApplyDamage(FVector& HurtOrigin, FVector SpeedDirection);                                                           // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
	// void OnFractureEvent(FVector& HitPoint, FVector& HitDirection);                                                          // [0x25a7960] HasOutParms|BlueprintCallable|BlueprintEvent 
	// void PlayDestruction(FVector& HurtOrigin, float Impluse, bool IsZeroImpluse);                                            // [0x25a7960] HasOutParms|BlueprintCallable|BlueprintEvent 
	// void ExecuteUbergraph_BP_KuroDestructibleActor(int32_t EntryPoint);                                                      // [0x25a7960] Final|HasDefaults    
};

/// Class /Game/Aki/Data/Fight/AssestStruct/BP_SplineMoveConfig.BP_SplineMoveConfig_C
/// Size: 0x0018 (24 bytes) (0x000038 - 0x000050) align 8 pad: 0x0000
class UBP_SplineMoveConfig_C : public UPrimaryDataAsset
{ 
public:
	float                                              TurnRate;                                                   // 0x0038   (0x0004)  
	float                                              AirControl;                                                 // 0x003C   (0x0004)  
	float                                              JumpHeightRate;                                             // 0x0040   (0x0004)  
	float                                              JumpTimeScale;                                              // 0x0044   (0x0004)  
	float                                              MaxFlySpeed;                                                // 0x0048   (0x0004)  
	float                                              AnsAccel;                                                   // 0x004C   (0x0004)  
};

/// Class /Game/Aki/TypeScript/Game/NewWorld/SceneItem/BaseItem/TsBaseItem.TsBaseItem_C
/// Size: 0x0010 (16 bytes) (0x0002A8 - 0x0002B8) align 8 pad: 0x0000
class ATsBaseItem_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02B0   (0x0008)  
	// FString GetTagDebugStrings();                                                                                            // [0x13db470] Native|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x13db470] Native|Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void ExecuteUbergraph_TsBaseItem(int32_t EntryPoint);                                                                    // [0x13db470] Final|Native|Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/Aki/Character/Item/BP_BaseItem.BP_BaseItem_C
/// Size: 0x0024 (36 bytes) (0x0002B8 - 0x0002DC) align 8 pad: 0x0004
#pragma pack(push, 0x1)
class ABP_BaseItem_C : public ATsBaseItem_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  
	class USphereComponent*                            DetectSphere;                                               // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x02C8   (0x0008)  
	class USceneComponent*                             Scene;                                                      // 0x02D0   (0x0008)  
	int32_t                                            EntityID;                                                   // 0x02D8   (0x0004)  
	// int32_t GetEntityId();                                                                                                   // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void ApplyEntityId(int32_t EntityID);                                                                                    // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Public|Protected|BlueprintCallable|BlueprintEvent 
	// void ExecuteUbergraph_BP_BaseItem(int32_t EntryPoint);                                                                   // [0x25a7960] Final                
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/Scene/BlueprintLevel/BP_KuroISMGroup.BP_KuroISMGroup_C
/// Size: 0x0029 (41 bytes) (0x0002A8 - 0x0002D1) align 8 pad: 0x0001
#pragma pack(push, 0x1)
class ABP_KuroISMGroup_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02B0   (0x0008)  
	bool                                               HideLogicallyOnBeginPlay;                                   // 0x02B8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02B9   (0x0003)  MISSED
	float                                              DitherProgress;                                             // 0x02BC   (0x0004)  
	float                                              Duration;                                                   // 0x02C0   (0x0004)  
	bool                                               IsTick;                                                     // 0x02C4   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x02C5   (0x0003)  MISSED
	float                                              DeltaSeconds;                                               // 0x02C8   (0x0004)  
	float                                              Time;                                                       // 0x02CC   (0x0004)  
	bool                                               IsShow;                                                     // 0x02D0   (0x0001)  
	// void Timer(float& ElapsedTime);                                                                                          // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void MaterialParameterGradient(float DeltalTime);                                                                        // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void SeyLogicallyShowForAllChildren();                                                                                   // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void SeyLogicallyHiddenForAllChildren();                                                                                 // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void EditorValidCheck();                                                                                                 // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void IsEditor(bool& IsEditor);                                                                                           // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void UserConstructionScript();                                                                                           // [0x25a7960] Event|Public|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x25a7960] Event|Public|BlueprintEvent 
	// void ExecuteUbergraph_BP_KuroISMGroup(int32_t EntryPoint);                                                               // [0x25a7960] Final|HasDefaults    
};
#pragma pack(pop)

/// Class /Game/Aki/Render/RuntimeBP/Scene/Light/BP_LightsGroup.BP_LightsGroup_C
/// Size: 0x0060 (96 bytes) (0x0002A8 - 0x000308) align 8 pad: 0x0000
class ABP_LightsGroup_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x02B0   (0x0008)  
	bool                                               IsTick;                                                     // 0x02B8   (0x0001)  
	bool                                               TurnOffOrOn;                                                // 0x02B9   (0x0001)  
	bool                                               UseSimpleToggle;                                            // 0x02BA   (0x0001)  
	bool                                               UseColorChange;                                             // 0x02BB   (0x0001)  
	float                                              Time;                                                       // 0x02BC   (0x0004)  
	float                                              Duration;                                                   // 0x02C0   (0x0004)  
	float                                              DeltaSeconds;                                               // 0x02C4   (0x0004)  
	TArray<float>                                      LightsIntensity;                                            // 0x02C8   (0x0010)  
	FLinearColor                                       ColorOriginal;                                              // 0x02D8   (0x0010)  
	FLinearColor                                       ColorTarget;                                                // 0x02E8   (0x0010)  
	FString                                            Test;                                                       // 0x02F8   (0x0010)  
	// void LightsColorChange(float ElapsedTime, FLinearColor ColorOriginal, FLinearColor ColorTarget);                         // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void ToggleLightsColorChange();                                                                                          // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void GetLightsIntensity();                                                                                               // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void Timer(float& ElapsedTime);                                                                                          // [0x25a7960] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// void TurnOnLights(float ElapsedTime);                                                                                    // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void TurnOffLights(float ElapsedTime);                                                                                   // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void ToggleLightsIntensity();                                                                                            // [0x25a7960] Public|BlueprintCallable|BlueprintEvent 
	// void ToggleLights(bool InEnable);                                                                                        // [0x25a7960] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// void ReceiveBeginPlay();                                                                                                 // [0x25a7960] Event|Protected|BlueprintEvent 
